config.org
#+TITLE: coldnew 的 emacs 配置
#+AUTHOR: Yen-Chin, Lee <coldnew>
#+email: coldnew.tw at gmail.com
#+STARTUP: overview indent align
#+PROPERTY: noweb tangle
#+OPTIONS: ^:nil

* 筆記
** 書籤管理
*** 按鍵
| 按鍵    | 命令                | 用途                     |
|---------+---------------------+--------------------------|
| C-x r m | bookmark-set        | 設置書籤                 |
| C-x r b | bookmark-jump       | 跳轉到書籤               |
| C-x r l | bookmark-bmenu-list | 開啟一個 buffer 列出書籤 |
|         | bookmark-delete     | 刪除書籤                 |
|         | bookmark-load       | 讀取已儲存的書籤檔案     |
*** 配置
| 變數名稱              | 預設值               | 用途           |
|-----------------------+----------------------+----------------|
| bookmark-default-file | ~/.emacs.d/bookmarks | 預設的書籤檔案 |
| bookmark-save-flag    | t                    |                |
** 正規表達式
*** 使用 rx 來製作正規表達式
rx 為 emacs macro，可以幫助產生 emacs 的正規表達式
**** TODO 理解並翻譯回中文
rx is a Lisp macro in `rx.el'.

(rx &rest REGEXPS)

Translate regular expressions REGEXPS in sexp form to a regexp string.
REGEXPS is a non-empty sequence of forms of the sort listed below.

Note that `rx' is a Lisp macro; when used in a Lisp program being
compiled, the translation is performed by the compiler.
See `rx-to-string' for how to do such a translation at run-time.

The following are valid subforms of regular expressions in sexp
notation.

STRING
matches string STRING literally.

CHAR
matches character CHAR literally.

`not-newline', `nonl'
matches any character except a newline.

`anything'
matches any character

`(any SET ...)'
`(in SET ...)'
`(char SET ...)'
matches any character in SET ....  SET may be a character or string.
Ranges of characters can be specified as `A-Z' in strings.
Ranges may also be specified as conses like `(?A . ?Z)'.

SET may also be the name of a character class: `digit',
`control', `hex-digit', `blank', `graph', `print', `alnum',
`alpha', `ascii', `nonascii', `lower', `punct', `space', `upper',
`word', or one of their synonyms.

`(not (any SET ...))'
matches any character not in SET ...

`line-start', `bol'
matches the empty string, but only at the beginning of a line
in the text being matched

`line-end', `eol'
is similar to `line-start' but matches only at the end of a line

`string-start', `bos', `bot'
matches the empty string, but only at the beginning of the
string being matched against.

`string-end', `eos', `eot'
matches the empty string, but only at the end of the
string being matched against.

`buffer-start'
matches the empty string, but only at the beginning of the
buffer being matched against.  Actually equivalent to `string-start'.

`buffer-end'
matches the empty string, but only at the end of the
buffer being matched against.  Actually equivalent to `string-end'.

`point'
matches the empty string, but only at point.

`word-start', `bow'
matches the empty string, but only at the beginning of a word.

`word-end', `eow'
matches the empty string, but only at the end of a word.

`word-boundary'
matches the empty string, but only at the beginning or end of a
word.

`(not word-boundary)'
`not-word-boundary'
matches the empty string, but not at the beginning or end of a
word.

`symbol-start'
matches the empty string, but only at the beginning of a symbol.

`symbol-end'
matches the empty string, but only at the end of a symbol.

`digit', `numeric', `num'
matches 0 through 9.

`control', `cntrl'
matches ASCII control characters.

`hex-digit', `hex', `xdigit'
matches 0 through 9, a through f and A through F.

`blank'
matches space and tab only.

`graphic', `graph'
matches graphic characters--everything except ASCII control chars,
space, and DEL.

`printing', `print'
matches printing characters--everything except ASCII control chars
and DEL.

`alphanumeric', `alnum'
matches letters and digits.  (But at present, for multibyte characters,
it matches anything that has word syntax.)

`letter', `alphabetic', `alpha'
matches letters.  (But at present, for multibyte characters,
it matches anything that has word syntax.)

`ascii'
matches ASCII (unibyte) characters.

`nonascii'
matches non-ASCII (multibyte) characters.

`lower', `lower-case'
matches anything lower-case.

`upper', `upper-case'
matches anything upper-case.

`punctuation', `punct'
matches punctuation.  (But at present, for multibyte characters,
it matches anything that has non-word syntax.)

`space', `whitespace', `white'
matches anything that has whitespace syntax.

`word', `wordchar'
matches anything that has word syntax.

`not-wordchar'
matches anything that has non-word syntax.

`(syntax SYNTAX)'
matches a character with syntax SYNTAX.  SYNTAX must be one
of the following symbols, or a symbol corresponding to the syntax
character, e.g. `\.' for `\s.'.

`whitespace'            (\s- in string notation)
`punctuation'           (\s.)
`word'                  (\sw)
`symbol'                        (\s_)
`open-parenthesis'              (\s()
`close-parenthesis'     (\s))
`expression-prefix'     (\s')
`string-quote'          (\s")
`paired-delimiter'              (\s$)
`escape'                        (\s\)
`character-quote'               (\s/)
`comment-start'         (\s<)
`comment-end'           (\s>)
`string-delimiter'              (\s|)
`comment-delimiter'     (\s!)

`(not (syntax SYNTAX))'
matches a character that doesn't have syntax SYNTAX.

`(category CATEGORY)'
matches a character with category CATEGORY.  CATEGORY must be
either a character to use for C, or one of the following symbols.

| consonant                        | (\c0 in string notation) |
| base-vowel                       | (\c1)                    |
| upper-diacritical-mark           | (\c2)                    |
| lower-diacritical-mark           | (\c3)                    |
| tone-mark                        | (\c4)                    |
| symbol                           | (\c5)                    |
| digit                            | (\c6)                    |
| vowel-modifying-diacritical-mark | (\c7)                    |
| vowel-sign                       | (\c8)                    |
| semivowel-lower                  | (\c9)                    |
| not-at-end-of-line               | (\c<)                    |
| not-at-beginning-of-line         | (\c>)                    |
| alpha-numeric-two-byte           | (\cA)                    |
| chinse-two-byte                  | (\cC)                    |
| greek-two-byte                   | (\cG)                    |
| japanese-hiragana-two-byte       | (\cH)                    |
| indian-tow-byte                  | (\cI)                    |
| japanese-katakana-two-byte       | (\cK)                    |
| korean-hangul-two-byte           | (\cN)                    |
| cyrillic-two-byte                | (\cY)                    |
| combining-diacritic              | (\c^)                    |
| ascii                            | (\ca)                    |
| arabic                           | (\cb)                    |
| chinese                          | (\cc)                    |
| ethiopic                         | (\ce)                    |
| greek                            | (\cg)                    |
| korean                           | (\ch)                    |
| indian                           | (\ci)                    |
| japanese                         | (\cj)                    |
| japanese-katakana                | (\ck)                    |
| latin                            | (\cl)                    |
| lao                              | (\co)                    |
| tibetan                          | (\cq)                    |
| japanese-roman                   | (\cr)                    |
| thai                             | (\ct)                    |
| vietnamese                       | (\cv)                    |
| hebrew                           | (\cw)                    |
| cyrillic                         | (\cy)                    |

| `can-break' | (\c | ) | ) |

`(not (category CATEGORY))'
matches a character that doesn't have categor CATEGORY.

`(and SEXP1 SEXP2 ...)'
`(: SEXP1 SEXP2 ...)'
`(seq SEXP1 SEXP2 ...)'
`(sequence SEXP1 SEXP2 ...)'
matches what SEXP1 matches, followed by what EXP2 matches, etc.

`(submatch SEXP1 SEXP2 ...)'
`(group SEXP1 SEXP2 ...)'
like `and', but makes the match accessible with `match-end',
`match-beginning', and `match-string'.

`(submatch-n N SEXP1 SEXP2 ...)'
`(group-n N SEXP1 SEXP2 ...)'
like `group', but make it an explicitly-numbered group with
group number N.

`(or SEXP1 SEXP2 ...)'
`(| SEXP1 SEXP2 ...)'
matches anything that matches SEXP1 or SEXP2, etc.  If all
args are strings, use `regexp-opt' to optimize the resulting
regular expression.

`(minimal-match SEXP)'
produce a non-greedy regexp for SEXP.  Normally, regexps matching
zero or more occurrences of something are "greedy" in that they
match as much as they can, as long as the overall regexp can
still match.  A non-greedy regexp matches as little as possible.

`(maximal-match SEXP)'
produce a greedy regexp for SEXP.  This is the default.

Below, `SEXP ...' represents a sequence of regexp forms, treated as if
enclosed in `(and ...)'.

`(zero-or-more SEXP ...)'
`(0+ SEXP ...)'
matches zero or more occurrences of what SEXP ... matches.

`(* SEXP ...)'
like `zero-or-more', but always produces a greedy regexp, independent
of `rx-greedy-flag'.

`(*? SEXP ...)'
like `zero-or-more', but always produces a non-greedy regexp,
independent of `rx-greedy-flag'.

`(one-or-more SEXP ...)'
`(1+ SEXP ...)'
matches one or more occurrences of SEXP ...

`(+ SEXP ...)'
like `one-or-more', but always produces a greedy regexp.

`(+? SEXP ...)'
like `one-or-more', but always produces a non-greedy regexp.

`(zero-or-one SEXP ...)'
`(optional SEXP ...)'
`(opt SEXP ...)'
matches zero or one occurrences of A.

`(? SEXP ...)'
like `zero-or-one', but always produces a greedy regexp.

`(?? SEXP ...)'
like `zero-or-one', but always produces a non-greedy regexp.

`(repeat N SEXP)'
`(= N SEXP ...)'
matches N occurrences.

`(>= N SEXP ...)'
matches N or more occurrences.

`(repeat N M SEXP)'
`(** N M SEXP ...)'
matches N to M occurrences.

`(backref N)'
matches what was matched previously by submatch N.

`(eval FORM)'
evaluate FORM and insert result.  If result is a string,
`regexp-quote' it.

`(regexp REGEXP)'
include REGEXP in string notation in the result.

** TODO 未歸類的 emacs 筆記。
*** C-x r N 添加數字序號
(rectangle-number-lines START END START-AT &optional FORMAT)
*** C-M-W append-next-kill
Quite useful, actually.  Normally, if you kill a couple of lines,
move the cursor, and then kills some more lines, only the second
batch of lines will be yanked with C-y.
However, if you use append-next-kill before the second batch of
kills, they will be appended to the first batch.﻿

*** ede
http://epsilonvectorplusplus.wordpress.com/2012/04/27/a-functional-introduction-to-cedet-ede/

*** 矩型操作
emacs 以 C-x r 開頭的命令來進行矩形操作。先用 C-space 或者 C-@設一個 mark，移動光標到另一點，用以下命令進行列操作：

C-x r k 剪切一個矩形塊
C-x r y 粘貼一個矩形塊
C-x r o 插入一個矩形塊
C-x r c 清除一個矩形塊(使其變成空白)
C-x r t 在選定區域的所有列前插入樣的字符
*** cua
cua-mode 下可以用以下命令進行列操作：

直接輸入字符: 在每行前(或後)都插入這個字符
[M-a]: 將 rect 中的文字左對齊
[M-b]: 用空格(tabs 或者 spaces)替換所有 rect 中的字符
[M-c]: 去掉所有行左側的空格
[M-f]: 用單個字符替換所有 rect 中的字符(提示輸入一個字符)
[M-i]: 對每行中第一個找到的數字進行加 1 操作(自動把 0x 開頭的當作十六進制數字)
[M-k]: 剪切 rect
[M-l]: 把 rect 中的內容全部轉換為小寫
[M-m]: 拷貝 rect
[M-n]: 用一串自增的數字替換 rect 中的每一行(這個功能可以用來給每行編號)
[M-o]: rect 的內容右移，選中的 rect 用空格填充
[M-r]: 用字符串替換符滿足正則表達式的字符串
[M-R]: 上下反轉
[M-s]: 把 rect 中的每一行替換為一個字符串(提示輸入)
[M-t]: 把 rect 整個替換為一個字符串(提示輸入)
[M-u]: 把 rect 中的內容全部轉換為大寫
[M-|]: 對 rect 執行一個 shell 命令
*** 看 package 的註解
M-x finder-commentary
*** Search
**** 基本按鍵
| 按鍵   | 命令             | 用途     |
|--------+------------------+----------|
| Ctrl-s | isearch-forward  | 向前查找 |
| Ctrl-r | isearch-backward | 向後查找 |

*** id-manager
負責管理密碼的plugin
* 基礎設置                                                             :base:
這邊放置的是 *初始化* 的設定，為了避免設定衝突，部份 Macro 和 Function 會放置於此。
** 預先載入 cl 套件。
#+begin_src emacs-lisp
  (eval-when-compile (require 'cl))
#+end_src

#+RESULTS:
: cl

** 使用者介面設定
關閉一些 emacs 預設的 UI 設定。
*** 不啟用 startup message
啟動 emacs 時會出現的 GNU/Emacs 畫面，這裡將他關閉
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
#+end_src

#+RESULTS:
: t

*** 清空 **scratch** buffer 的文字。
預設 **scratch** 裡面會有幾行文字，直接將他清空。
#+begin_src emacs-lisp
  (setq initial-scratch-message "")
#+end_src

#+RESULTS:

*** 關閉蜂鳴器
使用 visible bell 代替電腦的蜂鳴器叫聲。
#+begin_src emacs-lisp
  (setq visible-bell t)
#+end_src

#+RESULTS:
: t

*** 關閉工具列
#+begin_src emacs-lisp
  (if (featurep 'tool-bar) (tool-bar-mode -1))
#+end_src

#+RESULTS:

*** 關閉滾動條
關閉左側或右側的滾動條 (scrool-bar)
#+begin_src emacs-lisp
  (if (featurep 'scroll-bar) (scroll-bar-mode -1))
#+end_src

#+RESULTS:

*** 關閉游標閃爍
#+begin_src emacs-lisp
  (blink-cursor-mode -1)
#+end_src

#+RESULTS:

*** 關閉選單列
#+begin_src emacs-lisp
  (if (featurep 'menu-bar) (menu-bar-mode -1))
#+end_src

#+RESULTS:

*** Time Stamp
#+begin_src emacs-lisp
  (setq time-stamp-active      t ) ; do enable time-stamps
  (setq time-stamp-line-limit 10 ) ; check first 10 buffer lines for Time-stamp:
  (setq time-stamp-format "%04y-%02m-%02d %02H:%02M:%02S (%u)") ; date format
#+end_src

#+RESULTS:
: %04y-%02m-%02d %02H:%02M:%02S (%u)

*** 回答問題時，使用 *y* 和 *n* 代替 *yes/no* 。
預設要使用 *yse* 或是 *no* 來回答問題，這裡將他改成用 *y* 或 *n* 。
#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

#+RESULTS:
: y-or-n-p

*** TODO Misc

#+begin_src emacs-lisp
  ;; TODO: add comment
  (setq stack-trace-on-error t)
  (setq imenu-auto-scan t)
  ;;(setq redisplay-dont-pause t)

  ;; xrelated srtting
  (setq x-select-enable-clipboard t)
  (setq select-active-regions t)
  (setq x-gtk-use-system-tooltips nil)    ; disable gtk-tooltip

  (setq max-lisp-eval-depth '40000)
  (setq max-specpdl-size 1000)  ; default is 1000, reduce the backtrace level
  (setq debug-on-error t)    ; now you should get a backtrace
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
  ;; nice scrolling
  (setq scroll-margin                   0 )
  (setq scroll-conservatively      100000 )
  (setq scroll-preserve-screen-position 1 )
  (setq scroll-up-aggressively       0.01 )
  (setq scroll-down-aggressively     0.01 )
#+end_src

#+RESULTS:
: 0.01

** 變數設定                                                        :variable:
這邊加入了我自定義的變數以及其初始值。
*** 資料夾相關設定
這邊設定了各種類型資料夾的路徑。
**** emacs-dir
emacs 設定檔預設所在的資料夾
#+begin_src emacs-lisp
  (defconst emacs-dir "~/.emacs.d/"
    "The top-level emacs-configure directory.")
#+end_src

#+RESULTS:
: emacs-dir

