config.el

(eval-when-compile (require 'cl))

(setq inhibit-startup-message t)

(setq initial-scratch-message "")

(setq visible-bell t)

(if (featurep 'tool-bar) (tool-bar-mode -1))

(if (featurep 'scroll-bar) (scroll-bar-mode -1))

(blink-cursor-mode -1)

(if (featurep 'menu-bar) (menu-bar-mode -1))

(setq time-stamp-active      t ) ; do enable time-stamps
(setq time-stamp-line-limit 10 ) ; check first 10 buffer lines for Time-stamp:
(setq time-stamp-format "%04y-%02m-%02d %02H:%02M:%02S (%u)") ; date format

(fset 'yes-or-no-p 'y-or-n-p)

;; TODO: add comment
(setq stack-trace-on-error t)
(setq imenu-auto-scan t)
;;(setq redisplay-dont-pause t)

;; xrelated srtting
(setq x-select-enable-clipboard t)
(setq select-active-regions t)
(setq x-gtk-use-system-tooltips nil)    ; disable gtk-tooltip

(setq max-lisp-eval-depth '40000)
(setq max-specpdl-size 5)  ; default is 1000, reduce the backtrace level
(setq debug-on-error t)    ; now you should get a backtrace

;; nice scrolling
(setq scroll-margin                   0 )
(setq scroll-conservatively      100000 )
(setq scroll-preserve-screen-position 1 )
(setq scroll-up-aggressively       0.01 )
(setq scroll-down-aggressively     0.01 )

(defvar emacs-dir "~/.emacs.d/"
  "The top-level emacs-configure directory.")

(defvar emacs-config-file (concat emacs-dir "config.org")
  "File to place emacs configs.")
