config.org
**** emacs-themes-dir
佈景主題的資料夾設定。
#+begin_src emacs-lisp
  (defconst emacs-themes-dir (concat emacs-dir "themes/")
    "directory to place emacs theme.")
#+end_src

#+RESULTS:
: emacs-themes-dir

**** emacs-lisp-dir
el-get 安裝套件的路徑。
#+begin_src emacs-lisp
  (defconst emacs-lisp-dir   (concat emacs-dir "lisp/")
    "directory to place lisp packages from internet.")
#+end_src

#+RESULTS:
: emacs-lisp-dir

**** emacs-recipes-dir
el-get 的 recipes 路徑。
#+begin_src emacs-lisp
  (defconst emacs-recipes-dir (concat emacs-dir "recipes/")
    "directory to place local el-get recepies.")
#+end_src

#+RESULTS:
: emacs-recipes-dir

**** emacs-elpa-dir
elpa 安裝套件的路徑。
#+begin_src emacs-lisp
  (defconst emacs-elpa-dir   (concat emacs-lisp-dir "elpa/")
    "directory to place ELPA lisp packages from internet.")
#+end_src

#+RESULTS:
: emacs-elpa-dir

**** emacs-snippets-dir
yasnippet 使用的 snippet路徑
#+begin_src emacs-lisp
  (defconst emacs-snippets-dir (concat emacs-dir "snippets/")
    "directory to place yasnippet files.")
#+end_src

#+RESULTS:
: emacs-snippets-dir

**** emacs-bin-dir
放置 binary 檔案的資料夾。
#+begin_src emacs-lisp
  (defconst emacs-bin-dir    (concat emacs-dir "bin/")
    "directory to place binary staff.")
#+end_src

#+RESULTS:
: emacs-bin-dir

**** emacs-cache-dir
放置 cache 等暫存檔案的資料夾。
#+begin_src emacs-lisp
  (defconst emacs-cache-dir  (concat emacs-dir "cache/")
    "cache file directory.")
#+end_src

#+RESULTS:
: emacs-cache-dir

**** emacs-backup-dir
備份文件的資料夾。
#+begin_src emacs-lisp
  (defconst emacs-backup-dir (concat emacs-dir "backup/")
    "directory to backup files.")
#+end_src

#+RESULTS:
: emacs-backup-dir

**** emacs-log-dir
放置紀錄的資料夾。
#+begin_src emacs-lisp
  (defconst emacs-log-dir (concat emacs-dir "log/")
    "log file directory.")
#+end_src

#+RESULTS:
: emacs-log-dir

*** 檔案相關設定
這邊設定了各種檔案的路徑。
**** emacs-config-file
emacs 個人配置的檔案，也就是這個檔案。
#+begin_src emacs-lisp
  (defconst emacs-config-file (concat emacs-dir "config.org")
    "File to place emacs configs.")
#+end_src

#+RESULTS:
: emacs-config-file

**** emacs-custom-file
#+begin_src emacs-lisp
  (defconst emacs-custom-file (concat emacs-dir "custom.el")
    "store customize UI config.")
#+end_src

#+RESULTS:
: emacs-custom-file

**** emacs-authinfo-file
#+begin_src emacs-lisp
  (defconst emacs-authinfo-file (concat emacs-dir ".authinfo.gpg")
    "file that save secret")
#+end_src

#+RESULTS:
: emacs-authinfo-file

**** emacs-bookmark-file
#+begin_src emacs-lisp
  (defconst emacs-bookmark-file (concat emacs-cache-dir "bookmarks")
    "File to save bookmarks")
#+end_src

#+RESULTS:
: emacs-bookmark-file

*** 作業系統測試
放置用於測試目前 emacs 執行在何種作業系統上的變數。
**** MacOsx
#+begin_src emacs-lisp
  (defvar mac-p     (eq system-type 'darwin)
    "Return nil if OS is not Mac.")
#+end_src

#+RESULTS:
: mac-p

**** Linux
***** all
#+begin_src emacs-lisp
  (defvar linux-p   (and (eq system-type 'gnu/linux) (not (eq system-type 'drawin)))
    "Return nil if OS is not Linux.")
#+end_src

#+RESULTS:
: linux-p

***** 32-bit
#+begin_src emacs-lisp
  (defvar linux-32bit-p (and (string-match (rx bos "x86-") system-configuration) linux-p)
  "Return nil if OS is not 32-bit linux.")
#+end_src

#+RESULTS:
: linux-32bit-p

***** 64-bit
#+begin_src emacs-lisp
  (defvar linux-64bit-p (and (string-match (rx bos "x86_64") system-configuration) linux-p)
    "Return nil if OS is not 64-bit linux.")
#+end_src

#+RESULTS:
: linux-64bit-p

**** Cygwin
#+begin_src emacs-lisp
  (defvar cygwin-p  (eq system-type 'cygwin)
    "Return nil if OS is not CygWin.")
#+end_src

#+RESULTS:
: cygwin-p

**** Window$
#+begin_src emacs-lisp
  (defvar windows-p (eq system-type 'windows-nt)
    "Return nil if OS is not Windows.")
#+end_src

#+RESULTS:
: windows-p

*** 螢幕解析度測試                                               :resolution:
放置測試螢幕解析度用的變數
**** 1280x800
#+begin_src emacs-lisp
  (defvar display-1280x800-p   (and (= (display-pixel-width) 1280)
                                    (= (display-pixel-height) 800))
    "Return nil if current display's resolution is not 1280x800")
#+end_src

#+RESULTS:
: display-1280x800-p

**** 1280x1024
#+begin_src emacs-lisp
  (defvar display-1280x1024-p  (and (= (display-pixel-width) 1280)
                                    (= (display-pixel-height) 1024))
    "Return nil if current display's resolution is not 1280x1024")
#+end_src

#+RESULTS:
: display-1280x1024-p

**** 1920x1080
#+begin_src emacs-lisp
  (defvar display-1920x1080-p  (and (= (display-pixel-width) 1920)
                                    (= (display-pixel-height) 1080))
    "Return nil if current display's resolution is not 1920x1080")
#+end_src

#+RESULTS:
: display-1920x1080-p

*** TODO Shell
#+begin_src emacs-lisp
  (defvar emacs-default-shell "/bin/bash"
    "Default shell for cemacs.")
  (defvar emacs-popup-shell-window-height 30
    "Window hight of popup shell.")
  (defvar emacs-popup-shell-window-position "bottom"
    "Make popup shell window at buttom by default.")
#+end_src

#+RESULTS:
: emacs-popup-shell-window-position

*** TODO Path
#+begin_src emacs-lisp
  ;; TODO: make it work on every platform, now only has Linux support
  (setenv "PATH"
          (concat
           emacs-bin-dir ":"
           "~/.lein/bin" ":"
           (getenv "PATH")
           ))

  (setq exec-path (cons emacs-bin-dir exec-path))
#+end_src

#+RESULTS:
| ~/.emacs.d/bin/ | ~/.emacs.d/bin/ | ~/.emacs.d/bin | /opt/android-sdk-update-manager/tools/ | /usr/lib/colorgcc/bin | ~/bin | ~/bin/shell_scripts | /usr/local/bin | /usr/bin | /bin | /opt/bin | /usr/x86_64-pc-linux-gnu/arm-none-linux-gnueabi/gcc-bin/4.4.5 | /usr/x86_64-pc-linux-gnu/arm-unknown-linux-gnueabi/gcc-bin/4.6.2 | /usr/armv7a-hardfloat-linux-gnueabi/gcc-bin/4.6.2 | /usr/x86_64-pc-linux-gnu/gcc-bin/4.6.2 | /opt/android-ndk | /opt/android-ndk/toolchains/arm-eabi-4.4.0/prebuilt/linux-x86/bin/ | /opt/android-ndk/toolchains/arm-linux-androideabi-4.4.3/prebuilt/linux-x86/bin/ | /opt/android-sdk-update-manager/tools | /opt/android-sdk-update-manager/platform-tools | /usr/games/bin | /opt/cuda/bin | /opt/cuda/libnvvp | /opt/altera/11.0/quartus/bin/ | /opt/vmware/bin/ | /opt/matlab/bin/ | /opt/hitech/picc/9.82/bin | /opt/hitech/picc-18/pro/9.66/bin | /opt/microchip/mplabx/mplab_ide/bin/ | /usr/libexec/emacs/24.2/x86_64-pc-linux-gnu |

*** TODO Remember to remove
#+begin_src emacs-lisp
  (defun change-mouse-to-left ()
    (interactive)
    (shell-command "xmodmap -e \"pointer = 3 2 1\""))

  (defun change-mouse-to-right ()
    (interactive)
    (shell-command "xmodmap -e \"pointer = 1 2 3\""))

  (defun swap-ctrl-caps ()
    "swap control and capslock"
    (shell-command "setxkbmap -option ctrl:swapcaps"))

  (defun make-caps-as-ctrl ()
    "make capslock as control-key"
    (shell-command "setxkbmap -option ctrl:nocaps"))

  ;; only disable capslock and make it as control
  (cond ((eq window-system 'x)
         ;; make caps lock a control key
         (make-caps-as-ctrl)
         (change-mouse-to-left)))
#+end_src

*** TODO User Testing
#+begin_src emacs-lisp
(defvar root-p (zerop (user-real-uid))
  "Return nil if user is not root user.")
#+end_src
*** TODO Face
#+begin_src emacs-lisp
  (defface mode-line-read-only-face
    '((t (:foreground "#C82829" :bold t)))
    "face for mode-name-string in modeline."
    :group 'mode-line)

  (defface mode-line-modified-face
    '((t (:inherit 'font-lock-function-name-face :bolt t)))
    "face for mode-name-string in modeline."
    :group'mode-line)

  (defface mode-line-mode-name-face
    '((t (:inherit font-lock-keyword-face)))
    "face for mode-name-string in modeline."
    :group 'mode-line)

  (defface mode-line-normal-state-face
    '((t (:inherit font-lock-function-name-face)))
    "face for emacs normal state"
    :group 'mode-line)

  (defface font-lock-escape-char-face
    '((((class color)) (:foreground "seagreen2")))
    "highlight c escapes char like vim"
    :group 'font-lock-faces)

  (defface mode-line-evil-state-string-N
    '((t (:inherit font-lock-function-name-face)))
    "face for vim-string in normal-map on mode-line."
    :group 'mode-line)

  (defface mode-line-evil-state-string-I
    '((t (:inherit font-lock-constant-face)))
    "face for vim-string in insert-map on mode-line."
    :group 'mode-line)

  (defface mode-line-evil-state-string-V
    '((t (:inherit font-lock-variable-name-face)))
    "face for vim-string in visual-map on mode-line."
    :group 'mode-line)

  (defface mode-line-evil-state-string-E
    '((t (:inherit font-lock-string-face)))
    "face for vim-string in emacs-map on mode-line."
    :group 'mode-line)
#+end_src

** Macros                                                            :macro:
*** reauire*
這個巨集用途和 require 類似，但是會忽略掉所有的錯誤。此外，如果 emacs 並沒有讀入這個 package
則會呼叫 el-get 來安裝這個 package。
**** TODO add require-result buffer
**** TODO add function to handle if el-get return error
#+begin_src emacs-lisp
  (defmacro require* (feature &optional file)
      "Try to require FEATURE, but don't signal an error if `reauire' fails.
    If this package does not exist, use el-get reinstall it."
      `(let* ((require-result (require ,feature ,file 'noerror)))
         ;; if package does not exist, reinstall it
         (if-not require-result (el-get-reinstall ,feature)
                 ;; TODO: add require-result buffer
                 )))
#+end_src
** Font-lock
這邊的 font-lock 設定主要是為了讓自己設定的 macro（require*) 具有和 require
一樣的顏色，僅添加於 emacs-lisp-mode 和 lisp-interaction-mode
#+begin_src emacs-lisp
  (font-lock-add-keywords 'emacs-lisp-mode
                          '(("(\\(require\*\\*\\)[ \t']*\\(\\sw+\\)?"
                             (1 font-lock-keyword-face)
                             (2 font-lock-constant-face nil t))))
  
  (font-lock-add-keywords 'lisp-interaction-mode
                          '(("(\\(require\*\\*\\)[ \t']*\\(\\sw+\\)?"
                             (1 font-lock-keyword-face)
                             (2 font-lock-constant-face nil t))))
#+end_src
** 設定 custom-file 到其他檔案
避免使用 *customize-UI* 時，會將設定寫入我的 init.el
#+begin_src emacs-lisp
  (setq custom-file emacs-custom-file)
#+end_src
