config.el

(defvar emacs-themes-dir (concat emacs-dir "themes/")
  "directory to place emacs theme.")
(defvar emacs-lisp-dir   (concat emacs-dir "lisp/")
  "directory to place lisp packages from internet.")
(defvar emacs-elpa-dir   (concat emacs-lisp-dir "elpa/")
  "directory to place ELPA lisp packages from internet.")
(defvar emacs-snippets-dir (concat emacs-dir "snippets/")
  "directory to place yasnippet files.")
(defvar emacs-recipes-dir (concat emacs-dir "recipes/")
  "directory to place local el-get recepies.")

(defvar emacs-custom-file (concat emacs-dir "custom.el")
  "store customize UI config.")

(defvar emacs-bin-dir    (concat emacs-dir "bin/")
  "directory to place binary staff.")
(defvar emacs-cache-dir  (concat emacs-dir "cache/")
  "cache file directory.")
(defvar emacs-backup-dir (concat emacs-dir "backup/")
  "directory to backup files.")
(defvar emacs-authinfo-file (concat emacs-dir ".authinfo.gpg")
  "file that save secret")
(defvar emacs-bookmark-file (concat emacs-cache-dir "bookmarks")
  "File to save bookmarks")
                                    ;; (defvar emacs-log-dir (concat emacs-var-dir "log/")
;;   "log file directory."

(defvar emacs-default-shell "/bin/bash"
  "Default shell for cemacs.")
(defvar emacs-popup-shell-window-height 30
  "Window hight of popup shell.")
(defvar emacs-popup-shell-window-position "bottom"
  "Make popup shell window at buttom by default.")

;; TODO: make it work on every platform, now only has Linux support
(setenv "PATH"
        (concat
         emacs-bin-dir ":"
         "~/.lein/bin" ":"
         (getenv "PATH")
         ))

(setq exec-path (cons emacs-bin-dir exec-path))

(defun change-mouse-to-left ()
  (interactive)
  (shell-command "xmodmap -e \"pointer = 3 2 1\""))

(defun change-mouse-to-right ()
  (interactive)
  (shell-command "xmodmap -e \"pointer = 1 2 3\""))

(defun swap-ctrl-caps ()
  "swap control and capslock"
  (shell-command "setxkbmap -option ctrl:swapcaps"))

(defun make-caps-as-ctrl ()
  "make capslock as control-key"
  (shell-command "setxkbmap -option ctrl:nocaps"))

;; only disable capslock and make it as control
(cond ((eq window-system 'x)
       ;; make caps lock a control key
       (make-caps-as-ctrl)
       (change-mouse-to-left)))

(defvar mac-p     (eq system-type 'darwin)
  "Return nil if OS is not Mac.")

(defvar linux-p   (and (eq system-type 'gnu/linux) (not (eq system-type 'drawin)))
  "Return nil if OS is not Linux.")

(defvar linux-32bit-p (and (string-match (rx bos "x86-") system-configuration) linux-p)
"Return nil if OS is not 32-bit linux.")

(defvar linux-64bit-p (and (string-match (rx bos "x86_64") system-configuration) linux-p)
  "Return nil if OS is not 64-bit linux.")

(defvar cygwin-p  (eq system-type 'cygwin)
  "Return nil if OS is not CygWin.")

(defvar windows-p (eq system-type 'windows-nt)
  "Return nil if OS is not Windows.")

(defvar root-p (zerop (user-real-uid))
  "Return nil if user is not root user.")

(defvar display-1280x800-p   (and (= (display-pixel-width) 1280)
                                  (= (display-pixel-height) 800))
  "Return nil if current display's resolution is not 1280x800")

(defvar display-1280x1024-p  (and (= (display-pixel-width) 1280)
                                  (= (display-pixel-height) 1024))
  "Return nil if current display's resolution is not 1280x1024")

(defvar display-1920x1080-p  (and (= (display-pixel-width) 1920)
                                  (= (display-pixel-height) 1080))
  "Return nil if current display's resolution is not 1920x1080")

(defface mode-line-read-only-face
  '((t (:foreground "#C82829" :bold t)))
  "face for mode-name-string in modeline."
  :group 'mode-line)

(defface mode-line-modified-face
  '((t (:inherit 'font-lock-function-name-face :bolt t)))
  "face for mode-name-string in modeline."
  :group'mode-line)

(defface mode-line-mode-name-face
  '((t (:inherit font-lock-keyword-face)))
  "face for mode-name-string in modeline."
  :group 'mode-line)

(defface mode-line-normal-state-face
  '((t (:inherit font-lock-function-name-face)))
  "face for emacs normal state"
  :group 'mode-line)

(defface font-lock-escape-char-face
  '((((class color)) (:foreground "seagreen2")))
  "highlight c escapes char like vim"
  :group 'font-lock-faces)

(defface mode-line-evil-state-string-N
  '((t (:inherit font-lock-function-name-face)))
  "face for vim-string in normal-map on mode-line."
  :group 'mode-line)

(defface mode-line-evil-state-string-I
  '((t (:inherit font-lock-constant-face)))
  "face for vim-string in insert-map on mode-line."
  :group 'mode-line)

(defface mode-line-evil-state-string-V
  '((t (:inherit font-lock-variable-name-face)))
  "face for vim-string in visual-map on mode-line."
  :group 'mode-line)

(defface mode-line-evil-state-string-E
  '((t (:inherit font-lock-string-face)))
  "face for vim-string in emacs-map on mode-line."
  :group 'mode-line)

(defmacro require* (feature &optional file)
    "Try to require FEATURE, but don't signal an error if `reauire' fails.
  If this package does not exist, use el-get reinstall it."
    `(let* ((require-result (require ,feature ,file 'noerror)))
       ;; if package does not exist, reinstall it
       (if-not require-result (el-get-reinstall ,feature)
               ;; TODO: add require-result buffer
               )))

(font-lock-add-keywords 'emacs-lisp-mode
                        '(("(\\(require\*\\*\\)\\s [ \t']*\\(\\sw+\\)?"
                           (1 font-lock-keyword-face)
                           (2 font-lock-constant-face nil t))))
(font-lock-add-keywords 'lisp-interaction-mode
                        '(("(\\(require\*\\*\\)\\s [ \t']*\\(\\sw+\\)?"
                           (1 font-lock-keyword-face)
                           (2 font-lock-constant-face nil t))))

(setq custom-file emacs-custom-file)
