config.org
** Daemon
當啟用 emacs 時，啟動 emacs-server，如果使用者是 root 或已啟用 server，則忽略。
#+begin_src emacs-lisp
  ;; Only start server mode if I'm not root
  (unless (string-equal "root" (getenv "USER"))
    (require 'server)
    (unless (server-running-p) (server-start)))
#+end_src
** 根據目前螢幕的解析度調整 emacs 視窗的大小。                  :resolution:
整個設定是使用 cond 來進行條件式的判斷，因此加入了 *設定起始位置* 和 *設定終止位置*
作為保護。
*** 設定起始位置
#+begin_src emacs-lisp
  (cond
#+end_src
*** 1920x1080
#+begin_src emacs-lisp
  (display-1920x1080-p
   (setq default-frame-alist
         (append (list
                  '(width  . 134)
                  '(height . 45)
                  '(top    . 90)
                  '(left   . 500))
                 default-frame-alist)))
#+end_src
*** 1280x1024
#+begin_src emacs-lisp
  (display-1280x1024-p
   (setq default-frame-alist
         (append (list
                  '(width  . 114)
                  '(height . 40)
                  '(top    . 90)
                  '(left   . 300))
                 default-frame-alist)))
#+end_src
*** 1280x800
#+begin_src emacs-lisp
  (display-1280x800-p
   (setq default-frame-alist
         (append (list
                  '(width  . 114)
                  '(height . 40)
                  '(top    . 90)
                  '(left   . 300))
                 default-frame-alist)))
#+end_src
*** 預設情況
#+begin_src emacs-lisp
  (t
   (setq default-frame-alist
         (append (list
                  '(width  . 100)
                  '(height . 40)
                  '(top    . 90)
                  '(left   . 100))
                 default-frame-alist)))
#+end_src
*** 設定終止位置
#+begin_src emacs-lisp
  )
#+end_src
* 語言與編碼                                                         :locale:
emacs 編碼設定，大部份都設定成 utf-8。
** 系統編碼。
#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8 )
#+end_src
** 語言環境。
#+begin_src emacs-lisp
  (set-language-environment 'utf-8 )
#+end_src
** 文件保存時的編碼設置
#+begin_src emacs-lisp
  (set-buffer-file-coding-system 'utf-8 )
#+end_src
** 鍵盤編碼設定
#+begin_src emacs-lisp
  (set-keyboard-coding-system    'utf-8 )
#+end_src
** 設定終端機的編碼
#+begin_src emacs-lisp
  (set-terminal-coding-system    'utf-8 )
#+end_src
** 選擇區域內編碼
#+begin_src emacs-lisp
  (set-selection-coding-system   'utf-8 )
#+end_src
** 剪貼簿編碼設定
#+begin_src emacs-lisp
  (set-clipboard-coding-system   'utf-8 )
#+end_src
** 使用 utf-8 編碼顯示文件名
#+begin_src emacs-lisp
  (set-file-name-coding-system   'utf-8 )
#+end_src
** 設定時間顯示使用英文
#+begin_src emacs-lisp
  (setq system-time-locale "en_US" )
#+end_src
* 套件管理                                                          :package:
emacs 套件管理的設定。
** el-get
*** 設定 el-get-dir
我不喜歡 el-get 預設使用 el-get 目錄，這裡根據我的 emacs-lisp-dir 重新設定。
#+begin_src emacs-lisp
  (setq-default el-get-dir emacs-lisp-dir)
#+end_src
*** 如果 el-get 不存在的話，重新安裝 el-get
#+begin_src emacs-lisp
    (unless (require 'el-get nil t)
      (setq el-get-install-branch "master")
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.github.com/dimitri/el-get/master/el-get-install.el")
        (end-of-buffer)
        (eval-print-last-sexp)))
  
;;  (el-get 'sync)
#+end_src
*** 如果 elpa 的 recepies 不存在的話，自動建立他。
#+begin_src emacs-lisp
  (unless (file-exists-p el-get-recipe-path-elpa)
    (el-get-elpa-build-local-recipes))
#+end_src
*** 將我的 recipes 加入 el-get-recipe-path
#+begin_src emacs-lisp
  (add-to-list 'el-get-recipe-path emacs-recipes-dir)
#+end_src
*** Auto Mode Alist
\\.rcp$ 為 el-get 的 recipes 副檔名。
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.rcp$" . emacs-lisp-mode))
#+end_src
*** TODO Recipes 轉移所有的 recipe 至此
***** Header
#+begin_src emacs-lisp
  (setq el-get-sources '(
#+end_src
***** TODO powerline remember to remove
#+begin_src emacs-lisp
  (:name powerline
         :type github
         :pkgname "jonathanchu/emacs-powerline")
#+end_src
***** lusty-emacs
使用最新版本的 lusty-explorer
#+begin_src emacs-lisp
  (:name lusty-explorer
         :type github
         :pkgname sjbach/lusty-emacs
         :description "LustyExplorer is a fast and responsive way to manage files and buffers")
#+end_src
***** mixen
#+begin_src emacs-lisp
  (:name mixen
          :type github
          :pkgname coldnew/mixen
          :features mixen)
#+end_src
***** End of config
#+begin_src emacs-lisp
  ))
#+end_src
** ELPA                                                               :elpa:
*** 設定 elpa 安裝目錄到 emacs-elpa-dir
#+begin_src emacs-lisp
  (setq-default package-user-dir emacs-elpa-dir)
#+end_src
*** Depends
#+begin_src emacs-lisp
  (require 'package)
#+end_src
*** 設定 elpa 所使用的套件庫
#+begin_src emacs-lisp
  (setq package-archives
        '(("ELPA" . "http://tromey.com/elpa/")
          ("gnu" . "http://elpa.gnu.org/packages/")
          ("marmalade" . "http://marmalade-repo.org/packages/")
          ("melpa" . "http://melpa.milkbox.net/packages/")))
#+end_src
** 套件檢查
為了避免有套件因為 *意外* 而不見，對套件進行檢查，若不存在則進行重新安裝的動作。
*注意* ：進行套件檢查時，必須確認 el-get 已經安裝至 emacs 裡面，否則會產生錯誤。
*** 存放套件資訊的變數
此變數用於存放系統裏面必須安裝的 emacs 套件。
#+begin_src emacs-lisp
   (defvar emacs-packages-list nil
     "A list of packages to ensure are installed at launch.")
#+end_src
*** 存放套件資訊的檔案
此檔案用於將 emacs-packags-list 暫存。
#+begin_src emacs-lisp
  (defvar emacs-packages-file
    (concat emacs-dir ".packages.el")
    "Define where to store and read the installed packages list.")
#+end_src
*** 將套件資訊寫入到檔案
#+begin_src emacs-lisp
  (defun emacs-packages-write-to-file ()
    "Write emasc-packages-list to files."
    (with-temp-file emacs-packages-file
      (insert (el-get-print-to-string emacs-packages-list 'pretty))))
#+end_src
*** 設定自動更新安裝套件資訊的時間
**** 當安裝新的套件時，更新套件資訊
#+begin_src emacs-lisp
  (defun emacs-packages-install (pkg)
    (unless (stringp pkg)
      (setq pkg (symbol-name pkg)))
    (add-to-list 'emacs-packages-list pkg)
    (emacs-packages-write-to-file))
  
  ;; add to hooks
  (add-hook 'el-get-post-install-hooks 'emacs-packages-install)
#+end_src
**** 當移除套件時，更新套件資訊
***** TODO el-get-post-remove-hooks 不知道為什麼不能用，所以只好先 advice el-get-remove
#+begin_src emacs-lisp
  (defun emacs-packages-remove (pkg)
    (setq emacs-packages-list (remove pkg emacs-packages-list))
    (emacs-packages-write-to-file))
  
  ;; add to hooks
  ;;(add-hook 'el-get-post-remove-hooks 'emacs-packages-remove)
  
  (defadvice el-get-remove (after remove-package activate)
    (emacs-packages-remove package))
#+end_src
*** 從硬碟中讀取檔案
#+begin_src emacs-lisp
  (defun emacs-packages-read-from-file ()
    "Read from emacs-packages-file and set the contents to emacs-packages-list."
    (when (file-exists-p emacs-packages-file)
      (setq emacs-packages-list
            (car
             (with-temp-buffer emacs-packages-file
                               (insert-file-contents-literally emacs-packages-file)
                               ;; if emacs-packages-file is an empty file
                               ;; return nil, else return buffer-string
                               (if (= 0 (buffer-size (current-buffer)))
                                   nil
                                 (read-from-string (buffer-string))
                                 ))))))
  
  ;; read installed packages info from file
  (emacs-packages-read-from-file)
#+end_src
*** 檢查套件是否有在 emacs-packages-list 裡
#+begin_src emacs-lisp
  (defun emacs-packages-installed-p ()
    (loop for p in emacs-packages-list
          when (not (el-get-package-is-installed p)) do (return nil)
          finally (return t)))
#+end_src
*** 當發現有套件存在 emacs-package-list 裡面，但是卻被 emacs-packages-installed-p 回報為
此套件不存在時，重新安裝此套件。
#+begin_src emacs-lisp
  (defun emacs-packages-install-packages ()
    (unless (emacs-packages-installed-p)
      ;; install missing packages
      (dolist (p emacs-packages-list)
        (unless (el-get-package-is-installed p)
          (el-get-reinstall p)))))
  
  ;; install missing packages
  (emacs-packages-install-packages)
#+end_src
* 巨集                                                                :macro:
** Clojure
*** comment
comment 只是用來註釋用，並不會解析裏面的東西。
#+begin_example
  (comment "I am comment.")
#+end_example

#+begin_src emacs-lisp
  (defmacro comment (&rest body)
    "Comment out one or more s-expressions."
    nil)
#+end_src
*** ->
#+begin_src emacs-lisp
  (defmacro -> (x &optional form &rest more)
    (cond ((not (null more))
           `(-> (-> ,x ,form) ,@more))
          ((not (null form))
           (if (sequencep form)
               `(,(first form) ,x ,@(rest form))
             (list form x)))
          (t x)))
#+end_src
*** ->>
#+begin_src emacs-lisp
  (defmacro ->> (x form &rest more)
    (cond ((not (null more)) `(->> (->> ,x ,form) ,@more))
          (t (if (sequencep form)
                 `(,(first form) ,@(rest form) ,x)
               (list form x)))))
#+end_src
*** -?>
#+begin_src emacs-lisp
  (defmacro -?> (x form &rest more)
    (cond ((not (null more)) `(-?> (-?> ,x ,form) ,@more))
          (t (if (sequencep form)
                 `(if (null ,x) nil
                    (,(first form) ,x ,@(rest form)))
               `(if (null ,x) nil
                  ,(list form x))))))
#+end_src
*** -?>>
#+begin_src emacs-lisp
  (defmacro -?>> (x form &rest more)
    (cond ((not (null more)) `(-?>> (-?>> ,x ,form) ,@more))
          (t (if (sequencep form)
                 `(if (null ,x) nil
                    (,(first form) ,@(rest form) ,x))
               `(if (null ,x) nil
                  ,(list form x))))))
#+end_src
*** if-not
#+begin_src emacs-lisp
  (defmacro if-not (test then &optional else)
    "Evaluates test. If logical false, evaluates and returns then expr,
    otherwise else expr, if supplied, else nil."
    `(if (not ,test) ,then ,else))
#+end_src

** Scheme
*** define
#+begin_src emacs-lisp
  (defmacro define (what &rest rest)
    "Scheme-like alias to defvar/defun"
    (if (consp what)
        `(defun  ,(car what) ,(cdr what) ,@rest)
      `(defvar ,what ,@rest)))
  ;; Syntaxes:
  ;;  (define varname opt-defaultvalue "opt-docscring"
  ;;  (define (fname arg1 arg2...) "opt-docstring" (interactive) (stmt1) ...)
#+end_src
** Other
*** defclosure
#+begin_example
  (defclosure counter (&optional increment)
    "Iseless and bizar counter"
    ((one 0)
     (two 1))
    (incf two (incf one (or increment two))))

(counter) => 2
(counter) => 5
#+end_example

#+begin_src emacs-lisp
  (defmacro defclosure (name arglist docstring bindings &rest body)
    "Define NAME as a closure.

          DOCSTRING is *not* optional.
          BINDINGS is an alist of lexical bindings.
          The definition is (lambda ARGLIST DOCSTRING BODY...)."
    (declare (indent defun))
    `(lexical-let (,@bindings)
       (defun ,name (,@arglist)
         ,docstring
         ,@body)))
#+end_src
*** safe
ref: http://curiousprogrammer.wordpress.com/2009/06/08/error-handling-in-emacs-lisp/
#+begin_src emacs-lisp
  (defmacro safe-wrap (fn &rest clean-up)
    `(unwind-protect
         (let (retval)
           (condition-case ex
               (setq retval (progn ,fn))
             ('error
              (message (format "Caught exception: [%s]" ex))
              (setq retval (cons 'exception (list ex)))))
           retval)
       ,@clean-up))
#+end_src
