config.el

;; Only start server mode if I'm not root
(unless (string-equal "root" (getenv "USER"))
  (require 'server)
  (unless (server-running-p) (server-start)))

(cond

(display-1920x1080-p
 (setq default-frame-alist
       (append (list
                '(width  . 134)
                '(height . 45)
                '(top    . 90)
                '(left   . 500))
               default-frame-alist)))

(display-1280x1024-p
 (setq default-frame-alist
       (append (list
                '(width  . 114)
                '(height . 40)
                '(top    . 90)
                '(left   . 300))
               default-frame-alist)))

(display-1280x800-p
 (setq default-frame-alist
       (append (list
                '(width  . 114)
                '(height . 40)
                '(top    . 90)
                '(left   . 300))
               default-frame-alist)))

(t
 (setq default-frame-alist
       (append (list
                '(width  . 100)
                '(height . 40)
                '(top    . 90)
                '(left   . 100))
               default-frame-alist)))

)

(prefer-coding-system 'utf-8 )

(set-language-environment 'utf-8 )

(set-buffer-file-coding-system 'utf-8 )

(set-keyboard-coding-system    'utf-8 )

(set-terminal-coding-system    'utf-8 )

(set-selection-coding-system   'utf-8 )

(set-clipboard-coding-system   'utf-8 )

(set-file-name-coding-system   'utf-8 )

(setq system-time-locale "en_US" )

(setq-default el-get-dir emacs-lisp-dir)

(unless (require 'el-get nil t)
  (setq el-get-install-branch "master")
  (with-current-buffer
      (url-retrieve-synchronously
       "https://raw.github.com/dimitri/el-get/master/el-get-install.el")
    (end-of-buffer)
    (eval-print-last-sexp)))

(unless (file-exists-p el-get-recipe-path-elpa)
  (el-get-elpa-build-local-recipies))

(require 'el-get)

(add-to-list 'el-get-recipe-path emacs-recipes-dir)

(add-to-list 'auto-mode-alist '("\\.rcp$" . emacs-lisp-mode))

(setq el-get-sources '(

(:name powerline
       :type github
       :pkgname "jonathanchu/emacs-powerline")

(:name lusty-explorer
       :type github
       :pkgname sjbach/lusty-emacs
       :description "LustyExplorer is a fast and responsive way to manage files and buffers")

))

(setq-default package-user-dir emacs-elpa-dir)

(require 'package)

(setq package-archives
      '(("ELPA" . "http://tromey.com/elpa/")
        ("gnu" . "http://elpa.gnu.org/packages/")
        ("marmalade" . "http://marmalade-repo.org/packages/")
        ("melpa" . "http://melpa.milkbox.net/packages/")))

(defmacro comment (&rest body)
  "Comment out one or more s-expressions."
  nil)

(defmacro -> (x &optional form &rest more)
  (cond ((not (null more))
         `(-> (-> ,x ,form) ,@more))
        ((not (null form))
         (if (sequencep form)
             `(,(first form) ,x ,@(rest form))
           (list form x)))
        (t x)))

(defmacro ->> (x form &rest more)
  (cond ((not (null more)) `(->> (->> ,x ,form) ,@more))
        (t (if (sequencep form)
               `(,(first form) ,@(rest form) ,x)
             (list form x)))))

(defmacro -?> (x form &rest more)
  (cond ((not (null more)) `(-?> (-?> ,x ,form) ,@more))
        (t (if (sequencep form)
               `(if (null ,x) nil
                  (,(first form) ,x ,@(rest form)))
             `(if (null ,x) nil
                ,(list form x))))))

(defmacro -?>> (x form &rest more)
  (cond ((not (null more)) `(-?>> (-?>> ,x ,form) ,@more))
        (t (if (sequencep form)
               `(if (null ,x) nil
                  (,(first form) ,@(rest form) ,x))
             `(if (null ,x) nil
                ,(list form x))))))

(defmacro if-not (test then &optional else)
  "Evaluates test. If logical false, evaluates and returns then expr,
  otherwise else expr, if supplied, else nil."
  `(if (not ,test) ,then ,else))

(require* 'ascii)
