config.org
* Depends
#+begin_src emacs-lisp
;;  (require* 'tabbar)
  (require* 'sauron)
  (require* 'traverselisp)
  (require* 'space-chord)
  (require* 'switch-window)
  (require 'projectile)
  (projectile-mode)
#+end_src

ok

#+begin_src emacs-lisp
  (require* 'rainbow-mode)
  (require* 'ascii)
  (require* 'ace-jump-mode)
  (require* 'smarter-compile)
  (require* 'smallurl)
  (require* 'unicad)
  (require* 'iedit)

  (require* 'expand-region)
  (require* 'sr-speedbar)
  (require* 'helm)
  (require* 'htmlize)
  (require* 'pretty-lambdada)
#+end_src
parenface 可以將所有的圓括號上色。
#+begin_src emacs-lisp
  (require 'parenface)
  (set-face-foreground 'paren-face "green")
#+end_src

#+begin_src emacs-lisp
;;(require* 'smart-tab)
#+end_src
** Build-in
#+begin_src emacs-lisp
  (require 'misc)
  (require 'cc-mode)
#+end_src
iimage 是讓 emacs 可以直接顯示圖片的模式。
#+begin_src emacs-lisp
  (require 'iimage)
#+end_src

* Advice                                                             :advice:
advice file
#+begin_src emacs-lisp
  (defadvice kill-emacs (around recompile-emacs-config activate)
    "Before exit emacs, kill config.el which is generate by config.org."
    (let ((file-name (expand-file-name (concat emacs-dir "config.el"))))
      (if (file-exists-p file-name)
          (delete-file file-name nil))
      ad-do-it))
#+end_src
* Function                                                         :function:
我所自定義或是我的 emacs 設定檔需要用到的 function。
** List Processing
處理 List 所用的 function。
*** flatten a list
flatten a list 是一種方法，可以用來將巢狀的 list 變成單一個 list。
舉例來說，假如目前有這樣一個 list:

#+begin_example
(1 (2 3) (4 (5 6 (7))) 8 9)
#+end_example

則使用 flatten 這個 function 可以將上面的巢狀 list 變成:

#+begin_example
(1 2 3 4 5 6 7 8 9)
#+end_example

#+begin_src emacs-lisp
  (defun flatten (structure)
    "Flatten the nesting in an arbitrary list of values."
    (cond ((null structure) nil)
          ((atom structure) `(,structure))
          (t (mapcan #'flatten structure))))
#+end_src
*** List to string
將一個 list 變成字串回傳。
#+begin_src emacs-lisp
  (defun list-to-string (char-list)
    "RETURN: A new string containing the characters in char-list."
    (let ((result (make-string (length char-list) 0))
          (i 0))
      (dolist (char char-list)
        (aset result i char)
        (setq i (1+ i)))
      result))
#+end_src
** Search
搜尋相關的 function。
*** search-backward-to-char
向後搜尋一個字元。
#+begin_src emacs-lisp
  (defun search-backward-to-char (chr)
    "Search backwards to a character"
    (while (not (= (char-after) chr))
      (backward-char 1)))
#+end_src
*** search-forward-to-char
向前搜尋一個字元。
#+begin_src emacs-lisp
  (defun search-forward-to-char (chr)
    "Search forwards to a character"
    (while (not (= (char-before) chr))
      (forward-char 1)))
#+end_src
*** recursive-find-file
遞迴尋找檔案，若在當前目錄找不到此檔案，則去其父目錄進行尋找。
如果該檔案或是目錄不存在，則回傳 nil.
#+begin_src emacs-lisp
  (defun coldnew/recursive-find-file (file &optional directory)
    "Find the first FILE in DIRECTORY or it's parents.
  If file does not exist return nil."
    (let ((directory (or directory
                         (file-name-directory (buffer-file-name))
                         (pwd))))
      (if (file-exists-p (expand-file-name file directory))
          (expand-file-name file directory)
        (unless (string= "/" directory)
          (coldnew/recursive-find-file file (expand-file-name ".." directory))))))
#+end_src
** Testing
測試用的 function，和測試用的變數很像，但是他允許參數的輸入。
*** font-exist-p
測試這個字體在系統內是否存在。
#+begin_src emacs-lisp
  (defun font-exist-p (fontname)
    "test if this font is exist or not."
    (if (not (x-list-fonts fontname))
        nil t))
#+end_src
** File
*** filesize
#+begin_src emacs-lisp
  (defun file-size (filename)
    "Return the size in bytes of file named FILENAME, as in integer.
  Returns nil if no such file."
    (nth 7 (file-attributes filename)))
#+end_src
** Convert
進行轉換用的 function。
*** 將輸入的 buffer (DOS 格式)　轉換成 UNIX 格式。　
#+begin_src emacs-lisp
  (defun dos->unix (buf)
    "Convert buffer file from dos file to unix file."
    (let* (current-buf (current-buffer))
      (if (not (eq current-buf buf))
          (switch-to-buffer buf))
      (goto-char(point-min))
      (while (search-forward "\r" nil t) (replace-match ""))))
#+end_src
*** 將輸入的 buffer (UNIX 格式)　轉換成 DOS 格式。　
#+begin_src emacs-lisp
  (defun unix->dos (buf)
    "Convert buffer file from unix file to dos file."
    (let* (current-buf (current-buffer))
      (if (not (eq current-buf buf))
          (switch-to-buffer buf))
      (goto-char(point-min))
      (while (search-forward "\n" nil t) (replace-match "\r\n"))))
#+end_src
*** 將檔案變成字串，此 function 比較適用於該檔案只有一行（或少數幾行）的情況。
#+begin_src emacs-lisp
  (defun file->string (file)
    "Convert file to string in buffer with quote."
    (when (file-readable-p file)
      (with-temp-buffer
        (insert-file-contents file)
        (buffer-string))))
#+end_src
*** 十進位轉換成十六進位
#+begin_src emacs-lisp
  (defun dec->hex (decimal)
    "Convert decimal to hexdecimal number."
    (let ((hexstr))
      (if (stringp decimal)
          (setq decimal (string-to-number decimal 16)))
      (cond
       ;; Use #x as hex prefix (elisp, ....)
       ((or (eq major-mode 'emacs-lisp-mode)
            (eq major-mode 'lisp-interaction-mode)) (setq hexstr "#x"))
       ;; Use # as hex prefix (CSS, ....)
       ((eq major-mode 'css-mode) (setq hexstr "#"))
       ;; otherwise use 0x as hexprefix (C, Perl...)
       (t (setq hexstr "0x")))
      (format "%s%02X" hexstr decimal)))
#+end_src
*** 十六進位轉換成十進位
#+begin_src emacs-lisp
  (defun hex->dec (hex)
    "Convert hexdecimal number or string to digit-number."
    (let ((case-fold-search nil)
          (hex-regexp (rx (or
                           ;; elisp
                           (group bol "#x")
                           ;; C perl
                           (group bol "0x")
                           ;; CSS
                           (group bol "#")))))
      (if (not (stringp hex))
          (setq hex (symbol-name hex)))
      (string-to-number
       (replace-regexp-in-string hex-regexp "" hex)
       16)))
#+end_src
** Sort
*** quicksort
#+begin_src emacs-lisp
  (defun quicksort (lst)
    "Implement the quicksort algorithm."
    (if (null lst) nil
      (let* ((spl (car lst))
             (rst (cdr lst))
             (smalp (lambda (x)
                      (< x spl))))
        (append (quicksort (remove-if-not smalp rst))
                (list spl)
                (quicksort (remove-if smalp rst))))))
#+end_src
** Buffer
*** get-buffers-matching-mode
取得 major-mode 和要求符合的所有 buffer，假如我們希望可以列出所有為
emacs-lisp-mode 的 buffer，可以這樣做
#+begin_src emacs-lisp :tangle no
  (get-buffers-matching-mode 'emacs-lisp-mode)
#+end_src

#+begin_src emacs-lisp
  (defun get-buffers-matching-mode (mode)
    "Returns a list of buffers where their major-mode is equal to MODE"
    (let ((buffer-mode-matches '()))
      (dolist (buf (buffer-list))
        (with-current-buffer buf
          (if (eq mode major-mode)
              (add-to-list 'buffer-mode-matches buf))))
      buffer-mode-matches))
#+end_src
*** show-buffer-major-mode
顯示 buffer 目前所處於的 major-mode

#+begin_src emacs-lisp :tangle no
  (show-buffer-major-mode "*scratch*")
#+end_src

#+begin_src emacs-lisp
  (defun show-buffer-major-mode (buffer-or-string)
    "Returns the major mode associated with a buffer."
    (with-current-buffer buffer-or-string major-mode))
#+end_src
** System
和系統相關的 function。
*** get-ip-address
取得目前的 IP 位置，預設為 eth0。（此 function 不能用於 windows 上）
#+begin_src emacs-lisp
  (defun get-ip-address (&optional dev)
    "get the IP-address for device DEV (default: eth0)"
    (let ((dev (if dev dev "eth0")))
      (format-network-address (car (network-interface-info dev)) t)))
#+end_src
** Date
#+begin_src emacs-lisp
  (defun current-date-time ()
    "return current date in `%Y-%m-%d' format, ex:`2012-04-25'."
    (let ((system-time-locale "en_US")
          (format "%Y-%m-%d"))
      (format-time-string "%Y-%m-%d")))

  (defun day-of-week (year month day)
    "Returns the day of the week as an integer.
     Monday is 1."
    (nth 6 (decode-time (encode-time 0 0 0 day month year))))

  (defun day-of-week-in-string (year month day)
    "Return the day of the week as day name."
    (let* ((day-names '("Sunday" "Monday" "Tuesday" "Wednesday"
                        "Thursday" "Friday" "Saturday"))
           (day-index (nth 6 (decode-time (encode-time 0 0 0 day month year)))))
      (nth day-index day-names)))
#+end_src
