config.el
(require* 'ace-jump-mode)
(require* 'expand-region)
(require* 'unicad)
(require* 'iedit)
(require* 'rainbow-mode)
(require* 'smarter-compile)
(require* 'sr-speedbar)
(require* 'tabbar)
(require* 'sauron)
(require* 'traverselisp)
(require* 'helm)
(require* 'space-chord)
(require* 'smallurl)
(require* 'switch-window)
(require* 'pretty-lambdada)
(require 'projectile)
(projectile-mode)

(require 'parenface)
(set-face-foreground 'paren-face "green")

(require 'misc)
(require 'cc-mode)

(defadvice kill-emacs (around recompile-emacs-config activate)
  "Before exit emacs, kill config.el which is generate by config.org."
  (let ((file-name (expand-file-name (concat emacs-dir "config.el"))))
    (if (file-exists-p file-name)
        (delete-file file-name nil))
    ad-do-it))

(defun flatten (structure)
  "Flatten the nesting in an arbitrary list of values."
  (cond ((null structure) nil)
        ((atom structure) `(,structure))
        (t (mapcan #'flatten structure))))

(defun list-to-string (char-list)
  "RETURN: A new string containing the characters in char-list."
  (let ((result (make-string (length char-list) 0))
        (i 0))
    (dolist (char char-list)
      (aset result i char)
      (setq i (1+ i)))
    result))

(defun search-backward-to-char (chr)
  "Search backwards to a character"
  (while (not (= (char-after) chr))
    (backward-char 1)))

(defun search-forward-to-char (chr)
  "Search forwards to a character"
  (while (not (= (char-before) chr))
    (forward-char 1)))

(defun coldnew/recursive-find-file (file &optional directory)
  "Find the first FILE in DIRECTORY or it's parents.
If file does not exist return nil."
  (let ((directory (or directory
                       (file-name-directory (buffer-file-name))
                       (pwd))))
    (if (file-exists-p (expand-file-name file directory))
        (expand-file-name file directory)
      (unless (string= "/" directory)
        (coldnew/recursive-find-file file (expand-file-name ".." directory))))))

(defun font-exist-p (fontname)
  "test if this font is exist or not."
  (if (not (x-list-fonts fontname))
      nil t))

(defun dos->unix (buf)
  "Convert buffer file from dos file to unix file."
  (let* (current-buf (current-buffer))
    (if (not (eq current-buf buf))
        (switch-to-buffer buf))
    (goto-char(point-min))
    (while (search-forward "\r" nil t) (replace-match ""))))

(defun unix->dos (buf)
  "Convert buffer file from unix file to dos file."
  (let* (current-buf (current-buffer))
    (if (not (eq current-buf buf))
        (switch-to-buffer buf))
    (goto-char(point-min))
    (while (search-forward "\n" nil t) (replace-match "\r\n"))))

(defun file->string (file)
  "Convert file to string in buffer with quote."
  (when (file-readable-p file)
    (with-temp-buffer
      (insert-file-contents file)
      (buffer-string))))

(defun get-buffers-matching-mode (mode)
  "Returns a list of buffers where their major-mode is equal to MODE"
  (let ((buffer-mode-matches '()))
    (dolist (buf (buffer-list))
      (with-current-buffer buf
        (if (eq mode major-mode)
            (add-to-list 'buffer-mode-matches buf))))
    buffer-mode-matches))

(defun show-buffer-major-mode (buffer-or-string)
  "Returns the major mode associated with a buffer."
  (with-current-buffer buffer-or-string major-mode))

(defun get-ip-address (&optional dev)
  "get the IP-address for device DEV (default: eth0)"
  (let ((dev (if dev dev "eth0")))
    (format-network-address (car (network-interface-info dev)) t)))

(defun current-date-time ()
  "return current date in `%Y-%m-%d' format, ex:`2012-04-25'."
  (let ((system-time-locale "en_US")
        (format "%Y-%m-%d"))
    (format-time-string "%Y-%m-%d")))

(defun day-of-week (year month day)
  "Returns the day of the week as an integer.
   Monday is 1."
  (nth 6 (decode-time (encode-time 0 0 0 day month year))))

(defun day-of-week-in-string (year month day)
  "Return the day of the week as day name."
  (let* ((day-names '("Sunday" "Monday" "Tuesday" "Wednesday"
                      "Thursday" "Friday" "Saturday"))
         (day-index (nth 6 (decode-time (encode-time 0 0 0 day month year)))))
    (nth day-index day-names)))
