config.org
** other
#+begin_src emacs-lisp
  (defun map-define-key (mode-map keylist fname)
    "Like define-key but the key arg is a list that should be mapped over.
     For example: (map-define-key '(a b c d) 'function-name)."
    (mapc (lambda (k) (define-key mode-map k fname))
          keylist))

  (defun emacs-process-p (pid)
    "If pid is the process ID of an emacs process, return t, else nil.
  Also returns nil if pid is nil."
    (when pid
      (let ((attributes (process-attributes pid)) (cmd))
        (dolist (attr attributes)
          (if (string= "comm" (car attr))
              (setq cmd (cdr attr))))
        (if (and cmd (or (string= "emacs" cmd) (string= "emacs.exe" cmd))) t))))

  ;;;; ---------------------------------------------------------------------------
  ;;;; Region
  ;;;; ---------------------------------------------------------------------------
  (defun select-region-to-before-match (match &optional dir)
    "Selects from point to the just before the first match of
  'match'.  The 'dir' controls direction, if nil or 'forwards then
  go forwards, if 'backwards go backwards."
    (let ((start (point))
          (end nil))

      (transient-mark-mode 1)    ;; Transient mark
      (push-mark)                ;; Mark the start, where point is now

      (if (or (null dir)
              (equalp 'forwards dir))

          ;; Move forwards to the next match then back off
          (progn
            (search-forward match)
            (backward-char))

        ;; Or search backwards and move forwards
        (progn
          (search-backward match)
          (forward-char)))

      ;; Store, then hilight
      (setq end (point))
      (exchange-point-and-mark)

      ;; And return, swap the start/end depending on direction we're going
      (if (or (null dir)
              (equalp 'forwards dir))
          (list start end)
        (list end start))))
#+end_src
* 字體                                                                 :font:
** 英文字體
#+begin_src emacs-lisp
  (defvar emacs-english-font "Monaco"
    "The font name of English.")
  (defvar emacs-english-font-size 11.5
    "Default English font size.")
#+end_src
** 中文字體
#+begin_src emacs-lisp
  (defvar emacs-cjk-font "Hiragino Sans GB W3"
    "The font name for CJK.")
  (defvar emacs-cjk-font-size 13.5
    "Default CJK font size.")
#+end_src
** 符號字體
*** TODO 不能使用，為什麼？
#+begin_src emacs-lisp
  (defvar emacs-symbol-font "Monaco"
    "The font name for Synbol.")
  (defvar emacs-symbol-font-size 16
    "Default Symbol font size.")
#+end_src
** 在圖形介面下使用我所設定的字體
#+begin_src emacs-lisp
  (cond ((eq window-system 'x)
         ;; Setting English Fonts
         (if (font-exist-p emacs-english-font)
             (set-frame-font (format "%s-%s" (eval emacs-english-font) (eval emacs-english-font-size))))

         ;; Setting Chinese Fonts
         (if (font-exist-p emacs-cjk-font)
             (set-fontset-font (frame-parameter nil 'font)
                               'han (format "%s-%s" (eval emacs-cjk-font) (eval emacs-cjk-font-size))))

         ;; Setting Symbol Fonts
         (if (font-exist-p emacs-symbol-font)
             (set-fontset-font (frame-parameter nil 'font)
                               'symbol (format "%s-%s" (eval emacs-symbol-font) (eval emacs-symbol-font-size))))
         ))
#+end_src
** 設定顯示字體時的格式
使用 *list-face-display* 可以看到所有的 face 顏色與字體。
#+begin_src emacs-lisp
  (setq list-faces-sample-text
        (concat
         "ABCDEFTHIJKLMNOPQRSTUVWXYZ abcdefghijklmnopqrstuvwxyz\n"
         "11223344556677889900       壹貳參肆伍陸柒捌玖零"
         ))
#+end_src
* 佈景主題                                                            :theme:
佈景主題的設置，包含我自訂的佈景主題以及路徑。
** 設定佈景主題的位置。
佈景主題的路徑設定在 emacs-themes-dir 裡面。
#+begin_src emacs-lisp
  (setq custom-theme-directory emacs-themes-dir)
#+end_src
** coldnew-night
我自己設計的暗色系佈景主題，會輸出成 ~/.emacs.d/themes/coldnew-night-theme.el

:PROPERTIES:
:comments: org
:tangle:   ~/.emacs.d/themes/coldnew-night-theme.el
:cache: yes
:padline: no
:END:

*** Header
#+begin_src emacs-lisp
  ;;; coldnew-night-theme.el --- Custom face theme for Emacs

  ;; Copyright (C) 2012 coldnew.

  ;; This file is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This file is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with GNU Emacs.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Code:
#+end_src

*** Init
#+begin_src emacs-lisp
  (deftheme coldnew-night
    "coldnew's dark theme.")

  (custom-theme-set-faces
   'coldnew-night
#+end_src
*** 背景與文字
設定 emacs 的背景和文字顏色
#+begin_src emacs-lisp
  '(default ((t (:background "#0B0B0E" :foreground "#DCDCDC"))))
#+end_src
*** 游標
設定 emacs 的游標顏色
#+begin_src emacs-lisp
  '(cursor ((t (:background "#C2C2C2" :foreground "#0B0B0E"))))
#+end_src
*** Region
#+begin_src emacs-lisp
  '(region ((t (:background "#444444" :foreground "#DCDCDC"))))
#+end_src
*** Mode Line
#+begin_src emacs-lisp
  '(mode-line ((t (:background "#0C0C0C" :foreground "#B1C3D4"
                               :box (:line-width 2 :color "#B184CB")))))
  '(mode-line-inactive ((t (:background "#343434" :foreground "#7B8793"
                                        :box (:line-width 2 :color "#565968")))))
  '(mode-line-buffer-id ((t (:foreground "#CDCDCD":bold t :italic t))))
#+end_src
*** fringe
#+begin_src emacs-lisp
  '(fringe ((t (:background "#2A2A2A"))))
#+end_src
*** Minibuffer
#+begin_src emacs-lisp
  '(minibuffer-prompt ((t (:foreground "#E52210" :bold t))))
#+end_src
*** Font-lock
#+begin_src emacs-lisp
  '(font-lock-builtin-face ((t (:foreground "#4BC98A"))))
  ;; Comment
  '(font-lock-comment-face ((t (:foreground "#5D9AE4" :italic t))))
  ;; Constant
  '(font-lock-constant-face ((t (:foreground "#E53F3F" :bold t))))
  ;; Function name
  '(font-lock-function-name-face ((t (:foreground "#AD7FA8" :italic t :bold t))))
  ;; Keyword
  '(font-lock-keyword-face ((t (:foreground "#FFC125"))))
  ;; String
  '(font-lock-string-face ((t (:foreground "#95E454" :italic t))))
  ;; Type
  '(font-lock-type-face ((t (:foreground "#CAE682"))))
  ;; Variable
  '(font-lock-variable-name-face ((t (:foreground "#4BC98A"))))
  ;; Warning
  '(font-lock-warning-face ((t (:foreground "#E91303" :bold t))))
  ;; Doc
  '(font-lock-doc-face ((t (:foreground "#40AAFA"))))

#+end_src
*** Auto-Complete
#+begin_src emacs-lisp
  '(ac-candidate-face ((t (:background "#424242" :foreground "white"))))
  '(ac-selection-face ((t (:background "#CAE682" :foreground "#0C0C0C"))))
#+end_src
*** org-mode
#+begin_src emacs-lisp
  '(org-date ((t (:foreground "#4D85FF" :bold t))))
  '(org-agenda-date ((t (:foreground "#8AC6F2"))))
  '(org-agenda-date-weekend ((t (:bold t :foreground "#E65C00" :weight bold))))
  '(org-hide ((t (:foreground "#0B0B0E"))))
  '(org-todo ((t (:foreground "#F43012" :bold t))))
  '(org-hide ((t (:foreground "#0B0B0E"))))
  '(org-done ((t (:foreground "#4BC98A" :bold t))))
  '(org-link   ((t (:inherit (link)))))
#+end_src
**** org-level
#+begin_src emacs-lisp
  '(org-level-1 ((t (:foreground "#8AC6F2" :bold t))))
  '(org-level-2 ((t (:foreground "#ee9a49"))))
  '(org-level-3 ((t (:foreground "#ff83fa"))))
  '(org-level-4 ((t (:foreground "#efe500"))))
  '(org-level-5 ((t (:foreground "#ff4040"))))
  '(org-level-6 ((t (:foreground "#afe04e"))))
  '(org-level-7 ((t (:foreground "#0A4C64"))))
#+end_src
*** lusty-explorer
#+begin_src emacs-lisp
  '(lusty-match-face ((t (:inherit font-lock-function-name-face))))
  '(lusty-directory-face ((t (:inherit font-lock-type-face))))
  '(lusty-file-face ((t (:inherit font-lock-string-face))))
#+end_src
*** woman
#+begin_src emacs-lisp
  '(woman-italic-face ((t (:slant italic :weight bold))))
  '(woman-unknown ((t (:foreground "#EA0000" :weight bold))))
  '(woman-addition ((t (:foreground "cadet blue"))))
  '(woman-bold ((t (:inherit bold :foreground "CadetBlue3"))))
#+end_src
*** rainbow-delimiters
#+begin_src emacs-lisp
  '(rainbow-delimiters-depth-1-face ((t (:foreground "green"))))
  ;; '(rainbow-delimiters-depth-2-face ((t (:foreground  "yellow"))))
  ;; '(rainbow-delimiters-depth-3-face ((t (:foreground  "blue"))))
  ;; '(rainbow-delimiters-depth-4-face ((t (:foreground "purple"))))
  ;; '(rainbow-delimiters-depth-5-face ((t (:foreground "orange"))))
  ;; '(rainbow-delimiters-depth-6-face ((t (:foreground  "magenta"))))
  ;; '(rainbow-delimiters-depth-7-face ((t (:foreground  "spring green"))))
  ;; '(rainbow-delimiters-depth-8-face ((t (:foreground  "coral"))))
  ;; '(rainbow-delimiters-depth-9-face ((t (:foreground  "dodger blue"))))
  ;; '(rainbow-delimiters-depth-10-face ((t (:foreground "violet red"))))
  ;; '(rainbow-delimiters-depth-11-face ((t (:foreground "DarkOrange1"))))
  ;; '(rainbow-delimiters-depth-12-face ((t (:foreground "chartreuse2"))))
#+end_src
