config.el

(defun map-define-key (mode-map keylist fname)
  "Like define-key but the key arg is a list that should be mapped over.
   For example: (map-define-key '(a b c d) 'function-name)."
  (mapc (lambda (k) (define-key mode-map k fname))
        keylist))

(defun emacs-process-p (pid)
  "If pid is the process ID of an emacs process, return t, else nil.
Also returns nil if pid is nil."
  (when pid
    (let ((attributes (process-attributes pid)) (cmd))
      (dolist (attr attributes)
        (if (string= "comm" (car attr))
            (setq cmd (cdr attr))))
      (if (and cmd (or (string= "emacs" cmd) (string= "emacs.exe" cmd))) t))))

;;;; ---------------------------------------------------------------------------
;;;; Region
;;;; ---------------------------------------------------------------------------
(defun select-region-to-before-match (match &optional dir)
  "Selects from point to the just before the first match of
'match'.  The 'dir' controls direction, if nil or 'forwards then
go forwards, if 'backwards go backwards."
  (let ((start (point))
        (end nil))

    (transient-mark-mode 1)    ;; Transient mark
    (push-mark)                ;; Mark the start, where point is now

    (if (or (null dir)
            (equalp 'forwards dir))

        ;; Move forwards to the next match then back off
        (progn
          (search-forward match)
          (backward-char))

      ;; Or search backwards and move forwards
      (progn
        (search-backward match)
        (forward-char)))

    ;; Store, then hilight
    (setq end (point))
    (exchange-point-and-mark)

    ;; And return, swap the start/end depending on direction we're going
    (if (or (null dir)
            (equalp 'forwards dir))
        (list start end)
      (list end start))))

;; Font type setting
;; (defvar emacs-english-font "Inconsolata"
(defvar emacs-english-font "Monaco"
  "The font name of English.")
;; (defvar emacs-cjk-font "LiHei Pro"
(defvar emacs-cjk-font "Hiragino Sans GB W3"
  "The font name for CJK.")
(defvar emacs-symbol-font "Monaco"
  "The font name for Synbol.")

;; font size setting
;; (defvar emacs-english-font-size 11.5
(defvar emacs-english-font-size 11.5
  "Default English font size.")
;;(defvar emacs-cjk-font-size 15

(defvar emacs-cjk-font-size 13.5
  ;; (defvar emacs-cjk-font-size 14
  "Default CJK font size.")
(defvar emacs-symbol-font-size 16
  "Default Symbol font size.")

;; Use my defined font under X
(cond ((eq window-system 'x)
       ;; Setting English Fonts
       (if (font-exist-p emacs-english-font)
           (set-frame-font (format "%s-%s" (eval emacs-english-font) (eval emacs-english-font-size))))

       ;; Setting Chinese Fonts
       (if (font-exist-p emacs-cjk-font)
           (set-fontset-font (frame-parameter nil 'font)
                             'han (format "%s-%s" (eval emacs-cjk-font) (eval emacs-cjk-font-size))))

       ;; Setting Symbol Fonts
       (if (font-exist-p emacs-symbol-font)
           (set-fontset-font (frame-parameter nil 'font)
                             'symbol (format "%s-%s" (eval emacs-symbol-font) (eval emacs-symbol-font-size))))
       ))


;; list text sample
(setq-default list-faces-sample-text
              (concat
               "ABCDEFTHIJKLMNOPQRSTUVWXYZ abcdefghijklmnopqrstuvwxyz 11223344556677889900"
               "ABCDEFTHIJKLMNOPQRSTUVWXYZ abcdefghijklmnopqrstuvwxyz 壹貳參肆伍陸柒捌玖零"
               ))

(setq custom-theme-directory emacs-themes-dir)
