theme/coldnew-night-theme.el
;;; coldnew-night-theme.el --- Custom face theme for Emacs

;; Copyright (C) 2012 coldnew.

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This file is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs.  If not, see <http://www.gnu.org/licenses/>.

;;; Code:

(deftheme coldnew-night
  "")

(custom-theme-set-faces
 'coldnew-night
 ;;;; Background and Foreground
 '(default ((t (:background "#0B0B0E" :foreground "#DCDCDC"))))

 ;;;; Cursor
 '(cursor ((t (:background "#C2C2C2" :foreground "#0B0B0E"))))

 ;;;; Region
 '(region ((t (:background "#444444" :foreground "#DCDCDC"))))

 ;;;; Modeline
 '(mode-line ((t (:background "#0C0C0C" :foreground "#B1C3D4"
                              :box (:line-width 2 :color "#B184CB")))))
 '(mode-line-inactive ((t (:background "#343434" :foreground "#7B8793"
                                       :box (:line-width 2 :color "#565968")))))
 '(mode-line-buffer-id ((t (:foreground "#CDCDCD":bold t :italic t))))

 ;;;; Fringe
 '(fringe ((t (:background "#2A2A2A"))))

 ;;;; Minibuffer
 '(minibuffer-prompt ((t (:foreground "#E52210" :bold t))))

 ;;;; Fontlock
 '(font-lock-builtin-face ((t (:foreground "#4BC98A"))))
 ;; Comment
 '(font-lock-comment-face ((t (:foreground "#5D9AE4" :italic t))))
 ;; Constant
 '(font-lock-constant-face ((t (:foreground "#E53F3F" :bold t))))
 ;; Function name
 '(font-lock-function-name-face ((t (:foreground "#AD7FA8" :italic t :bold t))))
 ;; Keyword
 '(font-lock-keyword-face ((t (:foreground "#FFC125"))))
 ;; String
 '(font-lock-string-face ((t (:foreground "#95E454" :italic t))))
 ;; Type
 '(font-lock-type-face ((t (:foreground "#CAE682"))))
 ;; Variable
 '(font-lock-variable-name-face ((t (:foreground "#4BC98A"))))
 ;; Warning
 '(font-lock-warning-face ((t (:foreground "#E91303" :bold t))))
 ;; Doc
 '(font-lock-doc-face ((t (:foreground "#40AAFA"))))
 ;; Link
