config.org
*** Other
#+begin_src emacs-lisp
  ;; Link
  '(link ((t (:foreground "dodger blue" :underline t))))
  ;; '(link-visited ((t (:foreground "#8b008b" :underline t))))

   ;;;; Show Paren
  '(show-paren-match ((t (:background "#E65C00" :foreground "#CDCDCD" :bold t))))
  '(show-paren-mismatch ((t (:background "#0C0C0C" :foreground "#E91303" :bold t))))

   ;;;; isearch
  '(isearch ((t (:background "#F57900" :foreground "#7F6BFF"))))
  '(lazy-highlight ((t (:background "#E9B96E" :foreground "#7F6BFF"))))

   ;;;; Comint
  '(comint-highlight-prompt ((t (:foreground "#5D9AE4" :bold t))))

   ;;;; Hl-line
  '(hl-line ((t :background "#444444")))

   ;;;; selection
  '(secondary-selection ((t (:background "#CAE682" :foreground "#0c0c0c"))))

   ;;;; Diff
  '(diff-added ((t (:foreground "#95E454"))))
  '(diff-removed ((t (:foreground "#E52210"))))
  '(diff-header ((t (:background "#0B0B0E"))))
  '(diff-hunk-header ((t (:foreground "yellow"))))
  '(diff-function ((t :foreground "green")))
  '(diff-file-header ((t (:foreground "aquamarine1" :slant italic :weight bold))))
  '(diff-header ((t (:foreground "VioletRed1"))))
   ;;;;;;
  '(diff-index ((t (:foreground "yellow"))))
  '(diff-context ((t (:inherit font-lock-comment))))
  '(diff-refine-change ((t (:background "#0B0B0E" :foreground "#DCDCDC"))))

   ;;;; cua
  '(cua-rectangle ((t (:background "#444444" :foreground "#DCDCDC"))))

   ;;;; iBuffer
  '(ibuffer-deletion ((t (:foreground "#dfaf8f" :weight bold))))
  '(ibuffer-help-buffer ((t (:inherit font-lock-comment))))
  '(ibuffer-marked ((t (:foreground "#f0dfaf" :weight bold))))
  '(ibuffer-special-buffer ((t (:inherit font-lock-doc))))

   ;;;; iBuffer-git
  '(ibuffer-git-add-face ((t (:inherit (diff-added)))))
  '(ibuffer-git-del-face ((t (:inherit (diff-removed)))))

   ;;;; ECB
  '(ecb-default-highlight-face ((t (:background "#CAE682" :foreground "#0C0C0C" :bold t))))

   ;;;;
  ;; '(button ((t (:underline t))))
  ;; '(header-line ((t (:background "#e5e5e5" :foreground "#333333"))))
#+end_src
*** elscreen
#+begin_src emacs-lisp
  '(elscreen-tab-background-face ((t (:background "#272729" ))))
  '(elscreen-tab-control-face ((t (:foreground "white" :background "black" :weight extra-bold))))
  '(elscreen-tab-current-screen-face ((t (:background "#250628" :foreground "Gray90" :bold t))))
  '(elscreen-tab-other-screen-face ((t (:background "#1D1D1F" :foreground "Gray85" :bold t))))
#+end_src
*** End of File
#+begin_src emacs-lisp
  )

  (provide-theme 'coldnew-night)

  ;; Local Variables:
  ;; no-byte-compile: t
  ;; End:

  ;;; coldnew-night-theme.el  ends here
#+end_src

** 設定預設讀取的佈景主題。
#+begin_src emacs-lisp
  (load-theme 'coldnew-night t)
#+end_src
* Mode
** auto-complete
*** Depends
#+begin_src emacs-lisp
  (require 'auto-complete)
  (require 'auto-complete-config)
  (require* 'auto-complete-clang)
#+end_src
*** Config
**** 使用預設的設定。
#+begin_src emacs-lisp
  (ac-config-default)
#+end_src

**** 不使用 fuzzy-match
#+begin_src emacs-lisp
  (setq ac-use-fuzzy nil)
#+end_src
**** 當輸入 4 個字母以上時，啟用自動補全。
#+begin_src emacs-lisp
  (setq ac-auto-start 4)
#+end_src

#+begin_src emacs-lisp
  ;; Ignore case if completion target string doesn't include upper characters
  (setq ac-ignore-case 'smart)

  ;; Enable auto-complete quick help
  (setq ac-use-quick-help t)

  ;; After 0.01 sec, show help window
  (setq ac-quick-help-delay 0.5)

  ;; Enable ac-comphist
  (setq ac-use-comphist t)

  ;; Setting ac-comphist data
  (setq ac-comphist-file (concat emacs-cache-dir "auto-complete.dat"))

  ;; Show menu
  (setq ac-auto-show-menu t)

  ;; Enable ac-menu-map
  (setq ac-use-menu-map t)
#+end_src
*** Keybinding
auto-complete-mode 的按鍵設定。
#+begin_src emacs-lisp
  (define-key ac-menu-map (kbd "C-n") 'ac-next)
  (define-key ac-menu-map (kbd "C-p") 'ac-previous)
  (define-key ac-completing-map "\t" 'ac-complete)
  (define-key ac-complete-mode-map[tab] 'ac-expand)
#+end_src
** auto-indent
*** Depends
#+begin_src emacs-lisp
  (require* 'auto-indent-mode)
#+end_src
** android                                                         :android:
#+begin_src emacs-lisp
  (require* 'android-mode)
  ;; Set my android-emulator-path
  (setq android-mode-sdk-dir "/opt/android-sdk-update-manager/")
#+end_src
** elscreen                                                       :elscreen:
*** Depends
#+begin_src emacs-lisp
  (require* 'elscreen)
#+end_src
*** Config
**** 自動啟用 elscreen
#+begin_src emacs-lisp
  (elscreen-start)
#+end_src
**** 分頁上顯示 *控制* 圖示
#+begin_src emacs-lisp
  (setq elscreen-tab-display-control t)
#+end_src
**** 分頁上不顯示 *關閉* 圖示
#+begin_src emacs-lisp
  (setq elscreen-tab-display-kill-screen nil)
#+end_src
*** Advice
當目前只有一個 elscreen-tab 存在時，呼叫 *elscreen-next* 、 *elscreen-previous*
或是 *elscreen-toggle* 會自動建立另外一個 elscreen-tab。
#+begin_src emacs-lisp
  (defmacro elscreen-create-automatically (ad-do-it)
    (` (if (not (elscreen-one-screen-p))
           (, ad-do-it)
         (elscreen-create)
         (elscreen-notify-screen-modification 'force-immediately)
         (elscreen-message "New screen is automatically created"))))

  (defadvice elscreen-next (around elscreen-create-automatically activate)
    (elscreen-create-automatically ad-do-it))

  (defadvice elscreen-previous (around elscreen-create-automatically activate)
    (elscreen-create-automatically ad-do-it))

  (defadvice elscreen-toggle (around elscreen-create-automatically activate)
    (elscreen-create-automatically ad-do-it))
#+end_src
** eshell                                                           :eshell:
*** Depends
#+begin_src emacs-lisp
  (require 'eshell)
  (require 'em-dirs)
  (require 'em-hist)
  (require 'em-prompt)
  (require 'em-term)
  (require 'em-cmpl)
#+end_src
*** Config
**** Prompt
將 eshell 的 prompt 設定成和 bash 一樣，也就是　 username@system-name。
#+begin_src emacs-lisp
  (setq eshell-prompt-function
        '(lambda ()
           (concat
            user-login-name "@" system-name " "
            (if (search (directory-file-name (expand-file-name (getenv "HOME"))) (eshell/pwd))
                (replace-regexp-in-string (expand-file-name (getenv "HOME")) "~" (eshell/pwd))
              (eshell/pwd))
            (if (= (user-uid) 0) " # " " $ ")
            )))
#+end_src
#+begin_src emacs-lisp
  ;;; change history file path
  (setq eshell-last-dir-ring-file-name (concat emacs-cache-dir "eshell-lastdir"))
  (setq eshell-history-file-name (concat emacs-cache-dir "eshell-history"))

  ;; other setting
  (setq eshell-save-history-on-exit t)
  (setq eshell-ask-to-save-last-dir nil)
  (setq eshell-history-size 512)
  (setq eshell-hist-ignoredups t)
  (setq eshell-cmpl-cycle-completions nil)
  (setq eshell-scroll-to-bottom-on-output t)
  (setq eshell-show-maximum-output t)

  ;;;; ---------------------------------------------------------------------------
  ;;;; Hooks
  ;;;; ---------------------------------------------------------------------------

  ;;; Make eshell prompt more colorful
  (add-to-list 'eshell-output-filter-functions 'coldnew/colorfy-eshell-prompt)

  ;; my auto-complete for elisp
  (add-hook 'eshell-mode-hook 'auto-complete-mode)
  (add-hook 'eshell-mode-hook 'ac-eshell-mode-setup)

  ;; use helm to complete esehll
  (when (featurep 'helm)
    (add-hook 'eshell-mode-hook
              #'(lambda ()
                  (define-key eshell-mode-map
                    [remap pcomplete]
                    'helm-esh-pcomplete))))


  ;; define ac-source for eshell-pcomplete
  (ac-define-source eshell-pcomplete
    '((candidates . pcomplete-completions)
      (cache)
      (symbol . "f")))

  (defun ac-eshell-mode-setup ()
    "auto-complete settings for eshell-mode"
    (setq ac-sources
          '(
            ac-source-eshell-pcomplete
            ;; ac-source-symbols
            ;; ac-source-variables
            ;; ac-source-functions
            ;; ac-source-features
            ;; ac-source-filename
            ;; ac-source-files-in-current-dir
            ;; ac-source-words-in-same-mode-buffers
            )))
#+end_src
