config.el

(load-theme 'coldnew-night t)

(require 'auto-complete)
(require 'auto-complete-config)
(require* 'auto-complete-clang)

(ac-config-default)

(setq ac-use-fuzzy nil)

(setq ac-auto-start 4)

;; Ignore case if completion target string doesn't include upper characters
(setq ac-ignore-case 'smart)

;; Enable auto-complete quick help
(setq ac-use-quick-help t)

;; After 0.01 sec, show help window
(setq ac-quick-help-delay 0.5)

;; Enable ac-comphist
(setq ac-use-comphist t)

;; Setting ac-comphist data
(setq ac-comphist-file (concat emacs-cache-dir "auto-complete.dat"))

;; Show menu
(setq ac-auto-show-menu t)

;; Enable ac-menu-map
(setq ac-use-menu-map t)

(define-key ac-menu-map (kbd "C-n") 'ac-next)
(define-key ac-menu-map (kbd "C-p") 'ac-previous)
(define-key ac-completing-map "\t" 'ac-complete)
(define-key ac-complete-mode-map [tab] 'ac-expand)

(require* 'auto-indent-mode)

(require* 'android-mode)
;; Set my android-emulator-path
(setq android-mode-sdk-dir "/opt/android-sdk-update-manager/")

(require* 'elscreen)

(elscreen-start)

(setq elscreen-tab-display-control t)

(setq elscreen-tab-display-kill-screen nil)

(defmacro elscreen-create-automatically (ad-do-it)
  (` (if (not (elscreen-one-screen-p))
         (, ad-do-it)
       (elscreen-create)
       (elscreen-notify-screen-modification 'force-immediately)
       (elscreen-message "New screen is automatically created"))))

(defadvice elscreen-next (around elscreen-create-automatically activate)
  (elscreen-create-automatically ad-do-it))

(defadvice elscreen-previous (around elscreen-create-automatically activate)
  (elscreen-create-automatically ad-do-it))

(defadvice elscreen-toggle (around elscreen-create-automatically activate)
  (elscreen-create-automatically ad-do-it))

(require 'eshell)
(require 'em-dirs)
(require 'em-hist)
(require 'em-prompt)
(require 'em-term)
(require 'em-cmpl)

(setq eshell-prompt-function
      '(lambda ()
         (concat
          user-login-name "@" system-name " "
          (if (search (directory-file-name (expand-file-name (getenv "HOME"))) (eshell/pwd))
              (replace-regexp-in-string (expand-file-name (getenv "HOME")) "~" (eshell/pwd))
            (eshell/pwd))
          (if (= (user-uid) 0) " # " " $ ")
          )))

;;; change history file path
(setq eshell-last-dir-ring-file-name (concat emacs-cache-dir "eshell-lastdir"))
(setq eshell-history-file-name (concat emacs-cache-dir "eshell-history"))

;; other setting
(setq eshell-save-history-on-exit t)
(setq eshell-ask-to-save-last-dir nil)
(setq eshell-history-size 512)
(setq eshell-hist-ignoredups t)
(setq eshell-cmpl-cycle-completions nil)
(setq eshell-scroll-to-bottom-on-output t)
(setq eshell-show-maximum-output t)

;;;; ---------------------------------------------------------------------------
;;;; Hooks
;;;; ---------------------------------------------------------------------------

;;; Make eshell prompt more colorful
(add-to-list 'eshell-output-filter-functions 'coldnew/colorfy-eshell-prompt)

;; my auto-complete for elisp
(add-hook 'eshell-mode-hook 'auto-complete-mode)
(add-hook 'eshell-mode-hook 'ac-eshell-mode-setup)

;; use helm to complete esehll
(when (featurep 'helm)
  (add-hook 'eshell-mode-hook
            #'(lambda ()
                (define-key eshell-mode-map
                  [remap pcomplete]
                  'helm-esh-pcomplete))))


;; define ac-source for eshell-pcomplete
(ac-define-source eshell-pcomplete
  '((candidates . pcomplete-completions)
    (cache)
    (symbol . "f")))

(defun ac-eshell-mode-setup ()
  "auto-complete settings for eshell-mode"
  (setq ac-sources
        '(
          ac-source-eshell-pcomplete
          ;; ac-source-symbols
          ;; ac-source-variables
          ;; ac-source-functions
          ;; ac-source-features
          ;; ac-source-filename
          ;; ac-source-files-in-current-dir
          ;; ac-source-words-in-same-mode-buffers
          )))

;; find-file
