config.org
*** 按鍵設定
| 按鍵 | 命令                     | 用途           |
|------+--------------------------+----------------|
| M-l  | backward-kill-word       | 刪除前一個詞   |
| M-p  | previous-history-element | 前一個歷史紀錄 |
| M-n  | next-history-element     | 後一個歷史紀錄 |
#+begin_src emacs-lisp
  (define-key minibuffer-local-map (kbd "M-l") 'backward-kill-word)
  (define-key minibuffer-local-map (kbd "M-p") 'previous-history-element)
  (define-key minibuffer-local-map (kbd "M-n") 'next-history-element)
  (define-key minibuffer-local-map (kbd "C-g") 'minibuffer-keyboard-quit)
#+end_src

#+begin_src emacs-lisp
  (define-key minibuffer-local-map (kbd "C-r") 'resolve-sym-link)
  (define-key minibuffer-local-map (kbd "C-u") (lambda () (interactive) (kill-line 0)))
#+end_src
*** 其他
#+begin_src emacs-lisp
  (setq enable-recursive-minibuffers     t )
  (setq minibuffer-electric-default-mode t )


  ;;;; ---------------------------------------------------------------------------
  ;;;; Hooks
  ;;;; ---------------------------------------------------------------------------

  ;; Abort the minibuffer when using the mouse
  (add-hook 'mouse-leave-buffer-hook 'stop-using-minibuffer)

  ;;;; ---------------------------------------------------------------------------
  ;;;; Functions
  ;;;; ---------------------------------------------------------------------------

  (defun stop-using-minibuffer ()
    "kill the minibuffer"
    (when (and (>= (recursion-depth) 1) (active-minibuffer-window))
      (abort-recursive-edit)))

  ;;;; ---------------------------------------------------------------------------
  ;;;; Commands
  ;;;; ---------------------------------------------------------------------------
  (defun resolve-sym-link ()
    "Replace the string at the point with the true path."
    (interactive)
    (beginning-of-line)
    (let* ((file (buffer-substring (point)
                                   (save-excursion (end-of-line) (point))))
           (file-dir (file-name-directory file))
           (file-true-dir (file-truename file-dir))
           (file-name (file-name-nondirectory file)))
      (delete-region (point) (save-excursion (end-of-line) (point)))
      (insert (concat file-true-dir file-name))))

#+end_src

** ido
*** Depends
#+begin_src emacs-lisp
  (require 'ido)
#+end_src
*** Keybindings
#+begin_src emacs-lisp
  (add-hook 'ido-setup-hook
            '(lambda ()
               (define-key ido-completion-map (kbd "C-f") 'ido-next-match)
               (define-key ido-completion-map (kbd "C-b") 'ido-prev-match)
               ))
#+end_src
** yasnippet                                                     :yasnippet:
*** 設定 snippet 所在的資料夾
#+begin_src emacs-lisp
  (setq-default yas/snippet-dirs emacs-snippets-dir)
#+end_src
*** 載入相關套件
#+begin_src emacs-lisp
  (require 'yasnippet)
  (require 'dropdown-list)
#+end_src
*** 初始化 yasnippet
#+begin_src emacs-lisp
  ;;  (yas/initialize)
  (yas-global-mode 1)
#+end_src
*** 設定 yasnippet 讀取 snippet 的資料夾
#+begin_src emacs-lisp
  (yas/load-directory emacs-snippets-dir)
#+end_src
*** 設定 yasnippet 提示用的 function
#+begin_src emacs-lisp
  (setq yas/prompt-functions '(yas/dropdown-prompt yas/ido-prompt yas/completing-prompt))
#+end_src
*** 當存檔時，更新 snippets
#+begin_src emacs-lisp
  (add-hook 'after-save-hook 'coldnew/update-yasnippets-on-save)
#+end_src
*** Functions
#+begin_src emacs-lisp
  (defun yas/dir ()
    (file-name-directory (buffer-file-name)))
  (defun yas/file ()
    (file-name-nondirectory (buffer-file-name)))
  (defun yas/file-sans ()
    (file-name-sans-extension (file-name-nondirectory (buffer-file-name))))
  (defun yas/file-ext ()
    (file-name-extension (file-name-nondirectory (buffer-file-name))))
  (defun yas/file-sans-upcase ()
    (upcase (yas/file-sans)))
  (defun yas/year ()
    (format-time-string "%Y"))
  (defun yas/user-name ()
    (insert user-full-name))
  (defun yas/login-name ()
    (insert user-login-name))
  (defun yas/user-email ()
    (insert user-mail-address))
  (defun yas/user-nickname ()
    (insert user-nickname))
  (defun coldnew/update-yasnippets-on-save ()
    "automatic reloadinf of ghanged snippets"
    (when (string-match "/snippets/" buffer-file-name)
      (yas/load-snippet-dirs)))
#+end_src
** ibuffer                                                         :ibuffer:
*** 載入相依套件
#+begin_src emacs-lisp
  (require 'ibuffer)
  (require 'ibuf-ext)
#+end_src
