config.el

(define-key minibuffer-local-map (kbd "M-l") 'backward-kill-word)
(define-key minibuffer-local-map (kbd "C-w") 'kill-word)
(define-key minibuffer-local-map (kbd "C-u") '(lambda() (interactive) (kill-line 0)))
(define-key minibuffer-local-map (kbd "M-p") 'previous-history-element)
(define-key minibuffer-local-map (kbd "M-n") 'next-history-element)
(define-key minibuffer-local-map (kbd "C-g") 'minibuffer-keyboard-quit)
(define-key minibuffer-local-map (kbd "C-r") 'resolve-sym-link)

;;;; ---------------------------------------------------------------------------
;;;; initial setting
;;;; ---------------------------------------------------------------------------
(setq enable-recursive-minibuffers     t )
(setq max-mini-window-height         .25 ) ; 2 lines high
(setq minibuffer-electric-default-mode t )


;;;; ---------------------------------------------------------------------------
;;;; Hooks
;;;; ---------------------------------------------------------------------------

;; Abort the minibuffer when using the mouse
(add-hook 'mouse-leave-buffer-hook 'stop-using-minibuffer)

;;;; ---------------------------------------------------------------------------
;;;; Functions
;;;; ---------------------------------------------------------------------------

(defun stop-using-minibuffer ()
  "kill the minibuffer"
  (when (and (>= (recursion-depth) 1) (active-minibuffer-window))
    (abort-recursive-edit)))

;;;; ---------------------------------------------------------------------------
;;;; Commands
;;;; ---------------------------------------------------------------------------
(defun resolve-sym-link ()
  "Replace the string at the point with the true path."
  (interactive)
  (beginning-of-line)
  (let* ((file (buffer-substring (point)
                                 (save-excursion (end-of-line) (point))))
         (file-dir (file-name-directory file))
         (file-true-dir (file-truename file-dir))
         (file-name (file-name-nondirectory file)))
    (delete-region (point) (save-excursion (end-of-line) (point)))
    (insert (concat file-true-dir file-name))))

(require 'ido)

(add-hook 'ido-setup-hook
          '(lambda ()
             (define-key ido-completion-map (kbd "C-f") 'ido-next-match)
             (define-key ido-completion-map (kbd "C-b") 'ido-prev-match)
             ))

(setq-default yas/snippet-dirs emacs-snippets-dir)

(require 'yasnippet)
(require 'dropdown-list)

(yas/initialize)

(yas/load-directory emacs-snippets-dir)

(setq yas/prompt-functions '(yas/dropdown-prompt yas/ido-prompt yas/completing-prompt))

(add-hook 'after-save-hook 'coldnew/update-yasnippets-on-save)

(defun yas/dir ()
  (file-name-directory (buffer-file-name)))
(defun yas/file ()
  (file-name-nondirectory (buffer-file-name)))
(defun yas/file-sans ()
  (file-name-sans-extension (file-name-nondirectory (buffer-file-name))))
(defun yas/file-ext ()
  (file-name-extension (file-name-nondirectory (buffer-file-name))))
(defun yas/file-sans-upcase ()
  (upcase (yas/file-sans)))
(defun yas/year ()
  (format-time-string "%Y"))
(defun yas/user-name ()
  (insert user-full-name))
(defun yas/login-name ()
  (insert user-login-name))
(defun yas/user-email ()
  (insert user-mail-address))
(defun yas/user-nickname ()
  (insert user-nickname))
(defun coldnew/update-yasnippets-on-save ()
  "automatic reloadinf of ghanged snippets"
  (when (string-match "/snippets/" buffer-file-name)
    (yas/load-snippet-dirs)))

(require 'ibuffer)
(require 'ibuf-ext)

;;;; Settings
