config.org
**** sort filename automatically
#+begin_src emacs-lisp
  (add-hook 'ibuffer-mode-hook 'ibuffer-do-sort-by-filename/process)
#+end_src
** winner
*** Depends
#+begin_src emacs-lisp
  (require 'winner)
#+end_src
*** Cpnfig
#+begin_src emacs-lisp
  ;; do not use default keybindings
  (setq winner-dont-bind-my-keys t)
  ;; Enable winner-mode
  (winner-mode t)
#+end_src
** speedbar
#+begin_src emacs-lisp
  (require 'speedbar)
  (setq speedbar-use-images nil)
  (require 'sr-speedbar)
  (setq sr-speedbar-right-side nil)
  (setq sr-speedbar-refresh-turn-on t)
#+end_src
** shell-pop
*** Depends
#+begin_src emacs-lisp
  (require 'shell-pop)
#+end_src
*** Config
#+begin_src emacs-lisp
  (shell-pop-set-internal-mode "eshell")
  (shell-pop-set-internal-mode-shell emacs-default-shell)
  (shell-pop-set-window-height emacs-popup-shell-window-height)
  (shell-pop-set-window-position emacs-popup-shell-window-position)

  (defadvice shell-pop (before kill-dead-term activate)
    "If there is a stopped ansi-term, kill it and create a new one."
    (let ((running-p (term-check-proc (buffer-name)))
          (term-p (string= "term-mode" major-mode)))
      (if term-p
          (when (not running-p)
            (kill-buffer (buffer-name))
            (shell-pop-out)))))
#+end_src
** multi-term
#+begin_src emacs-lisp
  (require 'multi-term)
  (setq multi-term-program emacs-default-shell)
#+end_src
** term
*** 載入相依套件
#+begin_src emacs-lisp
  (require 'term)
  (require 'ansi-color)
#+end_src
*** Config
term-mode 的設定會影響到 multi-term，這邊我主要是設定顏色。

**** Color
移除 term-mode 預設的前景與背景顏色。
#+begin_src emacs-lisp
  (setq term-default-bg-color nil)
  (setq term-default-fg-color nil)
#+end_src

重新設定 Ansi-Color，讓他和我的佈景主題配合。
#+begin_src emacs-lisp
  ;; reset ansi-color
  (setq-default ansi-color-names-vector
                (vector (frame-parameter nil 'background-color)
                        "#0B0B0E" "#CA3839" "#8ae234" "#edd400"
                        "#729fcf" "#ad7fa8" "cyan3"   "#DCDCDC"))
  (setq ansi-term-color-vector ansi-color-names-vector)
  ;; (setq ansi-color-map (ansi-color-make-color-map))
#+end_src

*** Keybindings
#+begin_src emacs-lisp
  ;;;; keybindings
  ;; (define-key term-raw-map (kbd "<f4>") 'shell-pop)
  (define-key term-raw-map (kbd "M-x") 'execute-extended-command)
  (define-key term-raw-map (kbd "C-g") 'term-interrupt-subjob)
  (define-key term-raw-map (kbd "C-n") 'term-send-down)
  (define-key term-raw-map (kbd "C-p") 'term-send-up)
  (define-key term-raw-map (kbd "<enter>") 'term-send-input)
  (define-key term-raw-map (kbd "C-o") 'coldnew/execute-in-command-mode)
#+end_src

** comint
#+begin_src emacs-lisp
  (require 'comint)
  ;; Do not show password in comint-mode
  (setq comint-output-filter-functions  '(comint-watch-for-password-prompt))
  (setq comint-password-prompt-regexp
        "\\(\\([Oo]ld \\|]e]eew \\|^\\)[Pp]assword\\|Enter password\\):\\s *\\'")

  ;;;; Keybindings
  (define-key comint-mode-map (kbd "C-g") 'comint-interrupt-subjob)
#+end_src
** undo-tree
*** 載入相依套件
#+begin_src emacs-lisp
  (require 'undo-tree)
#+end_src
*** Enable undo-tree globally
#+begin_src emacs-lisp
  (global-undo-tree-mode)
#+end_src
*** Keybinding
#+begin_src emacs-lisp
  (define-key undo-tree-visualizer-map (kbd "C-g") 'undo-tree-visualizer-quit)
#+end_src
** hungry-delete
#+begin_src emacs-lisp
  (require 'hungry-delete)
  (add-hook 'coldnew-editor-hook 'turn-on-hungry-delete-mode)
#+end_src
** cua                                                                 :cua:
#+begin_src emacs-lisp
  (require 'cua-base)
  (require 'cua-rect)
  ;; don't add C-x, C-c, C-v
  (setq cua-enable-cua-keys nil)
  (setq cua-rectangle-mark-key (kbd "C-c RET"))
  ;; Enable cua-mode
  (cua-mode t)

  (cua--init-rectangles)
  (cua--rect-M/H-key ?n   'cua-scroll-up)
  (cua--rect-M/H-key ?N   'cua-sequence-rectangle)
  (cua--rect-M/H-key ?p   'cua-scroll-down)
#+end_src
** paredit
#+begin_src emacs-lisp
  (require 'paredit)

  (defun paredit-blink-paren-match (another-line-p)
    "redefine this function, i don't like paredit to blikn math paren")

  (defadvice paredit-backward-delete (around paredit-backward-delete activate)
    "Intergrated paredit-backward-delete with hungry-delete."
    ad-do-it
    (when (featurep 'hungry-delete)
      (if (eq (char-before) ?\s)
          (hungry-delete-backward))))

  (defadvice paredit-forward-delete (around paredit-forward-delete activate)
    "Intergrated paredit-forward-delete with hungry-delete."
    ad-do-it
    (when (featurep 'hungry-delete)
      (if (eolp)
          (hungry-delete-forward))))
#+end_src
** projectile
#+begin_src emacs-lisp
  (require 'projectile)
  (projectile-global-mode)
  (setq projectile-enable-caching t)
#+end_src
** hideshow
#+begin_src emacs-lisp
  (require 'hideshow)
  (require* 'hideshowvis)

  ;;; enable following mode to use hideshow
  (dolist (hook (list 'emacs-lisp-mode-hook
                      'c++-mode-hook
                      'c-mode-hook))
    (add-hook hook 'hideshowvis-enable))
#+end_src
** slime
#+begin_src emacs-lisp
  (require 'slime)
  (require 'ac-slime)
  ;; Save REPL history to emacs-cache-dir
  (setq slime-repl-history-file (concat emacs-cache-dir "slime-hist.dat"))

  ;; REPL history size set to 300
  (setq slime-repl-history-size 300)

  ;; Use global programming mode
  (add-hook 'slime-repl-mode-hook 'programming-mode)
  (add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
#+end_src
** ielm-mode
#+begin_src emacs-lisp
  (defun ielm-auto-complete ()
    "Enables `auto-complete' support in \\[ielm]."
    (setq ac-sources '(ac-source-functions
                       ac-source-variables
                       ac-source-features
                       ac-source-symbols
                       ac-source-words-in-same-mode-buffers))
    (add-to-list 'ac-modes 'inferior-emacs-lisp-mode)
    (auto-complete-mode 1))
  (add-hook 'ielm-mode-hook 'ielm-auto-complete)
#+end_src
** compilation
#+begin_src emacs-lisp
  ;; FIXME: move to other place
  (defun notify-compilation-result(buffer msg)
    "Notify that the compilation is finished,
     close the *compilation* buffer if the compilation is successful,
     and set the focus back to Emacs frame"
    (if (string-match "^finished" msg)
        (progn
          (delete-windows-on buffer)
          (message (propertize "COMPILATION SUCCESSFUL :-) " 'face 'font-lock-warning-face))
          ;;       (tooltip-show "\n Compilation Successful :-) \n ")
          )
      (tooltip-show "\n Compilation Failed :-( \n "))
    ;; FIXME: When I use dualscreen, following functiokn will make error,
    ;;        after compilation, current frame will jump to another DISPLAY
    ;;  (setq current-frame (car (car (cdr (current-frame-configuration)))))
    ;; (select-frame-set-input-focus current-frame)
    )

  (add-to-list 'compilation-finish-functions 'notify-compilation-result)
  ;; Make compilaction buffer always scrolls to follow output as it comes in.
  (setq compilation-scroll-output t)

  ;; Auto jump to the first error.
  (setq compilation-auto-jump-to-first-error t)
#+end_src
** cmake
*** Depends
#+begin_src emacs-lisp
  (require* 'cmake-mode)
#+end_src
*** Mode List
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.cmake\\'" . cmake-mode))
  (add-to-list 'auto-mode-alist '("CMakeLists\\.txt\\'" . cmake-mode))
#+end_src

** Easy PG                                                          :easypg:
*** 載入相依套件
#+begin_src emacs-lisp
  (require 'epa-file)
#+end_src
*** Config
#+begin_src emacs-lisp
  ;; use local gpg program instaed of system one
  ;; only work under linux
  (cond
   ;; (linux-32bit-p (setq epg-gpg-program (concat emacs-bin-dir "gpg-x86")))
   (linux-64bit-p (setq epg-gpg-program (concat emacs-bin-dir "gpg")))
   )

  (setenv "GPG_AGENT_INFO" nil)

  (epa-file-enable)

  ;; Control whether or not to pop up the key selection dialog.
  (setq epa-file-select-keys 0)

  ;; Cache passphrase for symmetric encryption.
  (setq epa-file-cache-passphrase-for-symmetric-encryption t)

#+end_src
* 文檔幫助
這邊放置 manpage、womanpage、info 等幫助文檔模式的設定。
** WoMan                                                              :woman:
woman 是 emacs 下顯示 manpage 最好的方式。
*** 載入相依套件
#+begin_src emacs-lisp
  (require 'woman)
#+end_src
*** WoMan 快取儲存位置設定
#+begin_src emacs-lisp
  (setq woman-cache-filename (concat emacs-cache-dir "woman.cache"))
#+end_src
*** 對 woMan 緩衝區上色
#+begin_src emacs-lisp
  (setq woman-fontify t)
#+end_src
*** TODO 其他
#+begin_src emacs-lisp
  (setq woman-use-topic-at-point nil)
  ;; Colorful fonts
  (setq woman-fill-column 100)
#+end_src
* org-mode                                                              :org:
因為 org-mode 在這個設定檔裡佔有非常重要的比例，所以獨立出來。
** 載入相關套件
#+begin_src emacs-lisp
  (require 'org-install)
  (require 'org-table)
  (require 'ob-ditaa)
  (require 'org-latex)
#+end_src

google-weather 是提供　 emacs 連接 google-weathre 的 API，
在 org 檔案裏面加入如下的code，則可以在 agenda view 裏面看到天氣資訊。
#+begin_example
  * Weather
  %%(org-google-weather "New York")
#+end_example

#+begin_src emacs-lisp
  (require 'google-weather)
  (require 'org-google-weather)
#+end_src
** 設定 org-mode 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.txt$" . org-mode))
  (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
  (add-to-list 'auto-mode-alist '("\\.org_archive$" . org-mode))
#+end_src
** Config
#+begin_src emacs-lisp
  (setq org-directory "~/Dropbox/Org/")
  (setq org-agenda-files (list "~/Dropbox/Org/"))
  (setq org-log-done t)
  (setq org-pretty-entities t)
  (setq org-use-speed-commands t)

  (setq org-tag-alist '(
                        (:startgroup . nil) ("Business" . ?b) ("School" . ?s) ("Weintek" . ?w) ("Personal" . ?p) (:endgroup . nil)
                        ))
  (setq org-confirm-babel-evaluate nil)
#+end_src
** 預設讓 org-mode 使用自動縮排模式
#+begin_src emacs-lisp
  (setq org-startup-indented t)
#+end_src
