config.el

(add-hook 'ibuffer-mode-hook 'ibuffer-do-sort-by-filename/process)

(require 'winner)

;; do not use default keybindings
(setq winner-dont-bind-my-keys t)
;; Enable winner-mode
(winner-mode t)

(require 'speedbar)
(setq speedbar-use-images nil)
(require 'sr-speedbar)
(setq sr-speedbar-right-side nil)
(setq sr-speedbar-refresh-turn-on t)

(require 'shell-pop)

(shell-pop-set-internal-mode "eshell")
(shell-pop-set-internal-mode-shell emacs-default-shell)
(shell-pop-set-window-height emacs-popup-shell-window-height)
(shell-pop-set-window-position emacs-popup-shell-window-position)

(defadvice shell-pop (before kill-dead-term activate)
  "If there is a stopped ansi-term, kill it and create a new one."
  (let ((running-p (term-check-proc (buffer-name)))
        (term-p (string= "term-mode" major-mode)))
    (if term-p
        (when (not running-p)
          (kill-buffer (buffer-name))
          (shell-pop-out)))))

(require 'multi-term)
(setq multi-term-program emacs-default-shell)

(require 'term)
(require 'ansi-color)

(setq term-default-bg-color nil)
(setq term-default-fg-color nil)

;; reset ansi-color
(setq-default ansi-color-names-vector
              (vector (frame-parameter nil 'background-color)
                      "#0B0B0E" "#CA3839" "#8ae234" "#edd400"
                      "#729fcf" "#ad7fa8" "cyan3"   "#DCDCDC"))
(setq ansi-term-color-vector ansi-color-names-vector)
;; (setq ansi-color-map (ansi-color-make-color-map))

;;;; keybindings
;; (define-key term-raw-map (kbd "<f4>") 'shell-pop)
(define-key term-raw-map (kbd "M-x") 'execute-extended-command)
(define-key term-raw-map (kbd "C-g") 'term-interrupt-subjob)
(define-key term-raw-map (kbd "C-n") 'term-send-down)
(define-key term-raw-map (kbd "C-p") 'term-send-up)
(define-key term-raw-map (kbd "<enter>") 'term-send-input)
(define-key term-raw-map (kbd "C-o") 'coldnew/execute-in-command-mode)

(require 'comint)
;; Do not show password in comint-mode
(setq comint-output-filter-functions  '(comint-watch-for-password-prompt))
(setq comint-password-prompt-regexp
      "\\(\\([Oo]ld \\|[Nn]ew \\|^\\)[Pp]assword\\|Enter password\\):\\s *\\'")

;;;; Keybindings
(define-key comint-mode-map (kbd "C-g") 'comint-interrupt-subjob)

(require 'undo-tree)

(global-undo-tree-mode)

(define-key undo-tree-visualizer-map (kbd "C-g") 'undo-tree-visualizer-quit)

(require 'hungry-delete)
(add-hook 'coldnew-editor-hook 'turn-on-hungry-delete-mode)

(require 'cua-base)
(require 'cua-rect)
;; don't add C-x, C-c, C-v
(setq cua-enable-cua-keys nil)
(setq cua-rectangle-mark-key (kbd "C-c RET"))
;; Enable cua-mode
(cua-mode t)

(require 'paredit)

(defun paredit-blink-paren-match (another-line-p)
  "redefine this function, i don't like paredit to blikn math paren")

(defadvice paredit-backward-delete (around paredit-backward-delete activate)
  "Intergrated paredit-backward-delete with hungry-delete."
  ad-do-it
  (when (featurep 'hungry-delete)
    (if (eq (char-before) ?\s)
        (hungry-delete-backward))))

(defadvice paredit-forward-delete (around paredit-forward-delete activate)
  "Intergrated paredit-forward-delete with hungry-delete."
  ad-do-it
  (when (featurep 'hungry-delete)
    (if (eolp)
        (hungry-delete-forward))))

(require 'projectile)
(projectile-global-mode)
(setq projectile-enable-caching t)

(require 'hideshow)
(require* 'hideshowvis)

;;; enable following mode to use hideshow
(dolist (hook (list 'emacs-lisp-mode-hook
                    'c++-mode-hook
                    'c-mode-hook))
  (add-hook hook 'hideshowvis-enable))

(require 'slime)
(require 'ac-slime)
;; Save REPL history to emacs-cache-dir
(setq slime-repl-history-file (concat emacs-cache-dir "slime-hist.dat"))

;; REPL history size set to 300
(setq slime-repl-history-size 300)

;; Use global programming mode
(add-hook 'slime-repl-mode-hook 'programming-mode)
(add-hook 'slime-repl-mode-hook 'set-up-slime-ac)

(defun ielm-auto-complete ()
  "Enables `auto-complete' support in \\[ielm]."
  (setq ac-sources '(ac-source-functions
                     ac-source-variables
                     ac-source-features
                     ac-source-symbols
                     ac-source-words-in-same-mode-buffers))
  (add-to-list 'ac-modes 'inferior-emacs-lisp-mode)
  (auto-complete-mode 1))
(add-hook 'ielm-mode-hook 'ielm-auto-complete)

;; FIXME: move to other place
(defun notify-compilation-result(buffer msg)
  "Notify that the compilation is finished,
   close the *compilation* buffer if the compilation is successful,
   and set the focus back to Emacs frame"
  (if (string-match "^finished" msg)
      (progn
        (delete-windows-on buffer)
        (message (propertize "COMPILATION SUCCESSFUL :-) " 'face 'font-lock-warning-face))
        ;;       (tooltip-show "\n Compilation Successful :-) \n ")
        )
    (tooltip-show "\n Compilation Failed :-( \n "))
  ;; FIXME: When I use dualscreen, following functiokn will make error,
  ;;        after compilation, current frame will jump to another DISPLAY
  ;;  (setq current-frame (car (car (cdr (current-frame-configuration)))))
  ;; (select-frame-set-input-focus current-frame)
  )

(add-to-list 'compilation-finish-functions 'notify-compilation-result)
;; Make compilaction buffer always scrolls to follow output as it comes in.
(setq compilation-scroll-output t)

;; Auto jump to the first error.
(setq compilation-auto-jump-to-first-error t)

(require* 'cmake-mode)

(add-to-list 'auto-mode-alist '("\\.cmake\\'" . cmake-mode))
(add-to-list 'auto-mode-alist '("CMakeLists\\.txt\\'" . cmake-mode))

(require 'epa-file)

;; use local gpg program instaed of system one
;; only work under linux
(cond
 ;; (linux-32bit-p (setq epg-gpg-program (concat emacs-bin-dir "gpg-x86")))
 (linux-64bit-p (setq epg-gpg-program (concat emacs-bin-dir "gpg")))
 )

(setenv "GPG_AGENT_INFO" nil)

(epa-file-enable)

;; Control whether or not to pop up the key selection dialog.
(setq epa-file-select-keys 0)

;; Cache passphrase for symmetric encryption.
(setq epa-file-cache-passphrase-for-symmetric-encryption t)
