config.org
** Mode
#+begin_src emacs-lisp :tangle no
    (define-minor-mode coldnew-editor-local-mode
      "Minor mode for setting up coldnew-editor in a single bufer."
      :init-value nil
      (cond
       (load-in-progress)                   ; don't enable coldnew-editor in loading buffers
       (coldnew-editor-local-mode
        ;; restore the proper value of `major-mode' in Fundamental buffers
        (when (eq major-mode 'turn-on-coldnew-editor-mode)
          (setq major-mode 'fundamental-mode))

        ;; determine and enable the initial state
        ;; (unless coldnew-editor-state
        ;;   (coldnew-editor-initialize-state)
        ;;   ;; re-determine the initial state in `post-command-hook' since
        ;;   ;; the major mode may not have been initialized yet
        ;;   (add-hook 'post-command-hook #'coldnew-editor-initialize-state t t))
        ;; TODO:remove
        (run-hooks 'coldnew-editor-hook)
        )
       (t
        ;; refresh mode-line
        )))

  (defun turn-on-coldnew-editor-mode (&optional arg)
    "Turn on coldnew-editor in the current buffer."
    (interactive)
    (coldnew-editor-local-mode (or arg 1)))

  (defun turn-off-coldnew-editor-mode (&optional arg)
    "Turn off coldnew-editor in the current buffer."
    (interactive)
    (coldnew-editor-local-mode (or arg -1)))

  (defun coldnew-editor-initialize ()
    "Enable coldnew-editor in the current buffer, if appropriate.
    To enable coldnew-editor globally, do `(coldnew-editor-mode 1)'."
    (unless (minibufferp)
      (coldnew-editor-local-mode 1)))

    ;;;### autoload
  (define-global-minor-mode coldnew-editor-mode
    coldnew-editor-local-mode coldnew-editor-initialize)

#+end_src

** Variables
#+begin_src emacs-lisp
  (defvar coldnew-global-keymaps-alist nil
    "Association list of keymap variables.
  Entries have the form (MODE . KEYMAP), where KEYMAP
  is the variable containing the keymap for MODE.")

  (defvar coldnew-local-keymaps-alist nil
    "Association list of keymap variables that must be
  reinitialized in each buffer. Entries have the form
  \(MODE . KEYMAP), where KEYMAP is the variable containing
  the keymap for MODE.")
#+end_src
** Macro
#+begin_src emacs-lisp :tangle no
  (defmacro coldnew/define-local-var (symbol &optional value doc &rest body)
    "Define SYMBOL as perment buffer local variable, and return SYMBOL.
  The parameters are the same as for `defvar', but the variable
  SYMBOL is made `permanent' buffer local."
    (declare (indent defun)
             (debug (symbolp &optional form stringp[&rest[keywordp sexp]]def-body))
             )
    (let (key arg)
      (if (keywordp (car-safe body))
          (setq key (pop body)
                arg (pop body)))
      `(progn
         (defvar ,symbol ,value ,doc)
         (make-variable-buffer-local ',symbol)
         ;; collect keywords
         (if (eq key :permanent)
             (put ',symbol 'permanent-local arg)))))

  (coldnew/define-local-var aa "sd" :permanent nil)
#+end_src
#+begin_src emacs-lisp
  (defmacro coldnew/define-state (state doc &rest body)
    "Define an coldnew-editor mode MODE.
  DOC is a general description and shows up in all docstrings;
  the first line of the string should be the full name of the state.
  Then follows one or more optional keywords:

  :tag STRING             Mode line indicator.
  :message STRING         Echo area message when changing to STATE.
  :cursor SPEC            Cursor to use in STATE.
  :entry-hook LIST        Hooks run when changing to STATE.
  :exit-hook LIST         Hooks run when changing from STATE.
  :suppress-keymap FLAG   If FLAG is non-nil, disabling bindings to
                          `self-insert-command'."
    (declare (indent defun)
             (debug (&define name
                             [&optional stringp]
                             [&rest[keywordp sexp]]
                             def-body)))
    (let* (
           (name (intern (format "%s" state)))
           (doc (if (or (null doc) (string= doc "")) ""
                  (format "\n%s" doc)))
           (toggle (intern (format "coldnew-%s" state)))
           (major-mode (intern (format "%s-modes" toggle)))
           (minor-mode (intern (format "%s-minor-mode" toggle)))
           (keymap (intern (format "%s-map" toggle)))
           (local (intern (format "%s-local-minor-mode" toggle)))
           (local-keymap (intern (format "%s-local-map" toggle)))
           (tag (intern (format "%s-tag" toggle)))
           (message (intern (format "%s-message" toggle)))
           (cursor (intern (format "%s-cursor" toggle)))
           (entry-hook (intern (format "%s-entry-hook" toggle)))
           (exit-hook (intern (format "%s-exit-hook" toggle)))
           (predicate (intern (format "%s-p" toggle)))
           arg cursor-value enable entry-hook-value exit-hook-value
           input-method key message-value suppress-keymap tag-value)
      ;; collect keywords
      (while (keywordp (car-safe body))
        (setq key (pop body)
              arg (pop body))
        (cond
         ((eq key :tag)
          (setq tag-value arg))
         ((eq key :message)
          (setq message-value arg))
         ((eq key :cursor)
          (setq cursor-value arg))
         ((eq key :entry-hook)
          (setq entry-hook-value arg)
          (unless (listp entry-hook-value)
            (setq entry-hook-value (list entry-hook-value))))
         ((eq key :exit-hook)
          (setq exit-hook-value arg)
          (unless (listp exit-hook-value)
            (setq exit-hook-value (list entry-hook-value))))
         ;; ((eq key :enable)
         ;;  (setq enable arg))
         ((eq key :input-method)
          (setq input-method arg))
         ((eq key :suppress-keymap)
          (setq suppress-keymap arg))))
      ;; macro expansion
      `(progn
         (defvar ,minor-mode nil
           ,(format "Non-nil if %s is enabled.
                              Use the command `%s' to change this variable." name toggle))
         (defvar ,major-mode nil
           ,(format "Modes that should come up in %s." name))
         ;; (defun ,predicate (&optional state)
         ;;        ,(format "Whether the current `coldnew-editor' state is `%s'.)" name)
         ;;        )
         )
      ))

#+end_src
