config.org
** COMMENT Function
#+begin_src emacs-lisp :tangle no
  (defmacro coldnew-define-local-var (symbol &optional initvalue docstring)
    "Define SYMBOL as permanent buffer local variable, and return SYMBOL.
  The parameters are the same as for `defvar', but the variable
  SYMBOL is made permanent buffer local."
    (declare (indent defun)
             (debug (symbolp &optional form stringp)))
    `(progn
       (defvar ,symbol ,initvalue ,docstring)
       (make-variable-buffer-local ',symbol)
       (put ',symbol 'permanent-local t)))

  (coldnew-define-local-var coldnew-editor-state nil
                            "The current coldnew-editor-state.
  To change the state, use `coldnew-change-state'
  or call the state function (e.g., `coldnew-editor-state').")

  (coldnew-define-local-var coldnew-editor-previous-state nil
                            "The coldnew-editor-state being switched from.")

  (coldnew-define-local-var coldnew-mode-line-tag nil
                            "Mode-Line indicator for the current state.")
  (put 'coldnew-mode-line-tag 'risky-local-variable t)

  (defun coldnew-add-to-alist (list-var key val &rest elements)
    "Add the assocation of KEY and VAL to the value of LIST-VAR.
  If the list already contains an entry for KEY, update that entry;
  otherwise add at the end of the list."
    (let ((tail (symbol-value list-var)))
      (while (and tail (not (equal (car-safe (car-safe tail)) key)))
        (setq tail (cdr tail)))
      (if tail
          (setcar tail (cons key val))
        (set list-var (append (symbol-value list-var)
                              (list (cons key val)))))
      (if elements
          (apply #'coldnew-add-to-alist list-var elements)
        (symbol-value list-var))))



  (defmacro coldnew/define-keymap (keymap doc &rest body)
    "Define a keymap KEYMAP listed in `coldnew-mode-map-alist'.
  That means it will have precedence over regular keymaps.

  DOC is the documentation for the variable. BODY, if specified,
  is executed after toggling the mode. Optional keyword arguments
  may be specified before the body code:

  :mode VAR       Mode variable. If unspecified, the variable
                  is based on the keymap name.
  :local BOOLEAN  Whether the keymap should be buffer-local, that is,
                  reinitialized for each buffer.
  :func BOOLEAN   Create a toggle function even if BODY is empty.

  \(fn KEYMAP DOC[[KEY VAL]...]BODY...)"
    (declare (indent defun)
             (debug (&define name
                             [&optional stringp]
                             [&rest[keywordp sexp]]
                             def-body)))
    (let ((func t)
          arg intercept key local mode overriding)
      (while (keywordp (car-safe body))
        (setq key (pop body)
              arg (pop body))
        (cond
         ((eq key :mode)
          (setq mode arg))
         ((eq key :local)
          (setq local arg))
         ((eq key :func)
          (setq func arg))
         ((eq key :intercept)
          (setq intercept arg))
         ((eq key :overriding)
          (setq overriding arg))))
      (setq mode (or mode
                     (intern (replace-regexp-in-string
                              "\\(?:-\\(?:mode-\\)?\\(?:key\\)?map\\)?$"
                              "-mode"
                              (symbol-name keymap)))))
      `(progn
         (defvar ,keymap ,(unless local '(make-sparse-keymap)))
         (unless (get ',keymap 'variable-documentation)
           (put ',keymap 'variable-documentation ,doc))
         (defvar ,mode nil)
         (unless (get ',mode 'variable-documentation)
           (put ',mode 'variable-documentation ,doc))
         (make-variable-buffer-local ',mode)
         (put ',mode 'permanent-local t)
         (when ,intercept
           (evil-make-intercept-map ,keymap))
         (when ,overriding
           (evil-make-overriding-map ,keymap))
         ,@(if local
               `((make-variable-buffer-local ',keymap)
                 (put ',keymap 'permanent-local t)
                 (coldnew-add-to-alist 'coldnew-local-keymaps-alist
                                       ',mode ',keymap))
             `((coldnew-add-to-alist 'coldnew-global-keymaps-alist
                                     ',mode ',keymap)))
         ,(when (or body func)
            `(defun ,mode (&optional arg)
               ,@(when doc `(,doc))
               (interactive)
               (cond
                ((numberp arg)
                 (setq ,mode (> arg 0)))
                (t
                 (setq ,mode (not ,mode))))
               ,@body))
         ',keymap)))

  (coldnew/define-state test
    "doc"
    :tag "e"
    )



#+end_src
#+begin_src emacs-lisp :tangle no
    ;;;; lisp common setting
  (defun coldnew-lisp-common-setting ()
    "coldnew's common setting for lisp-like mode"
    ;; Use coldnew's editor mode
    (coldnew-editor-mode)
    ;; Use Greek character lambda insteda of string
    (turn-on-pretty-lambda-mode)
    (require 'rainbow-delimiters)
;;    (rainbow-delimiters-mode)
    )


  ;;;; cc-mode common setting
  (defun coldnew-cc-mode-common-setting ()
    "coldnew's common setting for cc-mode"
    ;; Use coldnew's editor mode
    (coldnew-editor-mode)
    ;; enable doxygen
    ;;  (doxymacs-mode t)
    ;;  (doxymacs-font-lock)

    ;; hide-if-def mode
    (hide-ifdef-mode)
    ;; use shadow
    (setq hide-ifdef-shadow t)

    ;; gtags
    ;;  (gtags-mode t)
    ;;  (if-not (string-match "/usr/src/linux/" (expand-file-name default-directory))
    ;;        (gtags-create-or-update))

    ;; keybindings
    (local-set-key (kbd "C-x C-o") 'ff-find-other-file)
    (local-set-key (kbd "C-x C-o") 'ff-find-other-file)
    (local-set-key (kbd "<f9>") 'smarter-compile)
    )

#+end_src
This section contains my editor state
#+begin_src emacs-lisp :tangle no
  (defvar coldnew-editor-hook nil
    "Hooks for coldnew-editor-mode.")

  (defvar coldnew-editor-state "Emacs"
    "default editor mode is Emacs-mode")

  (defvar coldnew-editor-map
    (let ((map (make-sparse-keymap)))
      map)
    "Keymap for coldnew-editor-mode.")

  (define-minor-mode coldnew-editor-mode
    "Minor mode for coldnew's editor."
    :init-value t
    :lighter " coldnew-editor"
    :keymap coldnew-editor-map
    (run-hooks 'coldnew-editor-hook))

  (defun coldnew/disable-mode-according-state ()
    (cond
     ((string= "View"  coldnew-editor-state) (view-mode -1))
     ((string= "Command"  coldnew-editor-state) (coldnew/command-mode -1))
     ))

  (defun coldnew/switch-to-emacs-mode ()
    (interactive)
    ;; disable other state according mode
    (coldnew/disable-mode-according-state)
    (setq coldnew-editor-state "Emacs"))

  (defun coldnew/switch-to-command-mode ()
    (interactive)
    ;; disable other state according mode
    (coldnew/disable-mode-according-state)
    (setq coldnew-editor-state "Command")
    (coldnew/command-mode 1))

  (defvar coldnew/command-mode-map
    (let ((map (make-sparse-keymap)))
      (suppress-keymap map)
      ;; simulate vim keys
      (define-key map "i" 'coldnew/switch-to-emacs-mode)
      (define-key map "%" 'match-paren)
      (define-key map "." 'repeat)
      (define-key map "*" 'vjo-forward-current-word-keep-offset)
      (define-key map "#" 'vjo-backward-current-word-keep-offset)
      ;; my keymap
      (define-key map "C" 'capitalize-word-backward)
      (define-key map "c" 'capitalize-word-backward)
      (define-key map "L" 'downcase-word-backward)
      (define-key map "U" 'upcase-word-backward)
      (define-key map "Z" 'zap-up-to-char-backward)
      (define-key map "e" 'ecb-toggle-ecb-windows)
      ;; (define-key map "a" 'backward-sentence)
      ;; (define-key map "e" 'forward-sentence)
      (define-key map "g" 'linum-ace-jump)
      (define-key map "o" 'org-ido-switchb)
      (define-key map "q" 'quoted-insert)
      (define-key map "r" 'org-capture)
      (define-key map "w" 'kill-region)
      ;; (define-key map "n" 'windmove-down)
      ;; (define-key map "p" 'windmove-up)
      ;; (define-key map "f" 'windmove-right)
      ;; (define-key map "b" 'windmove-left)
      (define-key map "b" 'ido-switch-buffer)
      (define-key map "\C-m" 'bm-toggle)
      (define-key map "\C-n" 'bm-next)
      (define-key map "\C-p" 'bm-previous)
      (define-key map "x" 'helm-M-x)
      (define-key map "y" 'yank)
      (define-key map "z" 'zap-up-to-char)
      ;; FIXME: I think this must change to vc-next-action
      (define-key map "v" 'egg-next-action)
      (define-key map "h" 'coldnew/helm-filelist)
      (define-key map (kbd "<SPC>") 'ace-jump-mode)
      (define-key map (kbd "(")  '(lambda () (interactive) (delete-between-pair ?\()))
      (define-key map (kbd "\"") '(lambda () (interactive) (delete-between-pair ?\")))
      (define-key map (kbd "[")  '(lambda () (interactive) (delete-between-pair ?\[)))
      (define-key map (kbd "{")  '(lambda () (interactive) (delete-between-pair ?\{)))
      (define-key map (kbd "\'") '(lambda () (interactive) (delete-between-pair ?\')))
      ;; elscreen
      ;; TODO: move to coldnew-elscreen
      (define-key map "t0" 'elscreen-jump-0)
      (define-key map "t9" 'elscreen-jump-9)
      (define-key map "tc" 'elscreen-create)
      (define-key map "td" 'elscreen-kill)
      (define-key map "tn" 'elscreen-next)
      (define-key map "tp" 'elscreen-previous)
      map)
    "Keymap for coldnew-editor-Mode.")

  (define-minor-mode coldnew/command-mode
    "Minor mode like vi's normal mode"
    :init-value nil
    :global t
    :lighter " "
    :keymap coldnew/command-mode-map
    (if coldnew/command-mode
        (progn
          ;; use key-chord
          (setq input-method-function 'key-chord-input-method))
      (progn
        ;; disable keychord
        (setq input-method-function nil))))

  (add-hook 'post-command-hook 'coldnew/set-mode-according-state)

  (defun coldnew/toggle-state ()
    (interactive)
    (cond
     ((string= "Command" coldnew-editor-state) (coldnew/switch-to-emacs-mode))
     ((string= "Emacs"   coldnew-editor-state) (coldnew/switch-to-command-mode)) )
    )

  (defvar coldnew/buffer-state-alist
    '((eshell-mode . "Emacs")
      (term-mode   . "Emacs")
      (ibuffer-mode . "Emacs")
      ))

  (defun coldnew/set-mode-according-state ()
    (let* ((mode major-mode)
           (state (cdr-safe (assoc mode coldnew/buffer-state-alist))))
      (if (minibufferp) (setq state "Emacs"))
      (cond
       ((string= "Command" state) (coldnew/switch-to-command-mode))
       ((string= "Emacs"   state) (coldnew/switch-to-emacs-mode)) )
      ))

  ;; FIXME: change to my own code one day
  (defun coldnew/evil-delay (condition form hook &optional append local name)
    "Execute FORM when CONDITION becomes true, checking with HOOK.
  NAME specifies the name of the entry added to HOOK. If APPEND is
  non-nil, the entry is appended to the hook. If LOCAL is non-nil,
  the buffer-local value of HOOK is modified."
    (if (and (not (booleanp condition)) (eval condition))
        (eval form)
      (let* ((name (or name (format "evil-delay-form-in-%s" hook)))
             (fun (make-symbol name))
             (condition (or condition t)))
        (fset fun `(lambda (&rest args)
                     (when ,condition
                       (remove-hook ',hook #',fun ',local)
                       ,form)))
        (put fun 'permanent-local-hook t)
        (add-hook hook fun append local))))

  (defun coldnew/execute-in-command-mode ()
    "Execute the next command in Command mode."
    (interactive)
    (coldnew/evil-delay '(not (eq this-command #'coldnew/execute-in-command-mode))
                        `(progn (coldnew/switch-to-emacs-mode))
                        'post-command-hook)
    (coldnew/switch-to-command-mode)
    )

  (global-set-key (kbd "C-o") 'coldnew/execute-in-command-mode)
  (global-set-key (kbd "C-j") 'linum-ace-jump)

#+end_src
#+begin_src emacs-lisp
  ;;;; ---------------------------------------------------------------------------
  ;;;; Initial Editor Setting
  ;;;; ---------------------------------------------------------------------------
  (setq indent-tabs-mode nil )          ; don't use tabs to indent
  (setq tab-width          8 )          ; default tab-width is 8
  (setq line-spacing       4 )          ; Additional space between lines
  (setq fill-column      100 ) ; column beyond which automatic line-wrapping shold happen
  (setq kill-ring-max    300 ) ; Maximum lenght of kill-ring
  (setq require-final-newline  t ) ; Auto add a newline at the end of line
  (setq next-line-add-newlines t ) ;
  (setq shift-select-mode      t ) ; Enable shift-select mode

  ;; Enable global font-lock
  (global-font-lock-mode t)
  ;; Revert buffers automatically when underlying files are changed externally
  (global-auto-revert-mode t)
  ;; Show matching parentheses all the time
  (show-paren-mode t)
  ;; Enable auto-complete-mode
  (global-auto-complete-mode t)
  ;; Enable delete-selection-mode
  (delete-selection-mode t)
#+end_src

