config.el
  (defun coldnew-lisp-common-setting ()
    "coldnew's common setting for lisp-like mode"
    ;; Use coldnew's editor mode
    (coldnew-editor-mode)
    ;; Use Greek character lambda insteda of string
    (turn-on-pretty-lambda-mode)
    (require 'rainbow-delimiters)
;;    (rainbow-delimiters-mode)
    )


  ;;;; cc-mode common setting
  (defun coldnew-cc-mode-common-setting ()
    "coldnew's common setting for cc-mode"
    ;; Use coldnew's editor mode
    (coldnew-editor-mode)
    ;; enable doxygen
    ;;  (doxymacs-mode t)
    ;;  (doxymacs-font-lock)

    ;; hide-if-def mode
    (hide-ifdef-mode)
    ;; use shadow
    (setq hide-ifdef-shadow t)

    ;; gtags
    ;;  (gtags-mode t)
    ;;  (if-not (string-match "/usr/src/linux/" (expand-file-name default-directory))
    ;;        (gtags-create-or-update))

    ;; keybindings
    (local-set-key (kbd "C-x C-o") 'ff-find-other-file)
    (local-set-key (kbd "C-x C-o") 'ff-find-other-file)
    (local-set-key (kbd "<f9>") 'smarter-compile)
    )

(defvar coldnew-editor-hook nil
  "Hooks for coldnew-editor-mode.")

(defvar coldnew-editor-state "Emacs"
  "default editor mode is Emacs-mode")

(defvar coldnew-editor-map
  (let ((map (make-sparse-keymap)))
    map)
  "Keymap for coldnew-editor-mode.")

(define-minor-mode coldnew-editor-mode
  "Minor mode for coldnew's editor."
  :init-value t
  :lighter " coldnew-editor"
  :keymap coldnew-editor-map
  (run-hooks 'coldnew-editor-hook))

(defun coldnew/disable-mode-according-state ()
  (cond
   ((string= "View"  coldnew-editor-state) (view-mode -1))
   ((string= "Command"  coldnew-editor-state) (coldnew/command-mode -1))
   ))

(defun coldnew/switch-to-emacs-mode ()
  (interactive)
  ;; disable other state according mode
  (coldnew/disable-mode-according-state)
  (setq coldnew-editor-state "Emacs"))

(defun coldnew/switch-to-command-mode ()
  (interactive)
  ;; disable other state according mode
  (coldnew/disable-mode-according-state)
  (setq coldnew-editor-state "Command")
  (coldnew/command-mode 1))

(defvar coldnew/command-mode-map
  (let ((map (make-sparse-keymap)))
    (suppress-keymap map)
    ;; simulate vim keys
    (define-key map "i" 'coldnew/switch-to-emacs-mode)
    (define-key map "%" 'match-paren)
    (define-key map "." 'repeat)
    (define-key map "*" 'vjo-forward-current-word-keep-offset)
    (define-key map "#" 'vjo-backward-current-word-keep-offset)
    ;; my keymap
    (define-key map "C" 'capitalize-word-backward)
    (define-key map "c" 'capitalize-word-backward)
    (define-key map "L" 'downcase-word-backward)
    (define-key map "U" 'upcase-word-backward)
    (define-key map "Z" 'zap-up-to-char-backward)
    (define-key map "e" 'ecb-toggle-ecb-windows)
    ;; (define-key map "a" 'backward-sentence)
    ;; (define-key map "e" 'forward-sentence)
    (define-key map "g" 'linum-ace-jump)
    (define-key map "o" 'org-ido-switchb)
    (define-key map "q" 'quoted-insert)
    (define-key map "r" 'org-capture)
    (define-key map "w" 'kill-region)
    (define-key map "n" 'windmove-down)
    (define-key map "p" 'windmove-up)
    (define-key map "f" 'windmove-right)
    (define-key map "b" 'windmove-left)
    (define-key map "\C-m" 'bm-toggle)
    (define-key map "\C-n" 'bm-next)
    (define-key map "\C-p" 'bm-previous)
    (define-key map "x" 'helm-M-x)
    (define-key map "y" 'yank)
    (define-key map "z" 'zap-up-to-char)
    ;; FIXME: I think this must change to vc-next-action
    (define-key map "v" 'egg-next-action)
    (define-key map "h" 'coldnew/helm-filelist)
    (define-key map (kbd "<SPC>") 'ace-jump-mode)
    (define-key map (kbd "(")  '(lambda () (interactive) (delete-between-pair ?\()))
    (define-key map (kbd "\"") '(lambda () (interactive) (delete-between-pair ?\")))
    (define-key map (kbd "[")  '(lambda () (interactive) (delete-between-pair ?\[)))
    (define-key map (kbd "{")  '(lambda () (interactive) (delete-between-pair ?\{)))
    (define-key map (kbd "\'") '(lambda () (interactive) (delete-between-pair ?\')))
    ;; elscreen
    ;; TODO: move to coldnew-elscreen
    (define-key map "t0" 'elscreen-jump-0)
    (define-key map "t9" 'elscreen-jump-9)
    (define-key map "tc" 'elscreen-create)
    (define-key map "td" 'elscreen-kill)
    (define-key map "tn" 'elscreen-next)
    (define-key map "tp" 'elscreen-previous)
    map)
  "Keymap for coldnew-editor-Mode.")

(define-minor-mode coldnew/command-mode
  "Minor mode like vi's normal mode"
  :init-value nil
  :global t
  :lighter " "
  :keymap coldnew/command-mode-map
  (if coldnew/command-mode
      (progn
        ;; use key-chord
        (setq input-method-function 'key-chord-input-method))
    (progn
      ;; disable keychord
      (setq input-method-function nil))))

(add-hook 'post-command-hook 'coldnew/set-mode-according-state)

(defun coldnew/toggle-state ()
  (interactive)
  (cond
   ((string= "Command" coldnew-editor-state) (coldnew/switch-to-emacs-mode))
   ((string= "Emacs"   coldnew-editor-state) (coldnew/switch-to-command-mode)) )
  )

(defvar coldnew/buffer-state-alist
  '((eshell-mode . "Emacs")
    (term-mode   . "Emacs")
    (ibuffer-mode . "Emacs")
    ))

(defun coldnew/set-mode-according-state ()
  (let* ((mode major-mode)
         (state (cdr-safe (assoc mode coldnew/buffer-state-alist))))
    (if (minibufferp) (setq state "Emacs"))
    (cond
     ((string= "Command" state) (coldnew/switch-to-command-mode))
     ((string= "Emacs"   state) (coldnew/switch-to-emacs-mode)) )
    ))

;; FIXME: change to my own code one day
(defun coldnew/evil-delay (condition form hook &optional append local name)
  "Execute FORM when CONDITION becomes true, checking with HOOK.
NAME specifies the name of the entry added to HOOK. If APPEND is
non-nil, the entry is appended to the hook. If LOCAL is non-nil,
the buffer-local value of HOOK is modified."
  (if (and (not (booleanp condition)) (eval condition))
      (eval form)
    (let* ((name (or name (format "evil-delay-form-in-%s" hook)))
           (fun (make-symbol name))
           (condition (or condition t)))
      (fset fun `(lambda (&rest args)
                   (when ,condition
                     (remove-hook ',hook #',fun ',local)
                     ,form)))
      (put fun 'permanent-local-hook t)
      (add-hook hook fun append local))))

(defun coldnew/execute-in-command-mode ()
  "Execute the next command in Command mode."
  (interactive)
  (coldnew/evil-delay '(not (eq this-command #'coldnew/execute-in-command-mode))
                      `(progn (coldnew/switch-to-emacs-mode))
                      'post-command-hook)
  (coldnew/switch-to-command-mode)
  )

(global-set-key (kbd "C-o") 'coldnew/execute-in-command-mode)
(global-set-key (kbd "C-j") 'linum-ace-jump)

;;;; ---------------------------------------------------------------------------
;;;; Initial Editor Setting
;;;; ---------------------------------------------------------------------------
(setq indent-tabs-mode nil )          ; don't use tabs to indent
(setq tab-width          8 )          ; default tab-width is 8
(setq line-spacing       4 )          ; Additional space between lines
(setq fill-column      100 ) ; column beyond which automatic line-wrapping shold happen
(setq kill-ring-max    300 ) ; Maximum lenght of kill-ring
(setq require-final-newline  t ) ; Auto add a newline at the end of line
(setq next-line-add-newlines t ) ;
(setq shift-select-mode      t ) ; Enable shift-select mode

;; Enable global font-lock
(global-font-lock-mode t)
;; Revert buffers automatically when underlying files are changed externally
(global-auto-revert-mode t)
;; Show matching parentheses all the time
(show-paren-mode t)
;; Enable auto-complete-mode
(global-auto-complete-mode t)
;; Enable delete-selection-mode
(delete-selection-mode t)
