config.org
*** 設定 Bash 語言 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.sh" . sh-mode))
  (add-to-list 'auto-mode-alist '("\\.bash" . sh-mode))
#+end_src
*** Auto complete
#+begin_src emacs-lisp
  ;; auto-complete
  (add-hook 'shell-mode-hook 'ac-shell-script-mode-setup)
  ;; define ac-source for pcomplete
  (ac-define-source pcomplete
    '((candidates . pcomplete-completions)
      (cache)
      (symbol . "f")))

  (defun ac-shell-script-mode-setup ()
    "auto-complete settings for shell-script-mode"
    (setq ac-sources
          '(ac-source-pcomplete
            ac-source-dictionary
            ac-source-filename
            ac-source-files-in-current-dir
            ac-source-words-in-same-mode-buffers
            )))
#+end_src
#+begin_src emacs-lisp
    ;;;; ---------------------------------------------------------------------------
    ;;;; Hooks
    ;;;; ---------------------------------------------------------------------------

  ;; use my editor-mode
  (add-hook 'shell-mode-hook '(lambda() (coldnew-editor-mode 1)))


  ;; bash-completion
;;  (require 'bash-completion)
;;  (bash-completion-setup)

  ;; use flymake-shell
  (require* 'flymake-shell)
  (add-hook 'shell-mode-hook 'flymake-shell-load)

#+end_src
*** Keybinding
#+begin_src emacs-lisp
  (add-hook 'sh-mode-hook
            '(lambda ()
               (local-set-key (kbd "}") 'self-insert-command)
               (local-set-key (kbd "]") 'self-insert-command)
               (local-set-key (kbd ")") 'self-insert-command)
               ))
#+end_src
** C
*** 設定 C 語言 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.c$" . c-mode))
  (add-to-list 'auto-mode-alist '("\\.h$" . c-mode))
#+end_src
*** 預設使用 Linux Coding Style
#+begin_src emacs-lisp
  (add-hook 'c-mode-hook
            '(lambda ()
               (c-set-style "linux")))
#+end_src
*** Hooks
**** prefix
**** c-eldoc
adeff
#+begin_src emacs-lisp
    (add-hook 'c-mode-hook
            '(lambda ()
               (require 'c-eldoc)
               (setq c-eldoc-includes "`pkg-config gtk+-3.0 opencv --cflags --libs` -I./ -I../")
               (c-turn-on-eldoc-mode)))
#+end_src
#+begin_src emacs-lisp
  ;; use my cc-mode-common-setting
;;  (add-hook 'c-mode-hook 'coldnew-cc-mode-common-setting)

  ;; use ctypes
  (require 'ctypes)
  (setq-default ctypes-file-name (concat emacs-cache-dir "ctypes_std_c.dat"))
  (add-hook 'ctypes-load-hook 'my-ctypes-load-hook)

  ;; use hide-if-def-mode
  ;;(add-hook 'c-mode-hook 'hide-ifdef-mode)

  (require 'gccsense)

  ;;;; ---------------------------------------------------------------------------
  ;;;; Functions
  ;;;; ---------------------------------------------------------------------------
  (defun my-ctypes-load-hook ()
    (ctypes-read-file ctypes-file-name nil t t))


  ;;;; ---------------------------------------------------------------------------
  ;;;; Commands
  ;;;; ---------------------------------------------------------------------------

  (defun c-mode:insert-inc-or-if ()
    "If at the start of line. add `inc' and expand it,
  else add `if' and expand it."
    (interactive)
    (let* ((current (point))
           (begin (line-beginning-position)))
      (if (eq current begin)
          (progn
            (c-mode:insert-include)
            (newline-and-indent))
        (progn
          (insert "if")
          (yas/expand)))))
#+end_src
**** TODO 自動偵測 c-basic-offset
#+begin_src emacs-lisp
  (require* 'guess-offset)
#+end_src
**** 自動猜測縮排風格
#+begin_src emacs-lisp
  (when (require 'dtrt-indent nil 'noerror)
    (add-hook 'c-mode-hook
              (lambda () (dtrt-indent-mode t))))
#+end_src
*** Keybinding
#+begin_src emacs-lisp
  (define-key c-mode-map (kbd "C-x C-o") 'ff-find-other-file)
#+end_src
*** Cscope
C-c s s             序找符号
C-c s g             寻找全局的定义
C-c s c             看看指定函数被哪些函数所调用
C-c s C             看看指定函数调用了哪些函数
C-c s e             寻找正则表达式
C-c s f             寻找文件
C-c s i             看看指定的文件被哪些文件 include
C-c s a             设定初始化的目录，一般是你代码的根目录
C-s s I             对目录中的相关文件建立列表并进行索引
*** Functions
*** Commands
#+begin_src emacs-lisp
  (defun c-mode:insert-main-function ()
    "insert main()."
    (interactive)
    (let* ((current (point))
           (begin (line-beginning-position)))
      (if (equal current begin)
          (insert "main"))
      (yas/expand)))
#+end_src
** C++
*** 設定 C++ 語言 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.hpp$" . c++-mode))
  (add-to-list 'auto-mode-alist '("\\.cpp$" . c++-mode))
  (add-to-list 'magic-mode-alist
               `(,(lambda ()
                    (and (string= (file-name-extension buffer-file-name) "h")
                         (re-search-forward "\\W\\(class\\|template\\namespace\\)\\W"
                                            magic-mode-regexp-match-limit t)))
                 . c++-mode))
#+end_src
*** Config
**** Codinf Style
#+begin_src emacs-lisp
    ;;;; CodingStyle
  (add-hook 'c++-mode-hook
            '(lambda ()

               ;; TODO: add comment here
               (setq c-macro-shrink-window-flag t)
               (setq c-macro-preprocessor "cpp")
               (setq c-macro-cppflags " ")
               (setq c-macro-prompt-flag t)

               ;; Use linux-kernel style
               (c-set-style "linux")

               ;; Setting indentation lvel
               (setq c-basic-offset 4)

               ;; Make TAB equivilent to 4 spaces
               (setq tab-width 4)

               ;; Use spaces to indent instead of tabs.
               (setq indent-tabs-mode nil)

               ;; Indent the continuation by 2
               (setq c-continued-statement-offset 2)

               ;; Brackets should be at same indentation level as the statements they open
               ;; for example:
               ;;                 if (0)        becomes        if (0)
               ;;                     {                        {
               ;;                        ;                         ;
               ;;                     }                        }
               (c-set-offset 'substatement-open '0)
               ;; make open-braces after a case
               (c-set-offset 'case-label '+)

               ))

#+end_src
#+begin_src emacs-lisp
  ;; use my cc-mode-common-setting
  ;;(add-hook 'c++-mode-hook 'coldnew-cc-mode-common-setting)

  ;;;; Auto Complete
  ;;;; ---------------------------------------------------------------------------

    ;; Default clang completion flags
    ;;    (setq clang-completion-flags
    (setq ac-clang-flags
          (split-string
           (concat
            "-pthread -I./ -I../ "
            (shell-command-to-string "pkg-config --cflags-only-I opencv gtk+-3.0"))))
#+end_src

*** Hooks
**** c-eldoc
#+begin_src emacs-lisp
  (add-hook 'c++-mode-hook
            '(lambda ()
               ;; Enable c-eldoc
               (require 'c-eldoc)
               (setq c-eldoc-includes "`pkg-config gtk+-3.0 opencv --cflags --libs` -I./ -I../")
               (c-turn-on-eldoc-mode)))
#+end_src
**** 自動猜測縮排風格
#+begin_src emacs-lisp
  (when (require 'dtrt-indent nil 'noerror)
    (add-hook 'c++-mode-hook
              (lambda () (dtrt-indent-mode t))))
#+end_src
*** 自動補全設定
**** 載入其餘需要使用的套件。
#+begin_src emacs-lisp
  (require 'auto-complete-clang)
#+end_src
**** 設定用來補全的資訊。
#+begin_src emacs-lisp
  (add-hook 'c++-mode-hook 'ac-cpp-mode-setup)
  (defun ac-cpp-mode-setup ()
    "auto-complete settings for c-mode."
    (setq ac-sources '(
                       ac-source-clang
                       ac-source-dictionary
                       ac-source-abbrev
                       ac-source-semantic
                       ac-source-filename
                       ac-source-files-in-current-dir
                       ac-source-words-in-same-mode-buffers
                       )))
#+end_src
*** Keybinding
#+begin_src emacs-lisp
  (define-key c++-mode-map (kbd "C-x C-o") 'ff-find-other-file)
#+end_src
C-c  s             序找符号
C-c  g             寻找全局的定义
C-c  c             看看指定函数被哪些函数所调用
C-c  C             看看指定函数调用了哪些函数
C-c  e             寻找正则表达式
C-c  f             寻找文件
C-c  i             看看指定的文件被哪些文件 include
C-c  a             设定初始化的目录，一般是你代码的根目录
C-c  I             对目录中的相关文件建立列表并进行索引
#+begin_src emacs-lisp
  (define-key c++-mode-map (kbd "C-c s") 'cscope-find-this-symbol)
  (define-key c++-mode-map (kbd "C-c g") 'cscope-find-global-definition)
  (define-key c++-mode-map (kbd "C-c I") 'cscope-create-list-of-files-to-index)
 ;; remember to remove
  (define-key c++-mode-map (kbd "C-c f") 'cscope-find-this-file)
#+end_src
** Common Lisp
*** 設定 Common Lisp 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.cl$" . lisp-mode))
#+end_src
** Clojure
