config.el

(add-to-list 'auto-mode-alist '("\\.c$" . c-mode))
(add-to-list 'auto-mode-alist '("\\.h$" . c-mode))

(add-hook 'c-mode-hook
          '(lambda ()
             (c-set-style "linux")))

(add-hook 'c-mode-hook
        '(lambda ()
           (require 'c-eldoc)
           (setq c-eldoc-includes "`pkg-config gtk+-3.0 opencv --cflags --libs` -I./ -I../")
           (c-turn-on-eldoc-mode)))

;; use my cc-mode-common-setting
;;  (add-hook 'c-mode-hook 'coldnew-cc-mode-common-setting)

  ;; use ctypes
  (require 'ctypes)
  (setq-default ctypes-file-name (concat emacs-cache-dir "ctypes_std_c.dat"))
  (add-hook 'ctypes-load-hook 'my-ctypes-load-hook)

  ;; use hide-if-def-mode
  ;;(add-hook 'c-mode-hook 'hide-ifdef-mode)

  (require 'gccsense)

  ;;;; ---------------------------------------------------------------------------
  ;;;; Functions
  ;;;; ---------------------------------------------------------------------------
  (defun my-ctypes-load-hook ()
    (ctypes-read-file ctypes-file-name nil t t))


  ;;;; ---------------------------------------------------------------------------
  ;;;; Commands
  ;;;; ---------------------------------------------------------------------------

  (defun c-mode:insert-inc-or-if ()
    "If at the start of line. add `inc' and expand it,
  else add `if' and expand it."
    (interactive)
    (let* ((current (point))
           (begin (line-beginning-position)))
      (if (eq current begin)
          (progn
            (c-mode:insert-include)
            (newline-and-indent))
        (progn
          (insert "if")
          (yas/expand)))))

(require* 'guess-offset)

(define-key c-mode-map (kbd "C-x C-o") 'ff-find-other-file)

(defun c-mode:insert-main-function ()
  "insert main()."
  (interactive)
  (let* ((current (point))
         (begin (line-beginning-position)))
    (if (equal current begin)
        (insert "main"))
    (yas/expand)))

(add-to-list 'auto-mode-alist '("\\.hpp$" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.cpp$" . c++-mode))
(add-to-list 'magic-mode-alist
             `(,(lambda ()
                  (and (string= (file-name-extension buffer-file-name) "h")
                       (re-search-forward "\\W\\(class\\|template\\namespace\\)\\W"
                                          magic-mode-regexp-match-limit t)))
               . c++-mode))

;;;; CodingStyle
(add-hook 'c++-mode-hook
          '(lambda ()

             ;; TODO: add comment here
             (setq c-macro-shrink-window-flag t)
             (setq c-macro-preprocessor "cpp")
             (setq c-macro-cppflags " ")
             (setq c-macro-prompt-flag t)

             ;; Use linux-kernel style
             (c-set-style "linux")

             ;; Setting indentation lvel
             (setq c-basic-offset 4)

             ;; Make TAB equivilent to 4 spaces
             (setq tab-width 4)

             ;; Use spaces to indent instead of tabs.
             (setq indent-tabs-mode nil)

             ;; Indent the continuation by 2
             (setq c-continued-statement-offset 2)

             ;; Brackets should be at same indentation level as the statements they open
             ;; for example:
             ;;                 if (0)        becomes        if (0)
             ;;                     {                        {
             ;;                        ;                         ;
             ;;                     }                        }
             (c-set-offset 'substatement-open '0)
             ;; make open-braces after a case
             (c-set-offset 'case-label '+)

             ))

;; use my cc-mode-common-setting
;;(add-hook 'c++-mode-hook 'coldnew-cc-mode-common-setting)

;;;; Auto Complete
;;;; ---------------------------------------------------------------------------

  ;; Default clang completion flags
  ;;    (setq clang-completion-flags
  (setq ac-clang-flags
        (split-string
         (concat
          "-pthread -I./ -I../ "
          (shell-command-to-string "pkg-config --cflags-only-I opencv gtk+-3.0"))))

(add-hook 'c++-mode-hook
          '(lambda ()
             ;; Enable c-eldoc
             (require 'c-eldoc)
             (setq c-eldoc-includes "`pkg-config gtk+-3.0 opencv --cflags --libs` -I./ -I../")
             (c-turn-on-eldoc-mode)))

;; my auto-complete for cpp
(add-hook 'c++-mode-hook 'ac-cpp-mode-setup)
(require 'auto-complete-clang)
(defun ac-cpp-mode-setup ()
  "auto-complete settings for c-mode."
  (setq ac-sources '(
                     ac-source-clang
                     ac-source-dictionary
                     ac-source-abbrev
                     ac-source-semantic
                     ac-source-filename
                     ac-source-files-in-current-dir
                     ac-source-words-in-same-mode-buffers
                     )))

(define-key c++-mode-map (kbd "C-x C-o") 'ff-find-other-file)

(define-key c++-mode-map (kbd "C-c s") 'cscope-find-this-symbol)
 (define-key c++-mode-map (kbd "C-c g") 'cscope-find-global-definition)
 (define-key c++-mode-map (kbd "C-c I") 'cscope-create-list-of-files-to-index)
;; remember to remove
 (define-key c++-mode-map (kbd "C-c f") 'cscope-find-this-file)

(add-to-list 'auto-mode-alist '("\\.sh" . sh-mode))
(add-to-list 'auto-mode-alist '("\\.bash" . sh-mode))

;;;; ---------------------------------------------------------------------------
;;;; Hooks
;;;; ---------------------------------------------------------------------------

;; use my editor-mode
(add-hook 'shell-mode-hook '(lambda() (coldnew-editor-mode 1)))

;; auto-complete
(add-hook 'shell-mode-hook 'ac-shell-script-mode-setup)

;; bash-completion
(require 'bash-completion)
(bash-completion-setup)

;; use flymake-shell
(require* 'flymake-shell)
(add-hook 'shell-mode-hook 'flymake-shell-load)


;;;; ---------------------------------------------------------------------------
;;;; Keybindings
;;;; ---------------------------------------------------------------------------


;;;; ---------------------------------------------------------------------------
;;;; Auto Complete
;;;; ---------------------------------------------------------------------------

;; define ac-source for pcomplete
(ac-define-source pcomplete
  '((candidates . pcomplete-completions)
    (cache)
    (symbol . "f")))

(defun ac-shell-script-mode-setup ()
  "auto-complete settings for shell-script-mode"
  (setq ac-sources
        '(ac-source-pcomplete
          ac-source-dictionary
          ac-source-filename
          ac-source-files-in-current-dir
          ac-source-words-in-same-mode-buffers
          )))

;;;; ---------------------------------------------------------------------------
;;;; Flymake
;;;; ---------------------------------------------------------------------------

;;;; ---------------------------------------------------------------------------
;;;; Functions
;;;; ---------------------------------------------------------------------------


;;;; ---------------------------------------------------------------------------
;;;; Commands
;;;; ---------------------------------------------------------------------------

;;;; ---------------------------------------------------------------------------
