config.org
*** 載入相關套件
#+begin_src emacs-lisp
  (require 'clojure-mode)
#+end_src
*** 設定 Clojure 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.clj$" . clojure-mode))
#+end_src
*** 啟用 rainbow-delimiters
#+begin_src emacs-lisp
  (add-hook 'clojure-mode-hook
            '(lambda ()
               (when (require rainbow-delimiters)
                 (rainbow-delimiters-mode-enable))))
#+end_src
** Clojure Script
** Emacs Lisp
*** 設定 emacs-lisp 的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.el$" . emacs-lisp-mode))
#+end_src
*** Hooks
**** eldoc
eldoc 能夠將目前所使用的 elisp function 所需要的 argument 顯示在 minibuffer 上。
#+begin_src emacs-lisp
  (require 'eldoc)
  (require 'eldoc-extension)
  (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
#+end_src

讓 pairedit 相容於 eldoc。
#+begin_src emacs-lisp
  (when (featurep 'paredit)
    (eldoc-add-command 'paredit-backward-delete 'paredit-close-round))
#+end_src

**** highlight-cl
高亮屬於 cl.el 套件的 function 或是 macro。
#+begin_src emacs-lisp
  (require 'highlight-cl)
  (add-hook 'emacs-lisp-mode-hook 'highlight-cl-add-font-lock-keywords)
#+end_src

**** auto-indent
#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'auto-indent-minor-mode)
#+end_src
**** Other
#+begin_src emacs-lisp
;;  (add-hook 'emacs-lisp-mode-hook 'coldnew-lisp-common-setting)
#+end_src
*** 自動補全
#+begin_src emacs-lisp
    (add-hook 'emacs-lisp-mode-hook 'ac-emacs-lisp-mode-setup)
    (defun ac-emacs-lisp-mode-setup ()
        "auto-complete settings for emacs-lisp-mode"
        (setq ac-sources
              '(ac-source-symbols
                ac-source-variables
                ac-source-functions
                ac-source-features
                ac-source-filename
                ac-source-files-in-current-dir
                ac-source-words-in-same-mode-buffers
                )))
#+end_src
*** TODO Flymake
#+begin_src emacs-lisp :tangle no
  (require 'flymake)
  (defun flymake-elisp-init ()
    (unless (string-match "^ " (buffer-name))
      (let* ((temp-file   (flymake-init-create-temp-buffer-copy
                           'flymake-create-temp-inplace))
             (local-file  (file-relative-name
                           temp-file
                           (file-name-directory buffer-file-name))))
        (list
         (expand-file-name invocation-name invocation-directory)
         (list
          "-Q" "--batch" "--eval"
          (prin1-to-string
           (quote
            (dolist (file command-line-args-left)
              (with-temp-buffer
                (insert-file-contents file)
                (condition-case data
                    (scan-sexps (point-min) (point-max))
                  (scan-error
                   (goto-char(nth 2 data))
                   (princ (format "%s:%s: error: Unmatched bracket or quote\n"
                                  file (line-number-at-pos)))))))
            )
           )
          local-file)))))
  (push '("\\.el$" flymake-elisp-init) flymake-allowed-file-name-masks)
  (add-hook 'emacs-lisp-mode-hook
            ;; workaround for (eq buffer-file-name nil)
            '(lambda () (if buffer-file-name (flymake-mode t))))


#+end_src
*** Functions
#+begin_src emacs-lisp
    (defun remove-elc-when-visit ()
      "After visit elisp file, remove .elc extension file."
      (make-local-variable 'find-file-hook)
      (add-hook 'find-file-hook
                (lambda ()
                  (if (and (file-exists-p (concat buffer-file-name "c"))
                           (file-writable-p (concat buffer-file-name "c")))
                      (delete-file (concat buffer-file-name "c"))))))
#+end_src
*** Keybinding
#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook
            '(lambda ()
               (define-key emacs-lisp-mode-map (kbd "M-i r") '(lambda () (interactive) (insert "require") (yas/expand)))
               ))
#+end_src

#+begin_src emacs-lisp
  <<emacs-lisp-mode-hook-begin>>

  (define-key emacs-lisp-mode-map (kbd "C-c C-b") 'backward-sexp)

  <<emacs-lisp-mode-hook-end>>
#+end_src

#+name: emacs-lisp-mode-hook-begin
#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook
            '(lambda ()
#+end_src

#+name: emacs-lisp-mode-hook-end
#+begin_src emacs-lisp
))
#+end_src
** JavaScript
*** 設定 javascript 的副檔名與對應的模式
使用 js2-mode 替代原本系統內建的 js-mode。
#+begin_src emacs-lisp
  (require* 'js2-mode)
  (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
#+end_src
*** 自動補全
#+begin_src emacs-lisp
  (add-hook 'js-mode-hook 'ac-javascript-mode-setup)
  (defun ac-javascript-mode-setup ()
    "auto-complete settings for javascript-mode"
    (setq ac-sources
          '(ac-source-dictionary
            ac-source-filename
            ac-source-files-in-current-dir
            ac-source-words-in-same-mode-buffers
            )))
#+end_src
*** REPL 設定
使用 js-comint 來設定 REPL 模式。
**** 設定起始位置
#+begin_src emacs-lisp
  (when (require 'js-comint nil 'noerror)
#+end_src
**** 設定 REPL 程式為 node.js
#+begin_src emacs-lisp
    (setq inferior-js-program-command "node")
#+end_src
**** 在 REPL 啟用 ANSI 色彩
#+begin_src emacs-lisp
;;  (add-hook 'js-mode-hook 'ansi-color-for-comint-mode-on)
#+end_src
**** 設定終止位置
#+begin_src emacs-lisp
    )
#+end_src
** LaTex
** Scheme
*** 設定 Scheme 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.scm$" . scheme-mode))
#+end_src
** Perl
*** 設定 Perl 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.pl" . perl-mode))
#+end_src
** Python
*** 設定 Python 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.py" . python-mode))
  (add-to-list 'interpreter-mode-alist '("python" . python-mode))
#+end_src
*** pymacs
**** 設定檔起始
#+begin_src emacs-lisp
  (eval-after-load "python-mode"
    '(progn
#+end_src
**** require
#+begin_src emacs-lisp
  (require* 'pymacs)
#+end_src
**** TODO 讓 pymacs 找的到 rope 以及 ropemacs
我將 pymacs 必須使用的 rope、ropemacs、ropemode 安裝在 lisp 資料夾裏面，
必須設定 PATH 讓 pymacs 知道他們在哪。
#+begin_src emacs-lisp
;; no use?
;;  (setq pymacs-load-path '("~/.emacs.d/lisp/rope"
;;                          "~/.emacs.d/lisp/ropemacs"))
#+end_src
**** 設定 pymacs 使用的 python 版本
使用 python2.7
#+begin_src emacs-lisp
  (setenv "PYMACS_PYTHON" "python2.7")
#+end_src
**** 修改 ropemacs 預設的 keymap-prefix
#+begin_src emacs-lisp
  (setq ropemacs-enable-shortcuts nil)
  (setq ropemacs-local-prefix "C-c C-p")
  (setq ropemacs-global-prefix "C-c p")
#+end_src
**** 啟用 ropemacs
#+begin_src emacs-lisp
  (pymacs-load "ropemacs" "rope-")
#+end_src
**** 設定檔結速
#+begin_src emacs-lisp
  ))
#+end_src
*** 自動補全
#+begin_src emacs-lisp
(require* 'ac-python)
#+end_src
** Verilog
*** 設定 verilog 檔案的副檔名與對應的模式
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.v$" . verilog-mode))
#+end_src
*** 自動添加 *end //blockname* 註解
#+begin_src emacs-lisp
  (setq verilog-auto-endcomments t)
#+end_src
*** 按鍵設定
#+begin_src emacs-lisp
    (add-hook 'verilog-mode-hook
              '(lambda ()
                 (define-key verilog-mode-map (kbd "C-;") 'iedit-mode)
                 (auto-complete-mode)
                 ))
#+end_src
* Mode Line                                                        :modeline:
** TODO 分類
#+begin_src emacs-lisp
  ;;;; ---------------------------------------------------------------------------
  ;;;; Initial modeline setting
  ;;;; ---------------------------------------------------------------------------
  (line-number-mode t)
  (column-number-mode t)
  (size-indication-mode t)

  ;;;; ---------------------------------------------------------------------------
  ;;;; Functions
  ;;;; ---------------------------------------------------------------------------
  (defun mode-line-major-mode ()
    "Get major-mode name with << >>."
    (concat "<< " (propertize mode-name 'face 'mode-line-mode-name-face) " >>"))
  (defun coldnew-editor-mode-string ()
    (let* ((mode-string-face
            (cond
             ((string= "Command" coldnew-editor-state) 'mode-line-evil-state-string-V)
             ((string= "View" coldnew-editor-state) 'mode-line-evil-state-string-N)
             (t 'mode-line-evil-state-string-E)
             )))
      (concat "<" (propertize coldnew-editor-state 'face mode-string-face) ">")))
  ;;;; ---------------------------------------------------------------------------
  ;;;; modeline User-Interfaced setting
  ;;;; ---------------------------------------------------------------------------
#+end_src
** 設定 mode-line 樣式
#+begin_src emacs-lisp
  (setq-default mode-line-format
                  '((" "
                     mode-line-mule-info
                     ;; read-only or modified status
                     (:eval
                      (cond (buffer-read-only
                             (propertize "RO" 'face 'mode-line-read-only-face))
                            ((buffer-modified-p)
                             (propertize "**" 'face 'mode-line-modified-face))
                            (t "--")))
                     "   "
                     (:eval (coldnew-editor-mode-string))
                     "   "
                     ;;              (:eval (mode-line-state))
                     mode-line-buffer-identification
                     "   "
                     ;; major-mode name
                     (:eval (mode-line-major-mode))
                     "   "
                     ;; line and column
                     "("
                     (:eval (propertize "%02l" 'face 'font-lock-type-face))
                     ","
                     (:eval (propertize "%02c" 'face 'font-lock-type-face))
                     ")"

                     "   "
                     (vc-mode vc-mode)
                     "   "
                     ;; relative position, size of file
                     "["
                     (:eval (propertize "%p" 'face 'font-lock-constant-face)) ;; % above top
                     "/"
                     (:eval (propertize "%I" 'face 'font-lock-constant-face)) ;; size
                     "] "
                     )))
#+end_src
* 互動式命令                                                        :command:
** Buffer
*** 跳轉到 **scratch**
跳轉目前 buffer 與 **scratch**，假如 **scratch** 不存在，
則建立一個 major-mode 為 lisp-interaction-mode 的 **scratch**
#+begin_src emacs-lisp
  (defun scratch-toggle ()
    "Toggle between *scratch* buffer and the current buffer.
     If the *scratch* buffer does not exist, create it."
    (interactive)
    (let ((scratch-buffer-name (get-buffer-create "*scratch*")))
      (if (equal (current-buffer) scratch-buffer-name)
          (switch-to-buffer (other-buffer))
        ;;        (previous-user-buffer)
        (progn
          (switch-to-buffer scratch-buffer-name)
          (unless (equal major-mode 'lisp-interaction-mode)
            (lisp-interaction-mode))))))
#+end_src
*** save-buffer-always
預設的 save-buffer 在 buffer 沒有變動時，不會進行儲存，
使用此命令可以使得在呼叫 save-buffer-always 時，將 buffer 變更為修改過，
並進行儲存。
#+begin_src emacs-lisp
  (defun save-buffer-always ()
    "Save the buffer even if it is not modified."
    (interactive)
    (set-buffer-modified-p t)
    (save-buffer))
#+end_src
*** revert-all-buffer
#+begin_src emacs-lisp
(defun revert-all-buffers ()
  "Revert all non-modified buffers associated with a file.
This is to update existing buffers after a Git pull of their underlying files."
  (interactive)
  (save-current-buffer
    (mapc (lambda (b)
            (set-buffer b)
            (unless (or (null (buffer-file-name)) (buffer-modified-p))
              (revert-buffer t t)
              (message "Reverted %s\n" (buffer-file-name))))
          (buffer-list))))
#+end_src
*** nuke-all-buffers
關閉除了 **scratch** 以外的所有 buffer。
#+begin_src emacs-lisp
  (defun nuke-all-buffers ()
    "Kill all buffers, leaving *scratch* only."
    (interactive)
    (mapcar (lambda (x) (kill-buffer x)) (buffer-list))
    (delete-other-windows))
#+end_src
** 其他、未歸類
*** 縮排整個 buffer
#+begin_src emacs-lisp
  (defun indent-whole-buffer ()
    "Indent whole buffer and delete trailing whitespace.
  This command will also do untabify."
    (interactive)
    (delete-trailing-whitespace)
    (indent-region (point-min) (point-max))
    (untabify (point-min) (point-max)))
#+end_src
*** 縮牌區域或是整個 buffer
#+begin_src emacs-lisp
  (defun indent-region-or-buffer ()
    "Indents a region if selected, otherwise the whole buffer."
    (interactive)
    (save-excursion
      (if (region-active-p)
          (progn
            (delete-trailing-whitespace (region-beginning) (region-end))
            (indent-region (region-beginning) (region-end))
            (untabify (region-beginning) (region-end))
            (message "Indented selected region."))
        (progn
          (indent-region-or-buffer)
          (message "Indented buffer.")))))
#+end_src
