config.el
;;;; Initial modeline setting
;;;; ---------------------------------------------------------------------------
(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

;;;; ---------------------------------------------------------------------------
;;;; Functions
;;;; ---------------------------------------------------------------------------
(defun mode-line-major-mode ()
  "Get major-mode name with << >>."
  (concat "<< " (propertize mode-name 'face 'mode-line-mode-name-face) " >>"))
(defun coldnew-editor-mode-string ()
  (let* ((mode-string-face
          (cond
           ((string= "Command" coldnew-editor-state) 'mode-line-evil-state-string-V)
           ((string= "View" coldnew-editor-state) 'mode-line-evil-state-string-N)
           (t 'mode-line-evil-state-string-E)
           )))
    (concat "<" (propertize coldnew-editor-state 'face mode-string-face) ">")))
;;;; ---------------------------------------------------------------------------
;;;; modeline User-Interfaced setting
;;;; ---------------------------------------------------------------------------
(setq-default mode-line-format
              '((" "
                 mode-line-mule-info
                 ;; read-only or modified status
                 (:eval
                  (cond (buffer-read-only
                         (propertize "RO" 'face 'mode-line-read-only-face))
                        ((buffer-modified-p)
                         (propertize "**" 'face 'mode-line-modified-face))
                        (t "--")))
                 "   "
                 (:eval (coldnew-editor-mode-string))
                 "   "
                 ;;              (:eval (mode-line-state))
                 mode-line-buffer-identification
                 "   "
                 ;; major-mode name
                 (:eval (mode-line-major-mode))
                 "   "
                 ;; line and column
                 "("
                 (:eval (propertize "%02l" 'face 'font-lock-type-face))
                 ","
                 (:eval (propertize "%02c" 'face 'font-lock-type-face))
                 ")"

                 "   "
                 (vc-mode vc-mode)
                 "   "
                 ;; relative position, size of file
                 "["
                 (:eval (propertize "%p" 'face 'font-lock-constant-face)) ;; % above top
                 "/"
                 (:eval (propertize "%I" 'face 'font-lock-constant-face)) ;; size
                 "] "
                 )))

(defun scratch-toggle ()
  "Toggle between *scratch* buffer and the current buffer.
   If the *scratch* buffer does not exist, create it."
  (interactive)
  (let ((scratch-buffer-name (get-buffer-create "*scratch*")))
    (if (equal (current-buffer) scratch-buffer-name)
        (switch-to-buffer (other-buffer))
      ;;        (previous-user-buffer)
      (progn
        (switch-to-buffer scratch-buffer-name)
        (unless (equal major-mode 'lisp-interaction-mode)
          (lisp-interaction-mode))))))

(defun save-buffer-always ()
  "Save the buffer even if it is not modified."
  (interactive)
  (set-buffer-modified-p t)
  (save-buffer))
