config.el

(defun window-horizontal-to-vertical ()
  "Switches from a horizontal split to a vertical split."
  (interactive)
  (let ((one-buf (window-buffer (selected-window)))
        (buf-point (point)))
    (other-window 1)
    (delete-other-windows)
    (split-window-horizontally)
    (switch-to-buffer one-buf)
    (goto-char buf-point)))

(defun window-vertical-to-horizontal ()
  "Switches from a vertical split to a horizontal split."
  (interactive)
  (let ((one-buf (window-buffer (selected-window)))
        (buf-point (point)))
    (other-window 1)
    (delete-other-windows)
    (split-window-vertically)
    (switch-to-buffer one-buf)
    (goto-char buf-point)))

(defun my-column-ruler (width)
  "Display temp ruler at point."
  (interactive `(,(+ (window-hscroll)(window-width))))
  (momentary-string-display
   (let* ((iterations (/ (1- width) 10))
          (result1 "|...|....|")
          (result2 "1   5   10")
          (inc1 "....|....|")
          (inc2 "        %d0")
          (i 1))
     (while  (<= i iterations)
       (setq i (1+ i))
       (setq result1 (concat result1 inc1))
       (setq result2 (concat result2 (substring (format inc2 i) -10))))
     (concat (substring result2 0 width) "\n"
             (substring result1 0 width) "\n"))
   (line-beginning-position)
   nil "[space] Clears ruler"))

(defun swap-with (dir)
  (interactive)
  (let ((other-window (windmove-find-other-window dir)))
    (when other-window
      (let* ((this-window (selected-window))
             (this-buffer (window-buffer this-window))
             (other-buffer (window-buffer other-window))
             (this-start (window-start this-window))
             (other-start (window-start other-window)))
        (set-window-buffer this-window other-buffer)
        (set-window-buffer other-window this-buffer)
        (set-window-start this-window other-start)
        (set-window-start other-window this-start)))))

;; (global-set-key (kbd "C-M-J") (lambda () (interactive) (swap-with 'down)))
;; (global-set-key (kbd "C-M-K") (lambda () (interactive) (swap-with 'up)))
;; (global-set-key (kbd "C-M-H") (lambda () (interactive) (swap-with 'left)))
;; (global-set-key (kbd "C-M-L") (lambda () (interactive) (swap-with 'right)))

;; (global-set-key (kbd "M-J") (lambda () (interactive) (enlarge-window 1)))
;; (global-set-key (kbd "M-K") (lambda () (interactive) (enlarge-window -1)))
;; (global-set-key (kbd "M-H") (lambda () (interactive) (enlarge-window -1 t)))
;; (global-set-key (kbd "M-L") (lambda () (interactive) (enlarge-window 1 t)))


(defun select-forwards-to-before-match (match)
  "Selects forwards to just before next match, uses
select-region-to-before-match"
  (interactive "MSelect forwards to just before: ")
  (select-region-to-before-match match 'forwards))

(defun select-backwards-to-before-match (match)
  "Selects backwards to just before next match, uses
select-region-to-before-match"
  (interactive "MSelect backwards to just before: ")
  (select-region-to-before-match match 'backwards))

(defun kill-forwards-to-before-match (match)
  "Selects forwards to just before next match, uses
select-region-to-before-match, then kills that region."
  (interactive "MKill forwards to just before: ")
  (let* ((positions (select-region-to-before-match match 'forwards))
         (start (car positions))
         (end (cadr positions)))
    (kill-region start end)))

(defun kill-backwards-to-before-match (match)
  "Selects backwards to just before next match, uses
select-region-to-before-match, then kills that region."
  (interactive "MKill backwards to just before: ")
  (let* ((positions (select-region-to-before-match match 'backwards))
         (start (car positions))
         (end (cadr positions)))
    (kill-region start end)))

(defun match-paren (arg)
  "Go to the matching paren if on a paren; otherwise insert %."
  (interactive "p")
  (cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
        ((looking-at "\\s\)") (forward-char 1) (backward-list 1))
        (t (self-insert-command (or arg 1)))))

(defun delete-between-pair (char)
  "Delete in between the given pair"
  (interactive "cDelete between char: ")
  (let ((pair-char))
    (search-backward-to-char char)
    (forward-char 1)
    (cond
     ((char-equal char ?\() (setq pair-char ?\)))
     ((char-equal char ?\") (setq pair-char ?\"))
     ((char-equal char ?\') (setq pair-char ?\'))
     ((char-equal char ?\[) (setq pair-char ?\]))
     ((char-equal char ?\{) (setq pair-char ?\}))
     ((char-equal char ?\<) (setq pair-char ?\>)))
    (zap-up-to-char 1 pair-char)))

(defun cua-set-mark-or-rectangle-mark (&optional arg)
  "toggle between cua-set-mark or cua-rectangle-mark"
  (interactive "P")
  (if (or (not mark-active) arg)
      (cua-set-mark arg)
    (cua-toggle-rectangle-mark)))


(defadvice kill-ring-save (before slickcopy activate compile)
  "When called interactively with no active region, copy a single line
instead."
  (interactive
   (if mark-active (list (region-beginning) (region-end))
     (list (line-beginning-position)
           (line-beginning-position 2)))))

(defadvice kill-region (before slickcut activate compile)
  "When called interactively with no active region, kill a single line
instead."
  (interactive
   (if mark-active (list (region-beginning) (region-end))
     (list (line-beginning-position)
           (line-beginning-position 2)))))

(defun zap-up-to-char-backward (arg char)
  (interactive "p\ncZap up to char backward: ")
  (zap-up-to-char (- arg) char))

(defun go-to-char (arg char)
  (interactive "p\ncGo to char: ")
  (forward-char 1)
  (if (if arg
          (search-forward (char-to-string char) nil nil arg)
        (search-forward (char-to-string char)))
      (backward-char 1)))

(defun go-back-to-char (arg char)
  (interactive "p\ncGo back to char: ")
  (forward-char -1)
  (if arg
      (search-backward (char-to-string char) nil nil arg)
    (search-backward (char-to-string char))))

(defun vjo-forward-current-word-keep-offset ()
  " (Vagn Johansen 1999)"
  (interactive)
  (let ((re-curword) (curword) (offset (point))
        (old-case-fold-search case-fold-search) )
    (setq curword (thing-at-point 'symbol))
    (setq re-curword (concat "\\<" (thing-at-point 'symbol) "\\>") )
    (beginning-of-thing 'symbol)
    (setq offset (- offset (point)))    ; offset from start of symbol/word
    (setq offset (- (length curword) offset)) ; offset from end
    (forward-char)
    (setq case-fold-search nil)
    (if (re-search-forward re-curword nil t)
        (backward-char offset)
      ;; else
      (progn (goto-char (point-min))
             (if (re-search-forward re-curword nil t)
                 (progn (message "Searching from top. %s" (what-line))
                        (backward-char offset))
               ;; else
               (message "Searching from top: Not found"))
             ))
    (setq case-fold-search old-case-fold-search)
    ))

(defun vjo-backward-current-word-keep-offset ()
  " (Vagn Johansen 2002)"
  (interactive)
  (let ((re-curword) (curword) (offset (point))
        (old-case-fold-search case-fold-search) )
    (setq curword (thing-at-point 'symbol))
    (setq re-curword (concat "\\<" curword "\\>") )
    (beginning-of-thing 'symbol)
    (setq offset (- offset (point)))    ; offset from start of symbol/word
    (forward-char)
    (setq case-fold-search nil)
    (if (re-search-backward re-curword nil t)
        (forward-char offset)
      ;; else
      (progn (goto-char (point-max))
             (if (re-search-backward re-curword nil t)
                 (progn (message "Searching from bottom. %s" (what-line))
                        (forward-char offset))
               ;; else
               (message "Searching from bottom: Not found"))
             ))
    (setq case-fold-search old-case-fold-search)
    ))

;; ;; FIXME: need to test
;; (defun set-frame-size-according-to-resolution ()
;;   (interactive)
;;   (if window-system
;;       (progn
;;      (if (> (x-display-pixel-width) 1500) ;; 1500 is the delimiter marging in px to consider the screen big
;;          (set-frame-width (selected-frame) 237) ;; on the big screen make the fram 237 columns big
;;        (set-frame-width (selected-frame) 177)) ;; on the small screen we use 177 columns
;;      (setq my-height (/ (- (x-display-pixel-height) 150) ;; cut 150 px of the screen height and use the rest as height for the frame
;;                         (frame-char-height)))
;;      (set-frame-height (selected-frame) my-height)
;;      (set-frame-position (selected-frame) 3 90) ;; position the frame 3 pixels left and 90 px down
;;      )))

;; (set-frame-size-according-to-resolution)
;;  (global-set-key (kbd "C-x 9") 'set-frame-size-according-to-resolution)

(defun open-in-largest-window()
  "Open current buffer in largest window"
  (interactive)
  (let ((oldbuf (current-buffer)))
    (select-window (get-largest-window))
    (switch-to-buffer oldbuf))
  )
;;(global-set-key (kbd "C-x 5") 'open-in-largest-window)

(defun gitg ()
