config.org
** 檔案處理
*** find-files
#+begin_src emacs-lisp
  (defun find-files (files)
    "Open the given files"
    (interactive)
    (foreach (f files) (find-file f)))
#+end_src
*** my-clone-and-open-file
#+begin_src emacs-lisp
  (defun my-clone-and-open-file (filename)
    "Clone the current buffer writing it into FILENAME and open it"
    (interactive "FClone to file: ")
    (save-restriction
      (widen)
      (write-region (point-min) (point-max) filename nil nil nil 'confirm))
    (find-file filename))
#+end_src
** 視窗
*** 將整個 emacs 全螢幕
#+begin_src emacs-lisp
  (defun fullscreen-window ()
    "Make the window full-screen."
    (interactive)
    (let ((current-value (frame-parameter nil 'fullscreen))
          (old-value nil))
      (set-frame-parameter nil 'fullscreen
                           (if (equal 'fullboth current-value)
                               'old-value
                             (progn
                               (setq old-value current-value)
                               'fullboth)))))
#+end_src
#+begin_src emacs-lisp
  (defun collapse-or-expand ()
    (interactive)
    (if (> (length (window-list)) 1)
        (delete-other-windows)
      (bury-buffer)))
#+end_src
#+begin_src emacs-lisp
  (defun gitg ()
    "Launch gitg in the current directory."
    (interactive)
    (start-process "gitg" nil "gitg"))


  (defun windmove-down-fullscreen ()
    "Select window below current one and make it fullscreen."
    (interactive)
    (if (windmove-down)
        (delete-other-windows)))

  (defun windmove-up-fullscreen ()
    "Select window above the current one and make it fullscreen."
    (interactive)
    (if (windmove-up)
        (delete-other-windows)))

  (defun windmove-left-fullscreen ()
    "Select window left to current one and make it fullscreen."
    (interactive)
    (if (windmove-left)
        (delete-other-windows)))

  (defun windmove-right-fullscreen ()
    "Select window right to current one and make it fullscreen."
    (interactive)
    (if (windmove-right)
        (delete-other-windows)))

  (defun sudo-edit (&optional arg)
    "Edit file with sudo in emacs"
    (interactive "p")
    (if (or arg (not buffer-file-name))
        ;; (find-file (concat "/sudo:root@localhost:" (anything-read-file-name "File: ")))
        (find-file (concat "/sudo:root@localhost:" (read-file-name "File: ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

(setq tramp-debug-buffer t)
(setq tramp-chunksize 500)


  (defun toggle-selective-display (column)
    (interactive "P")
    (set-selective-display
     (if selective-display nil (or column 1))))

  ;;;; ---------------------------------------------------------------------------
  ;;;; Insert
  ;;; ---------------------------------------------------------------------------
  (require 'mm-url)

  (defun insert-tinyurl (url)
    "Insert a shortend URL at point by passed in URL"
    (interactive "sEnter url: " )
    (let* ((url (replace-regexp-in-string "^http://" "" url))
           (tinyurl
            (save-excursion
              (with-temp-buffer
                (mm-url-insert
                 (concat "http://tinyurl.com/api-create.php?url=http://" url))
                (kill-ring-save (point-min) (point-max))
                (buffer-string)))))
      (insert tinyurl)))

  ;;;; ---------------------------------------------------------------------------
  ;;;; Search
  ;;;; ---------------------------------------------------------------------------
  (defun multi-occur-in-this-mode ()
    "Show all lines matching REGEXP in buffers with this major mode."
    (interactive)
    (multi-occur
     (get-buffers-matching-mode major-mode)
     (car (occur-read-primary-args)))
    (select-window (get-buffer-window "*Occur*")))

  ;;;; ---------------------------------------------------------------------------
  ;;;; key-macro
  ;;;; ---------------------------------------------------------------------------
  (defun toggle-kbd-macro-recording-on ()
    "One-key keyboard macros: turn recording on."
    (interactive)
    (define-key
      global-map
      (this-command-keys)
      'toggle-kbd-macro-recording-off)
    (start-kbd-macro nil))

  (defun toggle-kbd-macro-recording-off ()
    "One-key keyboard macros: turn recording off."
    (interactive)
    (define-key
      global-map
      (this-command-keys)
      'toggle-kbd-macro-recording-on)
    (end-kbd-macro))

  ;;;; ---------------------------------------------------------------------------
  ;;;; Commands that define for key-chord
  ;;;; ---------------------------------------------------------------------------
  (defun upcase-word-backward ()
    "upcase word backward."
    (interactive)
    (upcase-word -1))

  (defun downcase-word-backward ()
    "downcase word backward."
    (interactive)
    (downcase-word -1))

  (defun capitalize-word-backward ()
    "captialize word backward."
    (interactive)
    (capitalize-word -1))

  (defun backward-kill-line (arg)
    "Kill chars backward until encountering the end of a line."
    (interactive "p")
    (kill-line 0))
#+end_src
** 插入
*** 插入時間
#+begin_src emacs-lisp
  (defun insert-date-time ()
    "Insert current-date."
    (interactive)
    (insert (current-date-time)))
#+end_src
*** 插入空白行
#+begin_src emacs-lisp
  (defun insert-empty-line ()
    "Insert an empty line after current line and position cursor on newline."
    (interactive)
    (move-end-of-line nil)
    (open-line 1)
    (next-line 1))
#+end_src
*** 多次貼上
emacs 本身的 yank 命令是無法使用 universla-argument 的，
也就是說無法使用 C-u 80 C-y 來貼上複製的東西 80 次，
而是貼上前幾次紀錄在 kill-ring 的資訊。

yank-n-times 則可以重複的進行貼上。

當沒有使用 universal-argument 指定要貼上多少次時，
會使用 prompt 詢問貼上的次數。
#+begin_src emacs-lisp
  (defun yank-n-times (&optional arg)
    "yank multiple times."
    (interactive "P")
    (let ((times (if (equal current-prefix-arg nil)
                     (read-number "yank repet times: ")
                   arg)))
      (if (< times 1)
          (setq times 1)
        (dotimes 'times (yank)))))
#+end_src
** 刪除
*** 刪除相對應的括號
#+begin_src emacs-lisp
  (defun delete-between-pair (char)
    "Delete in between the given pair"
    (interactive "cDelete between pair: ")
    (let ((pair-char))
      (search-backward-to-char char)
      (forward-char 1)
      (cond
       ((char-equal char ?\() (setq pair-char ?\)))
       ((char-equal char ?\") (setq pair-char ?\"))
       ((char-equal char ?\') (setq pair-char ?\'))
       ((char-equal char ?\[) (setq pair-char ?\]))
       ((char-equal char ?\{) (setq pair-char ?\}))
       ((char-equal char ?\<) (setq pair-char ?\>)))
      (zap-up-to-char 1 pair-char)))
#+end_src

*** 刪除一個 '字'
#+begin_src emacs-lisp
  (defun delete-word (arg)
    "Delete characters forward until encountering the end of a word.
  With argument, do this that many times."
    (interactive "p")
    (delete-region (point) (progn (forward-word arg) (point))))

#+end_src

*** 向左刪除一個 '字'
#+begin_src emacs-lisp
  (defun backward-delete-word (arg)
    "Delete characters backward until encountering the end of a word.
  With argument, do this that many times."
    (interactive "p")
    (delete-word (- arg)))
#+end_src
*** 刪除目前的檔案與 buffer
#+begin_src emacs-lisp
  (defun delete-file-and-buffer ()
    "Kills the current buffer and deletes the file it is visiting"
    (interactive)
    (let ((filename (buffer-file-name)))
      (when filename
        (delete-file filename)
        (message "Deleted file %s" filename)))
    (kill-buffer))
#+end_src
** 轉換
*** 將 unix 格式的文件轉換成 dos 格式
#+begin_src emacs-lisp
  (defun unix2dos ()
    "Convert buffer file from unix file to dos file."
    (interactive)
    (unix->dos (current-buffer)))
#+end_src
*** 將 dos 格式的文件轉換成 unix 格式
#+begin_src emacs-lisp
  (defun dos2unix ()
    "Convert buffer file from dos file to unix file."
    (interactive)
    (dos->unix (current-buffer)))
#+end_src
*** 將 buffer 的編碼改成 utf8
#+begin_src emacs-lisp
  (defun encode-to-utf8 ()
    "Sets the buffer-file-coding-system to UTF8."
    (interactive)
    (set-buffer-file-coding-system 'utf-8 nil))
#+end_src
*** eval-and-replace
將前面的 sexp 刪除並進行 eval 的動作，如果 eval 失敗則還原前面的 sexp。
#+begin_src emacs-lisp
  (defun eval-and-replace ()
    "Replace the preceding sexp with its value."
    (interactive)
    (backward-kill-sexp)
    (condition-case nil
        (prin1 (eval (read (current-kill 0)))
               (current-buffer))
      (error (message "Invalid expression")
             (insert (current-kill 0)))))
#+end_src
*** expand-last-sexp
#+begin_src emacs-lisp
  (defun expand-last-sexp ()
    "Expand macro from sexp before point;print value in pp eval buffer"
    (interactive)
    (pp-eval-expression '(macroexpand (read (thing-at-point 'sexp)))))
#+end_src
* Google 翻譯
google-translate 套件提供 emacs 透過 google 的 API 進行翻譯的動作。
** 載入相關套件
#+begin_src emacs-lisp
  (require* 'google-translate)
#+end_src
** 預設設定為 正體中文 -> 英文
#+begin_src emacs-lisp
(setq google-translate-default-source-language "zh-TW")
(setq google-translate-default-target-language "en")
#+end_src
** 命令
#+begin_src emacs-lisp
  (defun google-translate-en-zh ()
    "Translate English to Tranditional Chinese by google-translate."
    (interactive)
    (let ((google-translate-default-source-language "en")
          (google-translate-default-target-language "zh-TW"))
      (google-translate-query-translate)))

  (defun google-translate-zh-en ()
    "Translate Tranditional Chinese to English by google-translate."
    (interactive)
    (let ((google-translate-default-source-language "zh-TW")
          (google-translate-default-target-language "en"))
      (google-translate-query-translate)))
#+end_src
* Tramp                                                               :tramp:
#+begin_src emacs-lisp
  (setq tramp-default-method "ssh")
  (add-to-list 'tramp-default-method-alist
               '("\\`localhost\\'" "\\`root\\'" "su"))
#+end_src
** Remote sudo access with tramp
#+begin_src emacs-lisp
  (add-to-list 'tramp-default-proxies-alist
               '(nil "\\`root\\'" "/ssh:%h:"))
  (add-to-list 'tramp-default-proxies-alist
               '((regexp-quote (system-name)) nil nil))
#+end_src
* 聊天室                                                               :chat:
** IRC
emacs 底下最常用的 IRC 軟體為 ERC 和 RCIRC，以下是這兩種環境的設置。
*** ERC
