config.el
  "Launch gitg in the current directory."
  (interactive)
  (start-process "gitg" nil "gitg"))

(defun fullscreen-window ()
  "Make the window full-screen."
  (interactive)
  (let ((current-value (frame-parameter nil 'fullscreen))
        (old-value nil))
    (set-frame-parameter nil 'fullscreen
                         (if (equal 'fullboth current-value)
                             'old-value
                           (progn
                             (setq old-value current-value)
                             'fullboth)
                           ))))

(defun windmove-down-fullscreen ()
  "Select window below current one and make it fullscreen."
  (interactive)
  (if (windmove-down)
      (delete-other-windows)))

(defun windmove-up-fullscreen ()
  "Select window above the current one and make it fullscreen."
  (interactive)
  (if (windmove-up)
      (delete-other-windows)))

(defun windmove-left-fullscreen ()
  "Select window left to current one and make it fullscreen."
  (interactive)
  (if (windmove-left)
      (delete-other-windows)))

(defun windmove-right-fullscreen ()
  "Select window right to current one and make it fullscreen."
  (interactive)
  (if (windmove-right)
      (delete-other-windows)))

(defun sudo-edit (&optional arg)
  "Edit file with sudo in emacs"
  (interactive "p")
  (if (or arg (not buffer-file-name))
      ;; (find-file (concat "/sudo:root@localhost:" (anything-read-file-name "File: ")))
      (find-file (concat "/sudo:root@localhost:" (read-file-name "File: ")))
    (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

;;;; ---------------------------------------------------------------------------
;;;; Buffer
;;;; ---------------------------------------------------------------------------
(defun save-buffer-always ()
  "Save the buffer even if it is not modified."
  (interactive)
  (set-buffer-modified-p t)
  (save-buffer))

(defun toggle-selective-display (column)
  (interactive "P")
  (set-selective-display
   (if selective-display nil (or column 1))))

;;;; ---------------------------------------------------------------------------
;;;; Insert
;;; ---------------------------------------------------------------------------
(require 'mm-url)

(defun insert-tinyurl (url)
  "Insert a shortend URL at point by passed in URL"
  (interactive "sEnter url: " )
  (let* ((url (replace-regexp-in-string "^http://" "" url))
         (tinyurl
          (save-excursion
            (with-temp-buffer
              (mm-url-insert
               (concat "http://tinyurl.com/api-create.php?url=http://" url))
              (kill-ring-save (point-min) (point-max))
              (buffer-string)))))
    (insert tinyurl)))

;;;; ---------------------------------------------------------------------------
;;;; Date
;;;; ---------------------------------------------------------------------------


;;;; ---------------------------------------------------------------------------
;;;; Search
;;;; ---------------------------------------------------------------------------
(defun multi-occur-in-this-mode ()
  "Show all lines matching REGEXP in buffers with this major mode."
  (interactive)
  (multi-occur
   (get-buffers-matching-mode major-mode)
   (car (occur-read-primary-args)))
  (select-window (get-buffer-window "*Occur*")))

;;;; ---------------------------------------------------------------------------
;;;; Delete
;;;; ---------------------------------------------------------------------------
(defun delete-word (arg)
  "Delete characters forward until encountering the end of a word.
With argument, do this that many times."
  (interactive "p")
  (delete-region (point) (progn (forward-word arg) (point))))

(defun backward-delete-word (arg)
  "Delete characters backward until encountering the end of a word.
With argument, do this that many times."
  (interactive "p")
  (delete-word (- arg)))

;;;; ---------------------------------------------------------------------------
;;;; key-macro
;;;; ---------------------------------------------------------------------------
(defun toggle-kbd-macro-recording-on ()
  "One-key keyboard macros: turn recording on."
  (interactive)
  (define-key
    global-map
    (this-command-keys)
    'toggle-kbd-macro-recording-off)
  (start-kbd-macro nil))

(defun toggle-kbd-macro-recording-off ()
  "One-key keyboard macros: turn recording off."
  (interactive)
  (define-key
    global-map
    (this-command-keys)
    'toggle-kbd-macro-recording-on)
  (end-kbd-macro))

;;;; ---------------------------------------------------------------------------
;;;; Commands that define for key-chord
;;;; ---------------------------------------------------------------------------
(defun upcase-word-backward ()
  "upcase word backward."
  (interactive)
  (upcase-word -1))

(defun downcase-word-backward ()
  "downcase word backward."
  (interactive)
  (downcase-word -1))

(defun capitalize-word-backward ()
  "captialize word backward."
  (interactive)
  (capitalize-word -1))

(defun backward-kill-line (arg)
  "Kill chars backward until encountering the end of a line."
  (interactive "p")
  (kill-line 0))

(defun insert-empty-line ()
  "Insert an empty line after current line and position cursor on newline."
  (interactive)
  (move-end-of-line nil)
  (open-line 1)
  (next-line 1))

(defun insert-date-time ()
  "Insert current-date."
  (interactive)
  (insert (current-date-time)))

(defun unix2dos ()
  "Convert buffer file from unix file to dos file."
  (interactive)
  (unix->dos (current-buffer)))

(defun dos2unix ()
  "Convert buffer file from dos file to unix file."
  (interactive)
  (dos->unix (current-buffer)))

(require 'erc)
(require 'erc-log)
