config.org
**** 載入相依套件
#+begin_src emacs-lisp
  (require 'erc)
  (require 'erc-notify)
  (require 'erc-spelling)
  (require 'erc-autoaway)
#+end_src
**** 設定 prompt
#+begin_src emacs-lisp
  (setq erc-prompt ">>")
#+end_src
**** 編碼設定為 utf-8
#+begin_src emacs-lisp
  (setq erc-server-coding-system '(utf-8 . utf-8))
#+end_src
**** 當 ERC 啟動時，自動連入 IRC 伺服器
#+begin_src emacs-lisp
  (erc-autojoin-mode t)
#+end_src
**** 自動連線的伺服器與聊天室
#+begin_src emacs-lisp
  (setq erc-autojoin-channels-alist
        '(;; english channel
          (".*\\.freenode.net" "#emacs" "#lisp" "#clojure" "##linux" "#gentoo")
          ;; Chinese channel
          (".*\\.freenode.net" "#emacs.tw" "#tossug")
          (".*\\debian.org" "#dot")
          ))
#+end_src
**** 關閉部份訊息顯示
#+begin_src emacs-lisp
  (setq erc-hide-list '("JOIN" "PART" "QUIT"))
#+end_src
**** 加入時間戳
#+begin_src emacs-lisp
  (erc-timestamp-mode 1)
#+end_src
**** 紀錄聊天訊息
***** 載入相依套件
#+begin_src emacs-lisp
  (require 'erc-log)
#+end_src
***** 啟動 erc-log-mode
#+begin_src emacs-lisp
  (erc-log-mode 1)
#+end_src
***** 設定紀錄檔儲存位置
#+begin_src emacs-lisp
  (setq erc-log-channels-directory emacs-log-dir)
#+end_src
***** 如果儲存紀錄檔的資料夾不存在，建立他
#+begin_src emacs-lisp
  (unless (file-exists-p erc-log-channels-directory)
    (mkdir erc-log-channels-directory t))
#+end_src
***** 紀錄檔編碼為 utf-8
#+begin_src emacs-lisp
  (setq erc-log-file-coding-system 'utf-8)
#+end_src
***** 送出訊息後寫入到 log
#+begin_src emacs-lisp
  (setq erc-log-write-after-send t)
#+end_src
***** 當有新訊息時，寫入到log
#+begin_src emacs-lisp
  (setq erc-log-write-after-insert t)
#+end_src
**** 設定聊天時的行寬為 100
#+begin_src emacs-lisp
  (setq erc-fill-column 100)
#+end_src
**** 為聊天室裡的使用者暱稱上色
#+begin_src emacs-lisp
  (and
   (require 'erc-highlight-nicknames)
   (add-to-list 'erc-modules 'highlight-nicknames)
   (erc-update-modules))
#+end_src
**** Configs
***** Misc
#+begin_src emacs-lisp
  ;; check channels
  ;; exclude boring stuff from tracking
  (erc-track-mode t)
  (setq erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"

                                  "324" "329" "332" "333" "353" "477"))
  ;; Interpret mIRC-style color commands in IRC chats
  (setq erc-interpret-mirc-color t)
  ;; The following are commented out by default, but users of other
  ;; non-Emacs IRC clients might find them useful.
  ;; Kill buffers for channels after /part
  (setq erc-kill-buffer-on-part t)
  ;; Kill buffers for private queries after quitting the server
  (setq erc-kill-queries-on-quit t)
  ;; Kill buffers for server messages after quitting the server
  (setq erc-kill-server-buffer-on-quit t)
  ;; open query buffers in the current window
  (setq erc-query-display 'buffer)
  (setq erc-save-buffer-on-part t)
  (defadvice save-buffers-kill-emacs (before save-logs (arg) activate)
    (save-some-buffers t (lambda () (when (eq major-mode 'erc-mode) t))))
  ;; truncate long irc buffers
  (erc-truncate-mode +1)
  ;; enable spell checking
  (erc-spelling-mode 1)
  ;; autoaway setup
  (setq erc-auto-discard-away t)
  (setq erc-autoaway-idle-seconds 600)
  (setq erc-autoaway-use-emacs-idle t)
#+end_src
**** Commands
#+begin_src emacs-lisp
  (defun i-wanna-be-social ()
    "Connect to IM networks using bitlbee."
    (interactive)
    (erc :server "localhost" :port 6667 :nick "user"))
#+end_src
#+begin_src emacs-lisp
  (defun erc-cmd-WII (nick &rest ignore)
    "`/WHOIS' command with extra user information."
    (erc-send-command (mapconcat #'identity
                                 (list "WHOIS" nick nick) " ")))
  (defun erc-cmd-IDENTIFY (password &rest ignore)
    "Short-hand alias for `/msg NickServ identify PASS'."
    (erc-send-command (mapconcat #'identity
                                 (list "identify" password) " ")))
  (defun erc-cmd-CS (&rest args)
    "Short alias for `/chanserv ARGS'."
    (let ((command-args (append (list "CHANSERV") args)))
      (let ((chanserv-command (mapconcat #'identity command-args " ")))
        (erc-send-command chanserv-command))))

  (defun erc-cmd-MS (&rest args)
    "Short alias for `/memoserv ARGS'."
    (let ((command-args (append (list "MEMOSERV") args)))
      (let ((memoserv-command (mapconcat #'identity command-args " ")))
        (erc-send-command memoserv-command))))

  (defun erc-cmd-NS (&rest args)
    "Short alias for `/nickserv ARGS'."
    (let ((command-args (append (list "NICKSERV") args)))
      (let ((nickserv-command (mapconcat #'identity command-args " ")))
        (erc-send-command nickserv-command))))
#+end_src
**** Function
#+begin_src emacs-lisp
(defun avoid-erc-oops (txt)
  (when (member txt '("ls" "xb" "cd"))
      (setq erc-send-this nil)))

(add-to-list 'erc-send-pre-hook 'avoid-erc-oops)
#+end_src
**** Command
#+begin_src emacs-lisp
  (defun irc ()
    (interactive)
    (erc :server "irc.freenode.net" :port 6667 :nick erc-nick)
    (erc :server "irc.debian.org" :port 6667 :nick erc-nick))
#+end_src
*** RCIRC
:PROPERTIES:
:tangle: no
:END:
這邊是以前所使用的 rcirc 設定，由於我改用 erc 作為我的 irc client，這邊的設定將不輸出至
我的 emacs 設定。
**** 載入相依套件
#+begin_src emacs-lisp
  (require 'rcirc)
#+end_src
**** Config
#+begin_src emacs-lisp
  ;; for debugging.
  (setq rcirc-debug-flag t)
  ;; Include date in time stamp.
  (setq rcirc-time-format "%Y-%m-%d %H:%M ")
  ;; Enable Logging rcirc
  (setq rcirc-log-flag t)
  ;; Put logs in this directory
  (setq rcirc-log-directory "~/.emacs.d/var/log/rcirc/")
  ;;
  (setq rcirc-notify-open t)
  ;;
  (setq rcirc-notify-timeout 1)
  ;;
  (setq rcirc-omit-responses '("JOIN" "PART" "QUIT" "NICK" "AWAY" "MODE"))
  ;; Prompt Settings
  (setq rcirc-prompt " %n  >> ")
  ;; Do not show on modline
  (setq rcirc-track-minor-mode nil)

  ;; Join these channels at startup.
  (setq rcirc-server-alist
        '(
          ("irc.freenode.net" :channels  ("#emacs" "#lisp" "##linux" "#gentoo"    ; english channel
                                          "#tossug" "#gentoo-tw" "#python.tw" "#ubuntu-tw"))
          ("irc.debian.org" :channels ("#dot"))
          ))
#+end_src
**** Hooks
#+begin_src emacs-lisp
  (add-hook 'rcirc-mode-hook
            '(lambda ()
               ;; Keep input line at bottom.
               (set (make-local-variable 'scroll-conservatively) 8192)
               ;; Use Omit-mode
               (rcirc-omit-mode)
               ))
#+end_src
**** Commands
#+begin_src emacs-lisp
  (defun-rcirc-command all (input)
    "Run the arguments as a command for all connections.
         Example use: /all away food or /all quit zzzz."
    (interactive "s")
    (let ((buffers (mapcar 'process-buffer (rcirc-process-list))))
      (dolist (buf buffers)
        (with-current-buffer buf
          (goto-char (point-max))
          (insert "/" input)
          (rcirc-send-input)))))

  (defun-rcirc-command calc (input)
    "calculate value of some expression using bc"
    (let ((expr (mapconcat 'identity args " ")))
      (when (length expr)
        (let ((result (shell-command-to-string (concat "echo '" expr "' | bc ")))
              (when result (rcirc-send-message (concat expr " = " result))))))))
#+end_src
**** Fix
不顯示任何 /away 訊息。
#+begin_src emacs-lisp
  (defun rcirc-handler-301 (process cmd sender args)
    "/away message handler.")
#+end_src

** Jabber
*** 載入相依套件
#+begin_src emacs-lisp
  (require 'jabber)
#+end_src
* Alias                                                               :alias:
** git
和 git 相關的命令的 alias。
#+begin_src emacs-lisp
  (defalias 'git-log    'egg-log)
  (defalias 'git-status 'egg-status)
  (defalias 'git-rebase 'magit-rebase-step)
  (defalias 'git-push   'magit-push)
  (defalias 'git-commit 'egg-commit-log-edit)
#+end_src
** Misc
#+begin_src emacs-lisp
  (defalias 'coldnew/set-mark-command 'cua-set-mark-or-rectangle-mark)
  (defalias 'coldnew/folding-toggle   'toggle-selective-display)
  (defalias 'iwb 'indent-whole-buffer)
#+end_src
* 版本管理
**  Git
*** egg
**** Depends
#+begin_src emacs-lisp
  (require 'egg)
#+end_src
**** Config
#+begin_src emacs-lisp
  ;; do not auto-update egg-status on file save
  (setq egg-auto-update nil)

  ;; do not switch to the status buffer in the same window
  (setq egg-switch-to-buffer t)

  ;; make egg auto guess next action
  (setq egg-confirm-next-action nil)

  ;; remodify next-action priority
  (defsubst egg-guess-next-action (desc)
    (cond
     ((memq :file-has-merged-conflict desc) :merge-file)
     ((memq :file-is-modified desc)         :stage-file)
     ((memq :has-staged-changes desc)       :commit)
     ((memq :file-is-unmerged desc)         :stage-file)
     ((memq :wdir-has-merged-conflict desc) :status)
     ((memq :wdir-has-unmerged-files  desc) :stage-all)
     ((memq :wdir-is-modified desc)         :stage-all)
     ((memq :rebase-in-progress desc)       :rebase-continue)
     (t                                     :quit)))
#+end_src
**** Keybinding
#+begin_src emacs-lisp :tangle no
  (add-hook 'egg-commit-buffer-mode-hook
            '(lambda ()
               (define-key coldnew/command-mode-map "c" 'egg-log-msg-done)
               ))

#+end_src
**** Advice                                                       :advice:
當進入 egg-status 或是 egg-commit-log-edit 時，關掉其他 window。
#+begin_src emacs-lisp
  (defadvice egg-status (around goto-egg-status-buffer activate)
    "Delete other windows after visiting egg-status."
    ad-do-it
    (delete-other-windows))

  (defadvice egg-commit-log-edit (around goto-egg-commit-buffer activate)
    "Delete other windows after visiting egg-commit-buffer."
    ad-do-it
    (delete-other-windows))
#+end_src
*** magit
#+begin_src emacs-lisp
  ;;;;;;;; Magit
  (require 'magit)
  ;; if use magit, do not use vc-git to handle Git interface.
  ;; (when (featurep 'magit)
  ;;   (setq vc-handled-backends (remq 'Git vc-handled-backends)))
#+end_src
**** Magit 的使用
每個 magit buffer
*** git-emacs
#+begin_src emacs-lisp
  (require 'git-emacs)
  ;;   ;; disable git-emacs's advice
  ;;   (ad-disable-advice 'vc-next-action 'around 'git--vc-git-next-action)
  ;;   (ad-activate 'vc-next-action)
  (define-key git--branch-mode-map (kbd "C-g") 'git--quit-buffer)
#+end_src
* Hooks                                                               :hook:
