config.el
(require 'erc-notify)
(require 'erc-spelling)
(require 'erc-autoaway)

(setq erc-prompt ">>")

(setq erc-server-coding-system '(utf-8 . utf-8))

;; make sure to use wildcards for e.g. freenode as the actual server
;; name can be be a bit different, which would screw up autoconnect
(erc-autojoin-mode t)
(setq erc-autojoin-channels-alist
      '((".*\\.freenode.net" "#emacs"  "#clojure")
        ))

;; check channels
;; exclude boring stuff from tracking
(erc-track-mode t)
(setq erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"

                                "324" "329" "332" "333" "353" "477"))
;; don't show any of this
(setq erc-hide-list '("JOIN" "PART" "QUIT" "NICK"))
;; Interpret mIRC-style color commands in IRC chats
(setq erc-interpret-mirc-color t)
;; The following are commented out by default, but users of other
;; non-Emacs IRC clients might find them useful.
;; Kill buffers for channels after /part
(setq erc-kill-buffer-on-part t)
;; Kill buffers for private queries after quitting the server
(setq erc-kill-queries-on-quit t)
;; Kill buffers for server messages after quitting the server
(setq erc-kill-server-buffer-on-quit t)
;; open query buffers in the current window
(setq erc-query-display 'buffer)
;; logging
(setq erc-log-channels-directory "~/.erc/logs/")
(if (not (file-exists-p erc-log-channels-directory))
    (mkdir erc-log-channels-directory t))
(setq erc-save-buffer-on-part t)
(defadvice save-buffers-kill-emacs (before save-logs (arg) activate)
  (save-some-buffers t (lambda () (when (eq major-mode 'erc-mode) t))))
;; truncate long irc buffers
(erc-truncate-mode +1)
;; enable spell checking
(erc-spelling-mode 1)
;; autoaway setup
(setq erc-auto-discard-away t)
(setq erc-autoaway-idle-seconds 600)
(setq erc-autoaway-use-emacs-idle t)

(defun i-wanna-be-social ()
  "Connect to IM networks using bitlbee."
  (interactive)
  (erc :server "localhost" :port 6667 :nick "user"))

(defun erc-cmd-WII (nick &rest ignore)
  "`/WHOIS' command with extra user information."
  (erc-send-command (mapconcat #'identity
                               (list "WHOIS" nick nick) " ")))
(defun erc-cmd-IDENTIFY (password &rest ignore)
  "Short-hand alias for `/msg NickServ identify PASS'."
  (erc-send-command (mapconcat #'identity
                               (list "identify" password) " ")))
(defun erc-cmd-CS (&rest args)
  "Short alias for `/chanserv ARGS'."
  (let ((command-args (append (list "CHANSERV") args)))
    (let ((chanserv-command (mapconcat #'identity command-args " ")))
      (erc-send-command chanserv-command))))

(defun erc-cmd-MS (&rest args)
  "Short alias for `/memoserv ARGS'."
  (let ((command-args (append (list "MEMOSERV") args)))
    (let ((memoserv-command (mapconcat #'identity command-args " ")))
      (erc-send-command memoserv-command))))

(defun erc-cmd-NS (&rest args)
  "Short alias for `/nickserv ARGS'."
  (let ((command-args (append (list "NICKSERV") args)))
    (let ((nickserv-command (mapconcat #'identity command-args " ")))
      (erc-send-command nickserv-command))))

(require 'jabber)

(defalias 'git-log    'egg-log)
(defalias 'git-status 'egg-status)
(defalias 'git-rebase 'magit-rebase-step)
(defalias 'git-push   'magit-push)
(defalias 'git-commit 'egg-commit-log-edit)

(defalias 'coldnew/set-mark-command 'cua-set-mark-or-rectangle-mark)
(defalias 'coldnew/folding-toggle   'toggle-selective-display)

(require 'egg)

;; do not auto-update egg-status on file save
(setq egg-auto-update nil)

;; do not switch to the status buffer in the same window
(setq egg-switch-to-buffer t)

;; make egg auto guess next action
(setq egg-confirm-next-action nil)

;; remodify next-action priority
(defsubst egg-guess-next-action (desc)
  (cond
   ((memq :file-has-merged-conflict desc) :merge-file)
   ((memq :file-is-modified desc)         :stage-file)
   ((memq :has-staged-changes desc)       :commit)
   ((memq :file-is-unmerged desc)         :stage-file)
   ((memq :wdir-has-merged-conflict desc) :status)
   ((memq :wdir-has-unmerged-files  desc) :stage-all)
   ((memq :wdir-is-modified desc)         :stage-all)
   ((memq :rebase-in-progress desc)       :rebase-continue)
   (t                                     :quit)))

(add-hook 'egg-commit-buffer-mode-hook
          '(lambda ()
             (define-key coldnew/command-mode-map "c" 'egg-log-msg-done)
             ))

(defadvice egg-status (around goto-egg-status-buffer activate)
  "Delete other windows after visiting egg-status."
  ad-do-it
  (delete-other-windows))

(defadvice egg-commit-log-edit (around goto-egg-commit-buffer activate)
  "Delete other windows after visiting egg-commit-buffer."
  ad-do-it
  (delete-other-windows))

;;;;;;;; Magit
(require 'magit)
;; if use magit, do not use vc-git to handle Git interface.
;; (when (featurep 'magit)
;;   (setq vc-handled-backends (remq 'Git vc-handled-backends)))

(require 'git-emacs)
;;   ;; disable git-emacs's advice
;;   (ad-disable-advice 'vc-next-action 'around 'git--vc-git-next-action)
;;   (ad-activate 'vc-next-action)
(define-key git--branch-mode-map (kbd "C-g") 'git--quit-buffer)
