config.org
** find-file-hook
#+begin_src emacs-lisp
  ;; Auto add HEADER in new file
  (add-hook 'find-file-hook
            '(lambda ()
               (when (and (buffer-file-name)
                          (not (file-exists-p (buffer-file-name)))
                          (= (point-max) 1))
                 (let ((header-snippet "HEADER")
                       (yas/fallback-behavior 'return-nil))
                   (insert header-snippet)
                   ;; if can't expand snippet, clear whole buffer
                   (if (not (yas/expand))
                       (delete-region (point-min) (point-max)))))))
#+end_src

** before-save-hook
#+begin_src emacs-lisp
  ;; If save a newfile to nonexist directory, create the directory before save.
  (add-hook 'before-save-hook
            '(lambda ()
               (or (file-exists-p  (file-name-directory buffer-file-name))
                   (make-directory (file-name-directory buffer-file-name) t))))
#+end_src
* 檔案備份
#+begin_src emacs-lisp
  (setq auto-save-interval  50)           ; Number of input events between auto-saves
  (setq auto-save-timeout   30)           ; Number of seconds idle time before auto-save
  (setq auto-save-visited-file-name t)    ; auto-save buffer in the file it is visiting
  (setq delete-by-moving-to-trash nil)    ; delete file don't use system's trash can
  (setq delete-auto-save-files      t)    ; delete auto-save file when bffer is saved or killed
  (setq auto-save-default    t)           ; auto-save of every file-visiting buffer

  ;; if emacs-backup-dir does not exist, create it
  (if (not (file-exists-p emacs-backup-dir))
      (make-directory emacs-backup-dir t))

  (setq backup-directory-alist `(("." . ,emacs-backup-dir)))
  (setq version-control      t )          ; enable version-control
  (setq backup-by-copying    t )          ; backup by copy
  (setq kept-old-versions   10 )          ; keep 10 old-version
  (setq kept-new-versions   20 )          ; keep 20 new-version
  (setq delete-old-versions  t )          ; delete non-of-above version

  ;; change auto-save-list setting
  (setq auto-save-list-file-prefix (concat emacs-backup-dir "auto-saves-"))
  (setq auto-save-file-name-transforms `((".*"  ,emacs-backup-dir)))
#+end_src
* 多媒體                                                               :emms:
:PROPERTIES:
:tangle: no
:END:
使用 emacs 聽音樂。
** 預先載入套件
#+begin_src emacs-lisp
  (require 'emms-setup)
#+end_src
** 選用開發中的 emms 功能
啟用 emms 所有穩定版的功能。
在 emms-setup 裡面，emms 提供了 minimalistic、tandard、all 以及包含各種含在測試中的外掛。
選擇 all 啟用了所有穩定版本的外掛，devel 是選用開發中的外掛。
#+begin_src emacs-lisp
  (emms-devel)
#+end_src
** 自動根據音樂檔的 id3 Tag 進行語言解碼
#+begin_src emacs-lisp
  (require 'emms-i18n)
#+end_src
** 設定 emms 所使用的播放器
emms-setup 提供了 emms-default-players 這個函數來簡化播放器的設定，
這邊重新設定我所需要使用的多媒體播放程式。
#+begin_src emacs-lisp
  (setq emms-player-list '(emms-player-mpg321
                           ;;emms-player-ogg123
                           emms-player-mplayer-playlist
                           emms-player-mplayer
                           emms-player-vlc
                           ))
#+end_src
** 設定預設的音樂資料夾路徑
#+begin_src emacs-lisp

#+end_src
** 播放清單設置
#+begin_src emacs-lisp
  (setq emms-playlist-buffer-name "*EMMS Playlist*"
        emms-playlist-mode-open-playlists t)

  (require 'emms-info-libtag)
  (setq emms-info-functions '(emms-info-libtag))

  (setq xwl-emms-playlist-last-track nil)
  (setq xwl-emms-playlist-last-indent "\\")

  (defun xwl-emms-track-description-function (track)
    "Return a description of the current track."
    (let* ((name (emms-track-name track))
           (type (emms-track-type track))
           (short-name (file-name-nondirectory name))
           (play-count (or (emms-track-get track 'play-count) 0))
           (last-played (or (emms-track-get track 'last-played) '(0 0 0)))
           (empty "..."))
      (prog1
          (case (emms-track-type track)
            ((file url)
             (let* ((artist (or (emms-track-get track 'info-artist) empty))
                    (year (emms-track-get track 'info-year))
                    (playing-time (or (emms-track-get track 'info-playing-time) 0))
                    (min (/ playing-time 60))
                    (sec (% playing-time 60))
                    (album (or (emms-track-get track 'info-album) empty))
                    (tracknumber (emms-track-get track 'info-tracknumber))
                    (short-name (file-name-sans-extension
                                 (file-name-nondirectory name)))
                    (title (or (emms-track-get track 'info-title) short-name))

                    ;; last track
                    (ltrack xwl-emms-playlist-last-track)
                    (lartist (or (and ltrack (emms-track-get ltrack 'info-artist))
                                 empty))
                    (lalbum (or (and ltrack (emms-track-get ltrack 'info-album))
                                empty))

                    (same-album-p (and (not (string= lalbum empty))
                                       (string= album lalbum))))
               (format "%10s  %3d   %-20s%-60s%-35s%-15s%s"
                       (emms-last-played-format-date last-played)
                       play-count
                       artist

                       ;; Combine indention, tracknumber, title.
                       (concat
                        (if same-album-p ; indention by album
                            (setq xwl-emms-playlist-last-indent
                                  (concat " " xwl-emms-playlist-last-indent))
                          (setq xwl-emms-playlist-last-indent "\\")
                          "")
                        (if (and tracknumber ; tracknumber
                                 (not (zerop (string-to-number tracknumber))))
                            (format "%02d." (string-to-number tracknumber))
                          "")
                        title        ; title
                        )

                       ;; album
                       (cond ((string= album empty) empty)
                             ;; (same-album-p "  ")
                             (t (concat "《" album "》")))

                       (or year empty)
                       (if (or (> min 0)  (> sec 0))
                           (format "%02d:%02d" min sec)
                         empty))))
            ((url)
             (concat (symbol-name type) ":" name))
            (t
             (format "%-3d%s"
                     play-count
                     (concat (symbol-name type) ":" name))))
        (setq xwl-emms-playlist-last-track track))))

  (setq emms-track-description-function
        'xwl-emms-track-description-function)
#+end_src
* Session
** filecache
#+begin_src emacs-lisp
  (require 'filecache)
  ;; setup file-cache-filter-regexps
  (setq file-cache-filter-regexps
        '("~$" "\\.o$" "\\.exe$" "\\.a$" "\\.out$"  "\\.elc$"
          "\\.output$" "\\.$" "#$" "\\.class$" "\\.pyc$" "\\.png$" "\\.jpg$" "\\.gif$"
          "\\.svn$" "\\.svn-base$" "\\.git$" "\\.hg$"
          ))

  (file-cache-add-directory-list '("~/.emacs.d/" ))
#+end_src
** savehist
#+begin_src emacs-lisp
  (require 'savehist)
  ;; keep minibuffer history between session
  (setq savehist-file (concat emacs-cache-dir "savehist.dat"))
  (savehist-mode 1)
#+end_src
** saveplace
#+begin_src emacs-lisp
  (require 'saveplace)
  (setq save-place-file (concat emacs-cache-dir "saveplace.dat"))
  (setq-default save-place t)
#+end_src
** recentf
#+begin_src emacs-lisp
  (require 'recentf)
  (require 'recentf-ext)
  ;; Setting cache file for recentf
  (setq recentf-save-file (concat emacs-cache-dir "recentf"))
  ;; Following file won;t contain in recentf
  (setq recentf-exclude '("\\.elc$" "\\.pyc$" "\\.recentd$" "^/tmp/"))
#+end_src
** desktop
#+begin_src emacs-lisp
  (require 'desktop)
  (setq desktop-path (list emacs-cache-dir))
  (setq desktop-dirname emacs-cache-dir)
  (setq desktop-base-file-name "desktop.dat")
  (setq desktop-missing-file-warning nil)

  ;; Enable desktop
  (desktop-save-mode t)

  (defadvice desktop-owner (after pry-from-cold-dead-hands activate)
    "Don't allow dead emacsen to own the desktop file."
    (when (not (emacs-process-p ad-return-value))
      (setq ad-return-value nil)))

  (defun desktop-in-use? ()
    (and (file-exists-p desktop-base-file-name) (file-exists-p desktop-base-lock-name)))

  (defun autosave-desktop ()
    (if (desktop-in-use?) (desktop-save-in-desktop-dir)))

  ;; auto save desktop
  (add-hook 'after-init-hook
            (lambda ()
              (setq *desktop-saver-timer*
                    (run-with-timer 5 300 'autosave-desktop))))

  ;; Following modes are ignore and won't save to desktop
  (setq desktop-buffers-not-to-save
        (concat "\\("
                "^\\.a[0-9]+\\|\\.log\\|(ftp)\\|^tags\\|^TAGS"
                "\\|\\.diary\\|\\.newsrc-dribble\\|\\.bbdb"
                "\\)$"))

  (add-to-list 'desktop-modes-not-to-save 'fundamental-mode)
  (add-to-list 'desktop-modes-not-to-save 'dired-mode)
  (add-to-list 'desktop-modes-not-to-save 'Info-mode)
  (add-to-list 'desktop-modes-not-to-save 'info-lookup-mode)
  (add-to-list 'desktop-modes-not-to-save 'w3m-mode)
  (add-to-list 'desktop-modes-not-to-save 'view-mode)
#+end_src
* 游標                                                               :cursor:
