config.el

;; Auto add HEADER in new file
(add-hook 'find-file-hook
          '(lambda ()
             (when (and (buffer-file-name)
                        (not (file-exists-p (buffer-file-name)))
                        (= (point-max) 1))
               (let ((header-snippet "HEADER")
                     (yas/fallback-behavior 'return-nil))
                 (insert header-snippet)
                 ;; if can't expand snippet, clear whole buffer
                 (if (not (yas/expand))
                     (delete-region (point-min) (point-max)))))))

;; If save a newfile to nonexist directory, create the directory before save.
(add-hook 'before-save-hook
          '(lambda ()
             (or (file-exists-p  (file-name-directory buffer-file-name))
                 (make-directory (file-name-directory buffer-file-name) t))))

(setq auto-save-interval  50)           ; Number of input events between auto-saves
(setq auto-save-timeout   30)           ; Number of seconds idle time before auto-save
(setq auto-save-visited-file-name t)    ; auto-save buffer in the file it is visiting
(setq delete-by-moving-to-trash nil)    ; delete file don't use system's trash can
(setq delete-auto-save-files      t)    ; delete auto-save file when bffer is saved or killed
(setq auto-save-default    t)           ; auto-save of every file-visiting buffer

;; if emacs-backup-dir does not exist, create it
(if (not (file-exists-p emacs-backup-dir))
    (make-directory emacs-backup-dir t))

(setq backup-directory-alist `(("." . ,emacs-backup-dir)))
(setq version-control      t )          ; enable version-control
(setq backup-by-copying    t )          ; backup by copy
(setq kept-old-versions   10 )          ; keep 10 old-version
(setq kept-new-versions   20 )          ; keep 20 new-version
(setq delete-old-versions  t )          ; delete non-of-above version

;; change auto-save-list setting
(setq auto-save-list-file-prefix (concat emacs-backup-dir "auto-saves-"))
(setq auto-save-file-name-transforms `((".*"  ,emacs-backup-dir)))

(require 'filecache)
;; setup file-cache-filter-regexps
(setq file-cache-filter-regexps
      '("~$" "\\.o$" "\\.exe$" "\\.a$" "\\.out$"  "\\.elc$"
        "\\.output$" "\\.$" "#$" "\\.class$" "\\.pyc$" "\\.png$" "\\.jpg$" "\\.gif$"
        "\\.svn$" "\\.svn-base$" "\\.git$" "\\.hg$"
        ))

(file-cache-add-directory-list '("~/.emacs.d/" ))

(require 'savehist)
;; keep minibuffer history between session
(setq savehist-file (concat emacs-cache-dir "savehist.dat"))
(savehist-mode 1)

(require 'saveplace)
(setq save-place-file (concat emacs-cache-dir "saveplace.dat"))
(setq-default save-place t)

(require 'recentf)
(require 'recentf-ext)
;; Setting cache file for recentf
(setq recentf-save-file (concat emacs-cache-dir "recentf"))
;; Following file won;t contain in recentf
(setq recentf-exclude '("\\.elc$" "\\.pyc$" "\\.recentd$" "^/tmp/"))

(require 'desktop)
(setq desktop-path (list emacs-cache-dir))
(setq desktop-dirname emacs-cache-dir)
(setq desktop-base-file-name "desktop.dat")
(setq desktop-missing-file-warning nil)

;; Enable desktop
(desktop-save-mode t)

(defadvice desktop-owner (after pry-from-cold-dead-hands activate)
  "Don't allow dead emacsen to own the desktop file."
  (when (not (emacs-process-p ad-return-value))
    (setq ad-return-value nil)))

(defun desktop-in-use? ()
  (and (file-exists-p desktop-base-file-name) (file-exists-p desktop-base-lock-name)))

(defun autosave-desktop ()
  (if (desktop-in-use?) (desktop-save-in-desktop-dir)))

;; auto save desktop
(add-hook 'after-init-hook
          (lambda ()
            (setq *desktop-saver-timer*
                  (run-with-timer 5 300 'autosave-desktop))))

;; Following modes are ignore and won't save to desktop
(setq desktop-buffers-not-to-save
      (concat "\\("
              "^\\.a[0-9]+\\|\\.log\\|(ftp)\\|^tags\\|^TAGS"
              "\\|\\.diary\\|\\.newsrc-dribble\\|\\.bbdb"
              "\\)$"))

(add-to-list 'desktop-modes-not-to-save 'fundamental-mode)
(add-to-list 'desktop-modes-not-to-save 'dired-mode)
(add-to-list 'desktop-modes-not-to-save 'Info-mode)
(add-to-list 'desktop-modes-not-to-save 'info-lookup-mode)
(add-to-list 'desktop-modes-not-to-save 'w3m-mode)
(add-to-list 'desktop-modes-not-to-save 'view-mode)

(defvar emacs-normal-cursor-color "white")
(defvar emacs-normal-cursor-type 'bar)
