config.org
** TODO remove
#+begin_src emacs-lisp :tangle no
  (defvar emacs-normal-cursor-color "white")
  (defvar emacs-normal-cursor-type 'bar)

  (defvar emacs-read-only-cursor-color "gray")
  (defvar emacs-read-only-cursor-type 'box)

  (defvar emacs-overwrite-cursor-color "yellow")
  (defvar emacs-overwrite-cursor-type 'hbar)

  ;;;; ---------------------------------------------------------------------------
  ;;;; Hooks
  ;;;; ---------------------------------------------------------------------------
  (add-hook 'post-command-hook 'coldnew/set-cursor-according-mode)


  ;;;; ---------------------------------------------------------------------------
  ;;;; Functions
  ;;;; ---------------------------------------------------------------------------
  (defun coldnew/set-cursor-according-mode ()
    "change cursor shap and color according mode"
    (cond
     ((string= "Command" coldnew-editor-state)
      (setq cursor-type emacs-read-only-cursor-type)
      (setq cursor-color emacs-read-only-cursor-color))
     (buffer-read-only
      (setq cursor-type emacs-read-only-cursor-type)
      (setq cursor-color emacs-read-only-cursor-color))
     ;; (overwrite-mode
     ;;   (set-cursor-color djcb-overwrite-color)
     ;;   (setq cursor-type djcb-overwrite-cursor-type))
     (t
      (setq cursor-type emacs-normal-cursor-type)
      (setq cursor-color emacs-normal-cursor-color))))
#+end_src
** TODO remove
#+begin_src emacs-lisp
  (defvar emacs-normal-cursor-color "white")
  (defvar emacs-normal-cursor-type 'bar)
  (add-hook 'post-command-hook 'coldnew/set-cursor-according-mode)
  (defun coldnew/set-cursor-according-mode ()
    "change cursor shap and color according mode"
    (cond
     (t
      (setq cursor-type emacs-normal-cursor-type)
      (setq cursor-color emacs-normal-cursor-color))))
#+end_src
* 全域性按鍵設置
** Unset key
#+begin_src emacs-lisp
  (defmacro coldnew/global-unset-key (key &rest bindings)
    `(progn
       (let* ((keyf ,key)
              (bindings (list ,@bindings)))
         (with-temp-buffer
           ;;(with-current-buffer (get-buffer-create "tttmp")
           (insert "| unset key ")
           (newline)
           (insert "|-")
           (newline)
           (while keyf
             (global-unset-key keyf)
             (insert (format "| %s \n" (coldnew/parse-keymap keyf)))
             (setq keyf (pop bindings))
             )
           (princ (buffer-string))
           ))))

  (defun coldnew/parse-keymap (s)
    "Parse \C-x to Ctrl-x, and return string."
    (let ((char-list (string-to-list (replace-regexp-in-string " " "" s)))
          (result-list))
      (dolist (char char-list)
        ;;\A to \Z
        ;; set char to cdr of coldnew/keymap-string-alist if assoc succes
        ;; else set char to char
        (setq char (or (reverse (string-to-list (cdr-safe (assoc char coldnew/keymap-string-alist))))
                       char))
        (setq result-list (cons char result-list))
        (setq result-list  (cons  ?\s result-list))
        )
      ;;result-list
      (list-to-string (nreverse
                       (cdr-safe
                        (flatten result-list))))
      ))

  (defvar coldnew/keymap-string-alist
    (let ((result))
      (dolist (char (number-sequence ?\^a ?\^z))
        (add-to-list 'result (cons char (concat "Ctrl-" (char-to-string (1- (+ char ?a)))))))
      result))

  (coldnew/parse-keymap (kbd "C-a e C-x y"))
  (coldnew/parse-keymap "\C-x e ")

  (setq show-paren-delay 0)



#+end_src

#+results: global-unset-key
| unset key |
|-----------|
| Ctrl-x e  |
| Ctrl-x d  |
| Ctrl-x e  |

** test
#+name: global-unset-key
#+begin_src emacs-lisp :results value raw
      (coldnew/global-unset-key
       (kbd "C-x e")
       (kbd "C-x d")
       "\C-x e"
  "\C-x n"
    ;;   "\C-c e"
       )
  (global-unset-key (kbd "C-w"))
#+end_src

** Function key prefix
Function key 設置常用的命令。

| Key | Command             |
|-----+---------------------|
| F1  | woman               |
| F2  | shell-pop           |
| F3  | call-last-kcd-macro |
| F4  | sr-speedbar-toggle  |

#+begin_src emacs-lisp
  (global-set-key (kbd "<f1>")     'woman)
  (global-set-key (kbd "<f2>")     'shell-pop)
  (global-set-key (kbd "<f3>")     'call-last-kbd-macro)
  (global-set-key (kbd "<f4>")     'sr-speedbar-toggle)
#+end_src
** Ctrl Prefix
*** Default Emacs keybinding
#+begin_src emacs-lisp
  (global-set-key (kbd "C-n") 'next-line)
  (global-set-key (kbd "C-p") 'previous-line)
  (global-set-key (kbd "C-b") 'backward-char)
  (global-set-key (kbd "C-f") 'forward-char)
  (global-set-key (kbd "C-e") 'move-end-of-line)
  (global-set-key (kbd "C-a") 'move-beginning-of-line)
#+end_src

*** 向右貪婪刪除
#+begin_src emacs-lisp
  (global-set-key (kbd "C-d") 'hungry-delete-forward)
#+end_src

*** 向左貪婪刪除
#+begin_src emacs-lisp
  (global-set-key (kbd "C-l") 'hungry-delete-backward)
#+end_src

*** Misc
#+begin_src emacs-lisp
  (global-set-key (kbd "C-v") 'coldnew/set-mark-command)
  (global-set-key (kbd "C-]") 'coldnew/toggle-state)
#+end_src

*** iedit
#+begin_src emacs-lisp
  (global-set-key (kbd "C-;") 'iedit-mode)
#+end_src

*** Undo
#+begin_src emacs-lisp
  (global-set-key (kbd "C-/") 'undo-tree-undo)
#+end_src

*** 放大字體
#+begin_src emacs-lisp
  (global-set-key (kbd "C-=") 'text-scale-increase)
#+end_src

*** 縮小字體
#+begin_src emacs-lisp
  (global-set-key (kbd "C--") 'text-scale-decrease)
#+end_src
** Ctrl-x Prefix
*** Misc
| 按鍵    | 命令                | 用途                   |
|---------+---------------------+------------------------|
| C-x C-f | lusty-file-explorer | 查詢並打開檔案         |
| C-x C-y | yank-n-times        | 多次貼上               |
| C-x C-r | lusty-sudo-explorer | 使用 sudo 打開檔案     |
| C-x C-b | ibuffer             | 顯示 ibuffer           |
| C-x C-l | recenter            | 將游標至於 buffer 中間 |
|         |                     |                        |

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-f")  'lusty-file-explorer)
  (global-set-key (kbd "C-x C-r")  'lusty-sudo-explorer)
  (global-set-key (kbd "C-x C-y")  'yank-n-times)
  (global-set-key (kbd "C-x C-l")  'recenter)
  (global-set-key (kbd "C-x C-b")  'ibuffer)
#+end_src

#+begin_src emacs-lisp
  ;;  (global-set-key (kbd "C-x b")    'coldnew/helm-filelist)
  (global-set-key (kbd "C-x C-d")  'dired)
  (global-set-key (kbd "C-x vv") 'egg-next-action)
  (global-set-key (kbd "C-x M-x") 'helm-M-x)
  (global-set-key (kbd "C-x o")   'switch-window)
  (global-set-key (kbd "C-x C-n") 'auto-complete)
  (global-set-key (kbd "C-x C-s") 'save-buffer-always)
  (global-set-key (kbd "C-x F") 'fullscreen-window)
  (global-set-key (kbd "C-x s") 'shell-command)
#+end_src

*** Google 相關
| 按鍵    | 命令                   | 用途           |
|---------+------------------------+----------------|
| C-x g e | google-translate-zh-en | 中文翻譯成英文 |
| C-x g t | google-translate-en-zh | 英文翻譯成中文 |
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x g e") 'google-translate-zh-en)
  (global-set-key (kbd "C-x g t") 'google-translate-en-zh)
#+end_src
*** 轉換
| 按鍵    | 命令                     | 用途                             |
|---------+--------------------------+----------------------------------|
| C-x c c | capitalize-word-backward | 將前面的 word 第一個字母大寫     |
| C-x c l | downcase-word-backward   | 將前面的 word 變成小寫           |
| C-x c u | upcase-word-backward     | 將前面的 word 變成大寫           |
| C-x c x | dos2unix                 | 將目前的檔案轉換成 unix 檔案型式 |
| C-x c d | unix2dos                 | 將目前的檔案轉換成 dos 檔案型式  |
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x c c") 'capitalize-word-backward)
  (global-set-key (kbd "C-x c l") 'downcase-word-backward)
  (global-set-key (kbd "C-x c u") 'upcase-word-backward)
  (global-set-key (kbd "C-x c x") 'dos2unix)
  (global-set-key (kbd "C-x c d") 'unix2dos)
#+end_src
*** emms
| 按鍵        | 命令              | 用途       |
|-------------+-------------------+------------|
| C-x e s     | emms-start        | 啟動 emms  |
| C-x e n     | emms-next         | 下一首曲目 |
| C-x e p     | emms-previous     | 前一首曲目 |
| C-x e <SPC> | emms-pause        | 暫停曲目   |
| C-x e =     | emms-volume-raise | 放大音量   |
| C-x e -     | emms-volume-lower | 縮小音量   |

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x e n") 'emms-next)
  (global-set-key (kbd "C-x e p") 'emms-previous)
  (global-set-key (kbd "C-x e <SPC>") 'emms-pause)
  (global-set-key (kbd "C-x e s") 'emms-start)
  ;;(require 'emms-volume)
  (global-set-key (kbd "C-x e =") 'emms-volume-raise)
  (global-set-key (kbd "C-x e -") 'emms-volume-lower)
#+end_src
** Ctrl-c prefix
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c C-h") 'coldnew/folding-toggle)
  (global-set-key (kbd "C-c C-e") 'eval-and-replace)
#+end_src

*** org-mode                                                          :org:
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c C-l") 'org-insert-link)
  (global-set-key (kbd "C-c o") 'org-iswitchb)
#+end_src

** Ctrl-w prefix
*** 窗口移動
| 按鍵  | 命令           | 用途             |
|-------+----------------+------------------|
| C-x n | windmove-down  | 移動到下面的窗口 |
| C-x p | windmove-up    | 移動到上面的窗口 |
| C-x b | windmove-left  | 移動到左邊的窗口 |
| C-x f | windmove-right | 移動到右邊的窗口 |

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x n") 'windmove-down)
  (global-set-key (kbd "C-x f") 'windmove-right)
  (global-set-key (kbd "C-x b") 'windmove-left)
  (global-set-key (kbd "C-x p") 'windmove-up)
#+end_src
*** TODO 刪除區域或是一行
#+begin_src emacs-lisp
  (global-set-key (kbd "C-w") 'kill-region)
  (global-set-key (kbd "M-w") 'kill-ring-save)
#+end_src
** Ctrl-Meta Prefix
#+begin_src emacs-lisp
  (global-set-key (kbd "C-M-,") 'beginning-of-buffer)
  (global-set-key (kbd "C-M-.") 'end-of-buffer)
  (global-set-key (kbd "C-M-n") 'scroll-other-window)
  (global-set-key (kbd "C-M-p") 'scroll-other-window-down)
#+end_src

** Meta Prefix
*** Default Emacs keybinding
#+begin_src emacs-lisp
(global-set-key (kbd "M-f") 'forward-word)
(global-set-key (kbd "M-b") 'backward-word)
(global-set-key (kbd "M-e") 'forward-sentence)
(global-set-key (kbd "M-a") 'backward-sentence)
#+end_src

#+begin_src emacs-lisp
(global-set-key (kbd "M-r") 'query-replace-regexp)
#+end_src

