config.el

(defvar emacs-read-only-cursor-color "gray")
(defvar emacs-read-only-cursor-type 'box)

(defvar emacs-overwrite-cursor-color "yellow")
(defvar emacs-overwrite-cursor-type 'hbar)

;;;; ---------------------------------------------------------------------------
;;;; Hooks
;;;; ---------------------------------------------------------------------------
(add-hook 'post-command-hook 'coldnew/set-cursor-according-mode)


;;;; ---------------------------------------------------------------------------
;;;; Functions
;;;; ---------------------------------------------------------------------------
(defun coldnew/set-cursor-according-mode ()
  "change cursor shap and color according mode"
  (cond
   ((string= "Command" coldnew-editor-state)
    (setq cursor-type emacs-read-only-cursor-type)
    (setq cursor-color emacs-read-only-cursor-color))
   (buffer-read-only
    (setq cursor-type emacs-read-only-cursor-type)
    (setq cursor-color emacs-read-only-cursor-color))
   ;; (overwrite-mode
   ;;   (set-cursor-color djcb-overwrite-color)
   ;;   (setq cursor-type djcb-overwrite-cursor-type))
   (t
    (setq cursor-type emacs-normal-cursor-type)
    (setq cursor-color emacs-normal-cursor-color))))

(defmacro coldnew/global-unset-key (key &rest bindings)
  `(progn
     (let* ((keyf ,key)
            (bindings (list ,@bindings)))
       (with-temp-buffer
         ;;(with-current-buffer (get-buffer-create "tttmp")
         (insert "| unset key ")
         (newline)
         (insert "|-")
         (newline)
         (while keyf
           (global-unset-key keyf)
           (insert (format "| %s \n" (coldnew/parse-keymap keyf)))
           (setq keyf (pop bindings))
           )
         (princ (buffer-string))
         ))))

(defun coldnew/parse-keymap (s)
  "Parse \C-x to Ctrl-x, and return string."
  (let ((char-list (string-to-list (replace-regexp-in-string " " "" s)))
        (result-list))
    (dolist (char char-list)
      ;;\A to \Z
      ;; set char to cdr of coldnew/keymap-string-alist if assoc succes
      ;; else set char to char
      (setq char (or (reverse (string-to-list (cdr-safe (assoc char coldnew/keymap-string-alist))))
                     char))
      (setq result-list (cons char result-list))
      (setq result-list  (cons  ?\s result-list))
      )
    ;;result-list
    (list-to-string (nreverse
                     (cdr-safe
                      (flatten result-list))))
    ))

(defvar coldnew/keymap-string-alist
  (let ((result))
    (dolist (char (number-sequence ?\^a ?\^z))
      (add-to-list 'result (cons char (concat "Ctrl-" (char-to-string (1- (+ char ?a)))))))
    result))

(coldnew/parse-keymap (kbd "C-a e C-x y"))
(coldnew/parse-keymap "\C-x e ")

(setq show-paren-delay 0)

(coldnew/global-unset-key
   (kbd "C-x e")
   (kbd "C-x d")
   "\C-x e"
;;   "\C-c e"
   )

(global-set-key (kbd "<f1>")     'woman)
(global-set-key (kbd "<f2>")     'shell-pop)
(global-set-key (kbd "<f3>")     'call-last-kbd-macro)
(global-set-key (kbd "<f4>")     'sr-speedbar-toggle)

(global-set-key (kbd "C-n") 'next-line)
(global-set-key (kbd "C-p") 'previous-line)
(global-set-key (kbd "C-b") 'backward-char)
(global-set-key (kbd "C-f") 'forward-char)
(global-set-key (kbd "C-e") 'move-end-of-line)
(global-set-key (kbd "C-a") 'move-beginning-of-line)

(global-set-key (kbd "C-l") 'hungry-delete-backward)
(global-set-key (kbd "C-d") 'hungry-delete-forward)
;;(global-set-key (kbd "C-u") 'backward-kill-line)

(global-set-key (kbd "C-;") 'iedit-mode)
(global-set-key (kbd "C-v") 'coldnew/set-mark-command)
(global-set-key (kbd "C-/") 'undo-tree-undo)
(global-set-key (kbd "C-]") 'coldnew/toggle-state)

(global-set-key (kbd "C-x C-f")  'lusty-file-explorer)
(global-set-key (kbd "C-x C-b")  'ibuffer)
(global-set-key (kbd "C-x b")    'coldnew/helm-filelist)
(global-set-key (kbd "C-x C-d")  'dired)
(global-set-key (kbd "C-x C-r")  'sudo-edit)
(global-set-key (kbd "C-x vv") 'egg-next-action)
(global-set-key (kbd "C-x M-x") 'helm-M-x)
(global-set-key (kbd "C-x o")   'switch-window)
(global-set-key (kbd "C-x C-l") 'recenter-top-bottom)
(global-set-key (kbd "C-x C-n") 'auto-complete)
(global-set-key (kbd "C-x C-s") 'save-buffer-always)
(global-set-key (kbd "C-x f") 'fullscreen-window)
(global-set-key (kbd "C-x s") 'shell-command)

(global-set-key (kbd "C-c C-h") 'coldnew/folding-toggle)

(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c C-l") 'org-insert-link)
(global-set-key (kbd "C-c o") 'org-iswitchb)

(global-set-key (kbd "C-M-,") 'beginning-of-buffer)
(global-set-key (kbd "C-M-.") 'end-of-buffer)
(global-set-key (kbd "C-M-n") 'scroll-other-window)
(global-set-key (kbd "C-M-p") 'scroll-other-window-down)

(global-set-key (kbd "M-f") 'forward-word)
(global-set-key (kbd "M-b") 'backward-word)
(global-set-key (kbd "M-e") 'forward-sentence)
(global-set-key (kbd "M-a") 'backward-sentence)

(global-set-key (kbd "M-s") 'coldnew/helm-occur)
(global-set-key (kbd "M-l") 'backward-delete-word)
