config.org
*** Misc
#+begin_src emacs-lisp
  (global-set-key (kbd "M-s") 'coldnew/helm-occur)
  (global-set-key (kbd "M-l") 'backward-delete-word)
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (global-set-key (kbd "M-n") 'scroll-up)
  (global-set-key (kbd "M-p") 'scroll-down)
  (global-set-key (kbd "M-g") 'linum-ace-jump)
  (global-set-key (kbd "M-v") 'er/expand-region)
  (global-set-key (kbd "M-q") 'coldnew/switch-to-command-mode)
  (global-set-key (kbd "M-/") 'undo-tree-redo)
  (global-set-key (kbd "M-.") 'helm-etags+-select-one-key)
  (global-set-key (kbd "M-x") 'smex)
  (global-set-key (kbd "M-X") 'smex-major-mode-commands)

  ;; (global-set-key (kbd "M-1") 'delete-other-windows)
  ;; (global-set-key (kbd "M-2") 'split-window-below)
  ;; (global-set-key (kbd "M-3") 'split-window-right)
  ;; (global-set-key (kbd "M-4") 'delete-window)
  ;; (global-set-key (kbd "M-0") 'other-window)
  ;;  (global-set-key (kbd "M-j") 'switch-window)
  ;;  (global-set-key (kbd "M-i") 'yas/expand)


#+end_src

** Meta-j prefix
*** ECB
#+begin_src emacs-lisp
;;  (global-set-key (kbd "C-0 e") 'ecb-toggle-ecb-windows)
;;  (global-set-key (kbd "C-0 1") 'ecb-goto-window-edit1)
;;  (global-set-key (kbd "C-0 2") 'ecb-goto-window-edit2)
;;  (global-set-key (kbd "C-0 m") 'ecb-goto-window-methods)
; ; (global-set-key (kbd "C-0 l") 'ecb-toggle-layout)
#+end_src
*** Window move
#+begin_src emacs-lisp
;;  (global-set-key (kbd "M-j n") 'windmove-down)
;;  (global-set-key (kbd "M-j p") 'windmove-up)
;;  (global-set-key (kbd "M-j b") 'windmove-left)
;;  (global-set-key (kbd "M-j f") 'windmove-right)
#+end_src
** Shift prefix
#+begin_src emacs-lisp
  (global-set-key[(shift return)] 'insert-empty-line)
#+end_src

** Super prefix
#+begin_src emacs-lisp
  (global-set-key (kbd "s-l") 'linum-mode)
  (global-set-key (kbd "s-s") 'shell-command)
#+end_src
** Other
#+begin_src emacs-lisp
  (global-set-key (kbd "<delete>") 'hungry-delete-forward)
  (global-set-key (kbd "C-.") 'repeat)
  (global-set-key (kbd "%") 'match-paren)

#+end_src
全域性設定 (）、 ""、 []、 {}具有自動補全功能
#+begin_src emacs-lisp
  ;; (global-set-key (kbd "(") 'paredit-open-parenthesis)
  ;; (global-set-key (kbd ")") 'paredit-close-parenthesis)
  ;; (global-set-key (kbd "[") 'paredit-open-square)
  ;; (global-set-key (kbd "]") 'paredit-close-square)
  ;; (global-set-key (kbd "{") 'paredit-open-curly)
  ;; (global-set-key (kbd "}") 'paredit-close-curly)
  ;; (global-set-key (kbd "\"") 'paredit-doublequote)
#+end_src

* Register                                                         :register:
** TODO add now doc
** 複製貼上多次
Use registers. Mark the region, store it in register `a' and insert the
contents of register `a' multiple times.

Mark region

C-x r s a

C-x r i a
C-x r i a
*** C-x r s copy-to-register
*** C-x r i insert-register
** 放置快速跳轉的捷徑命令。
使用 Ctrl-x r j <char> 就可以進行快速跳轉至檔案，其中 <char> 為以下所設定。
#+begin_src emacs-lisp
  (dolist
      (r `(
           ;; emacs-config
           (?e (file . ,(expand-file-name emacs-config-file)))
           ;; TODO.org
           (?t (file . "~/Dropbox/Org/TODO.org"))
           ;; (?b (file . "~/personal/business.org"))
           ))
    (set-register (car r) (cadr r)))
#+end_src

* Deprecated
:PROPERTIES:
:tangle: no
:END:
這邊放置的是不再使用的設定,並且這邊的設定並不會輸出至我的 emacs-config 上。
#+begin_src emacs-lisp
  (defun sacha/search-word-backward ()
    "Find the previous occurrence of the current word."
    (interactive)
    (let ((cur (point)))
      (skip-syntax-backward "w_")
      (goto-char
       (if (re-search-backward (concat "\\_<" (current-word) "\\_>") nil t)
           (match-beginning 0)
         cur))))

  (defun sacha/search-word-forward ()
    "Find the next occurrence of the current word."
    (interactive)
    (let ((cur (point)))
      (skip-syntax-forward "w_")
      (goto-char
       (if (re-search-forward (concat "\\_<" (current-word) "\\_>") nil t)
           (match-beginning 0)
         cur))))
  (global-set-key '[M-up] 'sacha/search-word-backward)
  (global-set-key '[M-down] 'sacha/search-word-forward)
#+end_src

#+begin_src emacs-lisp
  (defun sacha/find-tags ()
    "Set the TAGS file."
    (set (make-variable-buffer-local 'tags-table-list) nil)
    (set (make-variable-buffer-local 'tags-file-name)
         (sacha/recursive-find-file "TAGS")))
#+end_src

https://github.com/travisbhartwell/emacs-config/blob/master/HOME/_emacs.d/init-helpers.el
http://doc.norang.ca/org-mode.html
http://jixiuf.github.com/tags/@Emacs.html

#+begin_src emacs-lisp
  (defun run-rand (n times)
    (defun run-rand-iter (k)
      (cond ((= k times) (princ (concat (number-to-string (random n)) "\n")))
            (t
             (princ (concat (number-to-string (random n)) "\n"))
             (run-rand-iter (+ k 1)))))
    (run-rand-iter 0))

#+end_src

* Other
** TODO 為 google-weather 增加編碼的設定
#+begin_src emacs-lisp
  (defun google-weather-build-url (location &optional language)
    "Build URL to retrieve weather for LOCATION in LANGUAGE."
    (concat "http" (when google-weather-use-https "s") "://" google-weather-url "?weather=" (url-hexify-string location)
            (when language
              (concat "&hl=" language))
            ;; add for encoding
            (concat "&oe=" "utf8")))
#+end_src

* Local File Variable
# Local Variables:
# mode: org
# End:









