config.el
(global-set-key (kbd "M-y") 'helm-show-kill-ring)
(global-set-key (kbd "M-n") 'scroll-up)
(global-set-key (kbd "M-p") 'scroll-down)
(global-set-key (kbd "M-g") 'linum-ace-jump)
(global-set-key (kbd "M-v") 'er/expand-region)
(global-set-key (kbd "M-q") 'coldnew/switch-to-command-mode)
(global-set-key (kbd "M-/") 'undo-tree-redo)
(global-set-key (kbd "M-.") 'helm-etags+-select-one-key)
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)

;; (global-set-key (kbd "M-1") 'delete-other-windows)
;; (global-set-key (kbd "M-2") 'split-window-below)
;; (global-set-key (kbd "M-3") 'split-window-right)
;; (global-set-key (kbd "M-4") 'delete-window)
;; (global-set-key (kbd "M-0") 'other-window)
;;  (global-set-key (kbd "M-j") 'switch-window)
;;  (global-set-key (kbd "M-i") 'yas/expand)

;;  (global-set-key (kbd "C-0 e") 'ecb-toggle-ecb-windows)
;;  (global-set-key (kbd "C-0 1") 'ecb-goto-window-edit1)
;;  (global-set-key (kbd "C-0 2") 'ecb-goto-window-edit2)
;;  (global-set-key (kbd "C-0 m") 'ecb-goto-window-methods)
; ; (global-set-key (kbd "C-0 l") 'ecb-toggle-layout)

;;  (global-set-key (kbd "M-j n") 'windmove-down)
;;  (global-set-key (kbd "M-j p") 'windmove-up)
;;  (global-set-key (kbd "M-j b") 'windmove-left)
;;  (global-set-key (kbd "M-j f") 'windmove-right)

(global-set-key [(shift return)] 'insert-empty-line)

(global-set-key (kbd "s-n") 'windmove-down)
(global-set-key (kbd "s-p") 'windmove-up)
(global-set-key (kbd "s-b") 'windmove-left)
(global-set-key (kbd "s-f") 'windmove-right)

(global-set-key (kbd "<delete>") 'hungry-delete-forward)
(global-set-key (kbd "C-.") 'repeat)
(global-set-key (kbd "%") 'match-paren)

(global-set-key (kbd "(") 'paredit-open-parenthesis)
(global-set-key (kbd ")") 'paredit-open-parenthesis)
(global-set-key (kbd "[") 'paredit-open-square)
(global-set-key (kbd "{") 'paredit-open-curly)
(global-set-key (kbd "\"") 'paredit-doublequote)

(dolist
    (r `(
         ;; emacs-config
         (?e (file . ,(expand-file-name emacs-config-file)))
         ;; TODO.org
         (?t (file . "~/Dropbox/Org/TODO.org"))
         ;; (?b (file . "~/personal/business.org"))
         ))
  (set-register (car r) (cadr r)))

(defun google-weather-build-url (location &optional language)
  "Build URL to retrieve weather for LOCATION in LANGUAGE."
  (concat "http" (when google-weather-use-https "s") "://" google-weather-url "?weather=" (url-hexify-string location)
          (when language
            (concat "&hl=" language))
          ;; add for encoding
          (concat "&oe=" "utf8")))
